Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/csseditor.po
Languages: fr_fr

source: The CSS Editor module allows you to write CSS from the Omeka S admin interface.
fr_fr: Le module CSS Editor vous permet d’écrire du CSS à partir de l’interface d’administration d’Omeka S.

source: Once activated on the [modules](https://omeka.org/s/docs/user-manual/modules/) tab of the admin dashboard, CSS Editor is used on a site-by-site basis.
fr_fr: Une fois activé sur l’onglet [modules](https://omeka.org/s/docs/user-manual/modules/) du tableau de bord d’administration, CSS Editor est utilisé site par site.

source: Managing Custom CSS
fr_fr: Gestion CSS personnalisée

source: If CSSEditor is active, then a tab for CSSEditor will appear in the context menu for every site.
fr_fr: Si CSS Editor est activé, un onglet CSS Editor apparaît dans le menu contextuel de chaque site.

source: ![Screenshot of Omeka S site context menu witth CSS Editor navigation item highlighted.](modulesfiles/csseditor_contextmenu.jpg)
fr_fr: ![Capture d’écran du menu contextuel du site Omeka S avec l’onglet de l’éditeur CSS mis en évidence.](modulesfiles/csseditor_contextmenu.jpg)

source: Using the CSSEditor interface
fr_fr: Utilisation de l’interface de CSS Editor

source: ![Screenshot of CSS Editor module interface.](modulesfiles/csseditor_interface.jpg)
fr_fr: ![Capture d’écran de l’interface du module CSS Editor.](modulesfiles/csseditor_interface.jpg)

source: The first large text area is where you write your individual styles. Use that text area as you would a stylesheet file.
fr_fr: La première zone de texte est l’endroit où vous écrivez vos propres règles CSS. Utilisez cette zone comme avec un fichier de feuille de style.

source: If you are new to working with CSS, we recommend the following free resources for getting started:
fr_fr: Si vous débutez avec CSS, nous vous recommandons les ressources gratuites suivantes pour commencer :

source: [Mozilla's "Learn CSS"](https://developer.mozilla.org/en-US/docs/Web/CSS)
fr_fr: [« Apprendre le CSS » de Mozilla](https://developer.mozilla.org/fr/docs/Web/CSS)

source: [Codecademy's "Learn CSS" course](https://www.codecademy.com/learn/learn-css)
fr_fr: [le cours « Apprendre le CSS » de Codecademy](https://www.codecademy.com/learn/learn-css)

source: [Marksheet's "CSS Basics"](https://marksheet.io/css-basics.html)
fr_fr: [« CSS Basics » de Marksheet](https://marksheet.io/css-basics.html)

source: Next, CSS Editor also allows you to include external stylesheets by entering their URLs. There is no limit to the number of external stylesheet URLs you can enter. Each text input can take a single URL, and additional inputs can be created by clicking the button that reads "Add another stylesheet".
fr_fr: CSS Editor vous permet également d’inclure des feuilles de style externes en saisissant leurs URL. Il n’y a pas de limite au nombre d’URL de feuilles de style externes que vous pouvez saisir. Chaque champ ne peut recevoir qu’une seule URL, une entrée supplémentaire peut être créée en cliquant sur le bouton « Add another stylesheet ».

source: To remove external stylesheets, either clear the text inputs, or click on the trash can icon if there are multiple stylesheet fields.
fr_fr: Pour supprimer les feuilles de style externes, effacez les entrées de texte ou cliquez sur l’icône « corbeille » s’il y a plusieurs champs de feuilles de style.

source: ![Screenshot of CSS Editor module interface, cropped to focus on external stylesheet field with remove button (trash can icon) highlighted.](modulesfiles/csseditor_remove.jpg) <br><br>
fr_fr: ![Capture d’écran de l’interface du module de l’éditeur CSS, centrée le champ de la feuille de style externe avec le bouton de suppression (icône « poubelle ») mis en évidence.](modulesfiles/csseditor_remove.jpg) <br><br>

source: Tutorial: Using a Google Webfont
fr_fr: Tutoriel : Utilisation d'une police Web de Google

source: You can make your Omeka S site more distinct by using a custom font. [Google provides a free library of webfonts](https://fonts.google.com/), and this tutorial will demonstrate how to apply a webfont to an Omeka S site using the "Default" theme through the CSS Editor interface.
fr_fr: Vous pouvez distinguer votre site Omeka S en utilisant une police personnalisée. [Google fournit une bibliothèque gratuite de polices Web] (https://fonts.google.com/). Ce tutoriel montre comment appliquer une police Web à un site Omeka S utilisant le thème « Default » via l’interface de l’éditeur CSS.

source: For reference, the "Default" theme begins looking like this, using the "Open Sans" font.
fr_fr: À titre de référence, le thème « Default » ressemble à ceci, avec la police « Open Sans ».

source: ![Screenshot of Omeka S site with "Default" theme. All the text us using "Open Sans".](modulesfiles/csseditor_before.jpg)
fr_fr: ![Capture d’écran du site Omeka S avec le thème « Default ». Tout le texte utilise « Open Sans ».](modulesfiles/csseditor_before.jpg)

source: This tutorial will override "Open Sans" with the "Lato" font family.
fr_fr: Ce tutoriel va remplacer « Open Sans » par la famille de polices « Lato ».

source: Navigate to [Google Fonts](https://fonts.google.com/). Find the "Lato" font family and click on the orange "+" button to select it. <br><br> ![Google Fonts main page with "Lato" font family highlighted](modulesfiles/csseditor_tutorial1.jpg) <br><br>
fr_fr: Allez sur [Google Fonts] (https://fonts.google.com/). Trouvez la famille de polices « Lato » et cliquez sur le bouton orange « + » pour la sélectionner. <br><br> ! [Page principale de Google Fonts avec la famille de polices « Lato » mise en évidence](modulesfiles/csseditor_tutorial1.jpg) <br><br>

source: A bar labeled "1 Family Selected" will appear in the lower right corner. Click on this bar. <br><br> ![Cropped view of Google Fonts page with selected font family bar highlighted](modulesfiles/csseditor_tutorial2.jpg) <br><br>
fr_fr: Une barre intitulée « 1 Selected family » apparaît en bas à droite. Cliquez sur cette barre. <br><br> ![Vue recadrée de la page Google Fonts avec la barre des familles de polices sélectionnées mise en évidence](modulesfiles/csseditor_tutorial2.jpg) <br><br>

source: The bar will open a panel with the information you'll need to use Lato in your site. The first section, "Embed this font", has the external stylesheet URL you need. Select the URL in the `href` attribute, as pictured. <br><br> ![Screenshot of "Embed this font" section with external stylesheet url ("https://fonts.googleapis.com/css?family=Lato&display=swap") highlighted.](modulesfiles/csseditor_tutorial3.jpg) <br><br>
fr_fr: La barre ouvrira un panneau contenant les informations dont vous aurez besoin pour utiliser Lato dans votre site. La première section, « Embed this font », contient l’URL de la feuille de style externe dont vous avez besoin. Sélectionnez l’URL dans l’attribut `href`, comme illustré. <br><br> ![Capture d’écran de la section « Embed this font « avec l’url de la feuille de style externe (« https://fonts.googleapis.com/css?family=Lato&display=swap « ) mise en évidence.](modulesfiles/csseditor_tutorial3.jpg) <br><br>

source: Copy this URL into one of the "External stylesheets" inputs in CSS Editor. <br><br> ![Screenshot of CSS Editor module interface, cropped to focus on external stylesheet field with pasted stylesheet url.](modulesfiles/csseditor_tutorial4.jpg) <br><br>
fr_fr: Copiez cette URL dans l’une des entrées « External stylesheets » de CSS Editor. <br><br> ![Capture d’écran de l’interface du module CSS Editor, centrée sur le champ de la feuille de style externe avec une url de feuille de style.](modulesfiles/csseditor_tutorial4.jpg) <br><br>

source: Back in the Google Fonts panel, there is the second section titled "Specify in CSS". Copy the `font-family` rule. ![Screenshot of "Specify in CSS" section with font-family rule ("font-family: 'Lato', sans-serif;") highlighted.](modulesfiles/csseditor_tutorial5.jpg) <br><br>
fr_fr: De retour dans le panneau Google Fonts, il y a la deuxième section intitulée « Specify in CSS ». Copiez la règle `font-family`. ![Capture d’écran de la section « Specify in CSS » avec la règle `font-family` font-family (`font-family: ‘Lato’, sans-serif ;`) mise en évidence.](modulesfiles/csseditor_tutorial5.jpg) <br><br>

source: For this tutorial, you are setting Lato as the site's default font. To do this, in the large "CSS" text area in CSS Editor, set the `body` element's font family using the rule you just copied. ![Screenshot of CSS Editor module interface, cropped to focus on CSS text area with pasted body font-family rule ('body {font-family: "Lato", sans-serif;}').](modulesfiles/csseditor_tutorial6.jpg) <br><br>
fr_fr: Pour ce tutoriel, vous allez définir Lato comme la police par défaut du site. Pour ce faire, dans la grande zone de texte « CSS » de l’éditeur CSS, définissez la famille de caractères de l’élément `body` à l’aide de la règle que vous venez de copier. ![Capture d’écran de l’interface du module Éditeur CSS, centrée sur la zone de texte CSS avec la règle correspondante à la famille de polices de l’élément `body` (‘body {font-family : Lato, sans-serif;}’).](modulesfiles/csseditor_tutorial6.jpg) <br><br> Traduit avec www.DeepL.com/Translator (version gratuite)

source: Click the "Save" button in the top right corner.
fr_fr: Cliquez sur le bouton « Enregistrer » présent dans le coin supérieur droit.

source: Now the "Default" theme should look like this.
fr_fr: Maintenant, le thème « Default » devrait ressembler à ceci.

source: ![Screenshot of Omeka S site with "Default" theme. All the text us using "Lato".](modulesfiles/csseditor_after.jpg)
fr_fr: ![Capture d’écran du site Omeka S avec le thème « Default ». La police du texte est « Lato ».](modulesfiles/csseditor_after.jpg)
