Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/csvimport.po
Languages: fr_fr

source: CSV Import
fr_fr: Import CSV

source: If you have multiple inputs for a single property, you can separate them with a secondary **multivalue separator**. For example, a work with multiple authors (E.B. White and William Strunk Jr.) with the column for Creator containing "E.B. White;William Strunk Jr" has a semicolon (;) as the multivalue separator. When imported into Omeka S, each of these would appear as a separate entry in the property (Creator: "E.B. White" and Creator: "William Strunk Jr."). Note that the import will be the same whether you leave a space after your separator (as in "E.B. White; William Strunk Jr") or not.
fr_fr: Si vous avez plusieurs données pour une même propriété, vous pouvez les séparer avec un **séparateur** secondaire. Par exemple, une oeuvre ayant plusieurs auteurs (E.B. White et William Strunk Jr.) peut afficher un point-virgule (;) comme séparateur de valeurs dans une colonne Créateur contenant "E.B. White;William Strunk Jr.". Après import dans Omeka S, chacune de ces données s'affichera dans un champ de propriété distinct (Créateur : "E.B. White" et Créateur : "William Strunk Jr."). L'import sera le même si vous laissez une espace après votre séparateur.

source: Column names
fr_fr: Noms de colonnes

source: In the table of vocabulary properties, there is a column for **Term**. Use the Term as the column heading for the property you want to automap in CSV Import. For example, "dcterms:abstract" would automap to the Dublin Core property "Abstract" and "foaf:firstName" would automap to the Friend of a Friend property "firstName".
fr_fr: Dans la table de propriétés du vocabulaire, vous trouverez une colonne **Termes**. Utilisez les termes comme en-têtes de colonnes pour les propriétés que vous souhaitez transposer automatiquement lors de l'import CSV. Par exemple, "dcterms:abstract" transposera directement la propriété Dublin Core "Résumé" et "foaf:firstName" transposera automatiquement la propriété Friend of a Friend "Prénom".

source: There is a setting in the inital import settings to automap with simple labels - this will work with columns whose names match a vocabulary label, for example "title" or "abstract", without supplying the term. Note that this option defaults to Dublin Core (`dcterms:title` and `dcterms:abstract`) before proceeding through other installed vocabularies.
fr_fr: Un paramétrage de base permet le transfert automatique à partir d'étiquettes simples - cela fonctionne avec les colonnes dont le nom correspond à une étiquette de vocabulaire comme "title" ou "abstract", sans fournir le terme complet. Cette option parcourt par défaut Dublin Core (`dcterms:title` et `dcterms:abstract`) avant de passer aux autres vocabulaires.

source: If your column names are not exact and the automapping feature does not recognize them, you should still label them something helpful so that you can manually map them while importing.
fr_fr: Si vous noms de colonnes ne sont pas exacts et que la transposition automatique ne se fait pas, donnez quand même à vos colonnes des noms pertinents pour pouvoir faire la transposition manuellement pendant l'import.

source: If you have plans to batch-import metadata or properties that come with a module (such as latitude and longitude from the Mapping module) or using structured vocabularies that come from modules (such as the data types from the Value Suggest module), install and configure those modules first to ensure that the fields exist in your site's data model, before trying to enter information into those fields. Data may be lost if you uninstall those modules later.
fr_fr: Si vous prévoyez d'importer des métadonnées ou des propriétés en lot à partir d'un module (comme latitude et longitude du module Mapping) ou d'utiliser des vocabulaires structurés venant de modules (comme les types de données du module Value Suggest), commencez par installer et configurer ces modules pour vous assurer que les champs existent dans le modèle de données de votre site, puis saisissez des information dans ces champs. Des données peuvent être perdues si vous désinstallez ces modules plus tard.

source: Initial import settings
fr_fr: Paramétrages de l'import initial

source: comma (default)
fr_fr: virgule (par défaut)

source: semi-colon
fr_fr: point-virgule

source: colon
fr_fr: deux points

source: carriage return
fr_fr: retour chariot

source: space
fr_fr: espace

source: pipe (`|`).
fr_fr: tube "|".

source: From the **CSV column enclosure** dropdown, choose the option that encloses long text in your file, if applicable:
fr_fr: Sélectionnez dans le menu déroulant **Délimiteur de colonne CSV** une des options suivantes pour délimiter les blocs de texte de votre fichier, si nécessaire :

source: double quote (default)
fr_fr: guillemet droit (par défaut)

source: quote
fr_fr: apostrophe droite

source: From the **Import type** dropdown, select what you are importing:
fr_fr: Sélectionnez dans le menu déroulant **Type d'import** ce que vous versez:

source: Items
fr_fr: Contenus

source: Users.
fr_fr: Utilisateurs.

source: Click the "Next" button to continue with the import process.
fr_fr: Cliquez sur le bouton "Suivant" pour continuer l'import.

source: Import items
fr_fr: Importer des Contenus

source: To import items, select "Items" under the "Import type" on the first page.
fr_fr: Pour importer des contenus, sélectionnez "Contenus" dans "Type d'import" sur la première page.

source: Map to Omeka S data
fr_fr: Mapper vers les données Omeka S

source: This tab displays a table with the columns from your spreadsheet as rows. Each row displays:
fr_fr: Cet onglet affiche un tableau reportant les colonnes de votre tableur en lignes. Chaque ligne contient :

source: A checkbox
fr_fr: Une case à cocher

source: The column header from the spreadsheet
fr_fr: L'en-tête de colonne de votre tableur

source: A plus symbol button for adding or modifying a mapping
fr_fr: Un bouton avec le symbole plus pour ajouter ou modifier une correspondance

source: A wrench symbol button for spreadsheet column options
fr_fr: Un symbole de clé à molette pour les options des colonnes du tableur

source: Mapping options
fr_fr: Options pour les correspondances

source: The drawer has multiple options for mapping:
fr_fr: Ce volet propose plusieurs options pour les correspondances :

source: ![dropdown as described](../modules/modulesfiles/csvimport_itemsMapISD.png)
fr_fr: ![menu déroulant tel que décrit](../modules/modulesfiles/csvimport_itemsMapISD.fr.png)

source: **Generic data** also has a dropdown where you can set one of four options:
fr_fr: **Métadonnée commune** contient un menu déroulant où choisir entre quatre options :

source: **Resource template (by label)**: Set the template for an item by name. The name of the template as entered in the spreadsheet and the name of the template in Omeka S must match exactly.
fr_fr: **Modèle de ressource (par le label)**: Établissez le modèle pour un contenu par son nom. Le nom du modèle est intégré au tableur et doit correspondre exactement au nom de celui de l'instance Omeka S.

source: **Resource class (by term)**: Set the resource class for an item. The term for the class in the spreadsheet and in the Omeka S installation must match exactly.
fr_fr: **Classe de ressource (par terme)** : Établissez la classe de ressource d'un contenu. Le terme de la classe dans le tableur doit être le même que celui de l'instance Omeka S.

source: **Owner (by email address)**: Set an item's owner by email address. This must be the email address associated with the user's account in the Omeka S installation.
fr_fr: **Propriétaire (par le courriel)** : Établissez le propriétaire d'un contenu par son adresse e-mail. Cette adresse doit être la même que celle associée au compte utilisateur dans l'instance Omeka S.

source: **Visibility public/private**: Set the visibility of the item. Use "private" or "public" in the spreadsheet.
fr_fr: **Visibilité public/privé** : Établissez la visibilité d'un contenu. Utilisez "privé" ou "public" dans le tableur.

source: ![Dropdown as described](../modules/modulesfiles/csvimport_itemsMapgeneric.png)
fr_fr: ![Menu déroulant tel que décrit](../modules/modulesfiles/csvimport_itemsMapgeneric.fr.png)

source: oEmbed (link)
fr_fr: oEmbed (lien)

source: URL
fr_fr: Chargement serveur

source: YouTube (link).
fr_fr: Youtube (lien)

source: Be sure to click the "Apply Changes" at the bottom of the drawer or nothing you set here will be kept.
fr_fr: Cliquez sur le bouton "Appliquez les changements" en bas du volet ou les modifications ne seront pas sauvegardées.

source: To remove a mapping, click the trash can icon in the row for that data mapping. It will remove *only* the mapping, not the column data.
fr_fr: Pour retirer une correspondance, cliquez sur l'icône poubelle sur la ligne de cette correspondance. Cela retirera *seulement* la correspondance, pas les données de la colonne.

source: If you have data in a column in your CSV that you do not want to bring in to your Omeka S installation, simply do not map that column to a property or data type.
fr_fr: Si vous ne souhaitez pas importer les données de certaines colonnes dans votre instance Omeka S, n'établissez pas de correspondances pour ces colonnes.

source: Column options
fr_fr: Options de colonnes

source: This will open a drawer on the right side of the browser window with the following options:
fr_fr: Cela ouvre un volet sur la droite de la fenêtre avec les options suivantes :

source: **Use multivalve separator**: Check this box to use the multivalue separator for data in this column. You set the multivalue separator in the initial import page, but you can change it in the Basic Settings tab.
fr_fr: **Utiliser un séparateur multivalué** : cocher cette case pour utiliser un séparateur multivalué pour cette colonne. Vous paramétrez le séparateur multivalué sur la page d'import initiale, mais vous pouvez le changer dans l'onglet des Paramètres de base.

source: **Language**: Set the language for this column using the [IETF Language tag](https://en.wikipedia.org/wiki/IETF_language_tag) for the language in which the text is written. This will override what you have entered in basic settings.
fr_fr: **Langue** : établissez la langue pour cette colonne en utilisant le [code de langue IETF](https://en.wikipedia.org/wiki/IETF_language_tag). Cette action prend le pas sur ce que vous saisissez dans les Paramètres de base.

source: **Data type**: A dropdown with at least three options, which correspond to the [values](../content/items.md#values) one can use when adding properties to an item:
fr_fr: **Data type** : un menu déroulant avec au moins trois options, qui correspondent aux [valeurs](../content/items.md#values) utilisables quand on ajoute des propriétés à un contenu :

source: Import as text (default).
fr_fr: Importer comme texte (par défaut).

source: Import as URI reference. You can set the label for a URI by including the desired text after a space, for example: `http://example.com Label Text Goes Here`.
fr_fr: Importer comme URI. Vous pouvez indiquer l'étiquette pour une URI après une espace, par exemple : `http://example.com Texte d'étiquette ici`.

source: Import as Omeka S resource ID. Note that you must have the correct ID for the resource. A resource's ID is the number sequence at the end of the URL when on the view or edit page, so for `/admin/item/11576` the ID is 11576. You can also see the resource's ID in the right-hand drawer on the resource's view page. Items, item sets, and media all have IDs.
fr_fr: Importer comme ressource Omeka S (par ID). Il vous faut l'ID correct de la ressource. Un ID de ressource correspond à la séquence numérique à la fin de l'URL sur la page d'édition ou de vue du contenu : pour `/admin/item/11576`, l'ID est 11576. Vous pouvez aussi voir l'ID de la ressource dans le volet droit de la page de vue de la ressource. Les contenus, collections et médias ont tous des IDs.

source: If you have certain modules installed, such as [Numeric Data Types](../modules/numericdatatypes.md), there may be additional data type options supplied by those modules.
fr_fr: Si vous avez installé certains modules comme [Numeric Data Types](../modules/numericdatatypes.md), il y aura peut-être d'autres options de type fournies par ces modules.

source: **Import values as private**: Check this box to set all property values *in this column* private.
fr_fr: **Importer les valeurs comme privées** : Cochez cette case pour établir toutes les valeurs *de cette colonne* comme privées.

source: ![drawer with options as described above](../modules/modulesfiles/csvimport_ItemColOpt.png)
fr_fr: ![volet avec options telles que décrites ci-dessus](../modules/modulesfiles/csvimport_ItemColOpt.fr.png)

source: Be sure to click the "Apply Changes" button at the bottom of the drawer in order to save your changes.
fr_fr: Cliquez bien sur le bouton "Appliquer les changements" en bas du volet pour sauvegarder les modifications.

source: To remove a column option setting, click the wrench icon again and undo your changes manually.
fr_fr: Pour retirer un paramétrage de colonne, cliquez de nouveau sur l'icône clé à molette et retirez manuellement vos modifications.

source: Batch edit
fr_fr: Modification en lot

source: ![a screenshot of the Mapping tab, with the boxes for Columns Title and Creator checked. A red arrow points to the Batch edit options button. On the right side of the screen, a drawer offers options for changing the settings as described](../modules/modulesfiles/csvimport_batchEditItems.png)
fr_fr: ![Capture de l'onglet de correspondance, avec les cases Titre et Créateur cochées. Une flèche rouge pointe vers les options de modification en lot. À la droite de l'écran, un volet propose des options pour changer les paramètres](../modules/modulesfiles/csvimport_batchEditItems.fr.png)

source: Item import basic settings
fr_fr: Paramètres de base

source: These settings apply to the entire CSV you are importing. Note that some of these settings can be overwritten by column options in the Map to Omeka S data tab.
fr_fr: Ces paramètres s'appliquent à l'ensemble du CSV importé. Certains de ces paramètres peuvent être outrepassés par les options de colonne dans l'onglet Mapper vers les données Omeka S.

source: ![options as described below](../modules/modulesfiles/csvimport_itemsbasic.png)
fr_fr: ![options décrites ci-dessous](../modules/modulesfiles/csvimport_itemsbasic.fr.png)

source: **Class**: Select a class from the drop-down menu to apply to the imported items. You can use the search field at the top of the dropdown to narrow results or find a particular class.
fr_fr: **Classe** : Sélectionnez une classe dans le menu déroulant à appliquer aux contenus. Vous pouvez utiliser le champ de recherche en haut du menu déroulant pour filtrer les résultats ou trouver une classe spécifique.

source: **Owner**: Set the owner for the Items by selecting a user from the drop-down menu. You can use the search field at the top of the dropdown to narrow results or find a particular user.
fr_fr: **Propriétaire** : Définissez le propriétaire pour les Contenus en sélectionnant dans le menu déroulant. Vous pouvez utiliser le champ de recherche en haut du menu déroulant pour filtrer les résultats ou trouver un utilisateur spécifique.

source: **Visibility**: Set the visibility of the imported items as public or private.
fr_fr: **Visibilité** : Rendez les contenus importés publics ou privés.

source: **Item sets**: Add the imported items to a specific item set or sets using the dropdown menu.
fr_fr: **Collections** : Ajoutez les contenus importés à une ou plusieurs collections en utilisant le menu déroulant.

source: **Sites**: Add the imported items to the specified site or sites. Global and user-specific default sites will be preselected here.
fr_fr: **Sites** : Ajoutez les contenus importés à un ou plusieurs sites.

source: **Multivalue separator**: Enter the multivalue separator character here, if you have used one. - The columns of data in your CSV should be separated by commas, however within those columns you can add a special character to create multiple inputs, for example a semicolon. This is where you can specify multiple creators, multiple subjects, or other common uses.
fr_fr: **Séparateur pour les valeurs multiples** : Saisissez ici le caractère de séparation que vous avez utilisé (s'il y en a un). - Les colonnes de données de votre CSV devraient être séparées par des virgules, mais vous pouvez ajouter un caractère spécial au sein de ces colonnes (comme un point-virgule) pour créer des entrées multiples. C'est ainsi que vous pouvez indiquer plusieurs créateurs, plusieurs sujets, ou autres.

source: **Language**: Set the language of the values in the spreadsheet using the appropriate [IETF Language tag](https://en.wikipedia.org/wiki/IETF_language_tag).
fr_fr: **Langue** : Paramétrez la langue des valeurs du tableur en utilisant le [code langue IETF](https://en.wikipedia.org/wiki/IETF_language_tag) approprié.

source: Item import advanced settings
fr_fr: Paramètres avancés

source: There are two options on the "Advanced Settings" tab.
fr_fr: Il y a deux options dans l'onglet "Paramètres avancés".

source: ![Advanced settings page showing only the Action dropdown and the field for number of rows to process. ](../modules/modulesfiles/csvimport_ItemsAdvanced.png)
fr_fr: ![Page des paramètres avancés montrant seulement le menu déroulant des Action et le nombre de lignes à traiter.](../modules/modulesfiles/csvimport_ItemsAdvanced.fr.png)

source: The "Action" setting allows you to change the action of process from a straight import to one of the following options:
fr_fr: Le paramètre "Action" permet de changer le type de processus d'un import simple vers :

source: **Create a new resource**: Default option. Each row in the CSV will become a new resource.
fr_fr: **Créer une nouvelle ressource** : Option par défaut. Chaque ligne du CSV devient une nouvelle ressource.

source: **Replace all data of the resource**: Remove all properties of the resource, and fill with new information from the sheet. (Cannot be undone.)
fr_fr: **Remplacer toutes les métadonnées d'une ressource** : Retirez toutes les propriétés de la ressource et remplissez avec de nouvelles informations contenues dans le tableur. (Ne peut pas être annulé.)

source: **Delete the resource**: Delete all matching resources. (Cannot be undone.)
fr_fr: **Supprimer une ressource** : Supprimez toutes les ressources correspondantes. (Ne peut pas être annulé.)

source: If you select one of these options from the dropdown, three additional settings will appear on the tab. These settings help the process determine which resources to take action on.
fr_fr: Si vous sélectionnez une de ces options, trois autres paramètres s'affichent dans l'onglet. Ces paramètres informent sur les notices concernées par le processus.

source: **Action on unidentified resources**: This option determines what to do when no matching resource exists in the Omeka S installation, when your selected action applies to an existing resource ("Append", "Revise", "Update", or "Replace"). This option is not used when the main action is "Create" or "Delete". Your options are:
fr_fr: **Action sur les ressources non-identifiées**: Cette option détermine quoi faire lorsque aucune ressource correspondante n'existe dans l'instance Omeka S, mais que l'action d'import sélectionnée s'applique à une ressource existante ("Ajouter", "Corriger", "Mettre à jour", "Remplacer"). Cette option n'est pas utile lorsque votre processus d'import est "Créer" ou "Retirer". Les options sont :

source: In addition to the above, the Advanced Settings tab has an option to set the number of rows to process by batch. By default this is set to 20. However, if you are running into errors with an import you may want to set it to 5 or even 1 in order to troubleshoot and determine the source of the error.
fr_fr: En plus de cela, l'onglet des Paramètres avancés propose une option pour définir le nombre de lignes à traiter en lot. Par défaut cette option est définie à 20. Toutefois, si vous rencontrez des erreurs lors de votre import, vous pouvez l'établir à 5 ou même 1 pour déterminer la source des erreurs.

source: Complete import
fr_fr: Terminer l'import

source: Import item sets
fr_fr: Importer des collections

source: To import item sets, select "Item Set" under the "Import type" on the first page.
fr_fr: Pour importer des collections, sélectionnez "Collections" pour le "Type d'import" sur la première page.

source: ![Mappings for a spreadsheet with four columns, all of which have been automapped](../modules/modulesfiles/csvimport_ItemSet1.png)
fr_fr: ![Correspondances pour un tableur de quatre colonnes, toutes ont été automappées](../modules/modulesfiles/csvimport_ItemSet1.fr.png)

source: To map a column header to a vocabulary property, click on the plus symbol button to the left of the column header. This will open a drawer on the right-hand side of the screen.
fr_fr: Pour faire une correspondance entre une en-tête de colonne et une propriété d'un vocabulaire, cliquez sur le bouton en forme de plus à gauche de l'en-tête de colonne. Un volet s'ouvre sur la droite de l'écran.

source: **Properties**: Select a property to map the column data to, from any of the installed vocabularies. Use the Filter field to search the available properties for a specific property.
fr_fr: **Propriétés** : Sélectionnez une propriété d'un vocabulaire de l'instance pour établir une correspondance. Utilisez le champ Filtrer les propriétés pour sélectionner une propriété spécifique.

source: ![Properties option open showing all of the installed vocabularies for the Omeka S installation: Dublin Core, Bibliographic Ontology, Friend of a Friend, Scripto and OWL-Time Ontology.](../modules/modulesfiles/csvimport_itemsMapProp.png)
fr_fr: ![Options des propriétés montrant tous les vocabulaires de l'instance Omeka S.](../modules/modulesfiles/csvimport_itemsMapProp.fr.png)

source: **Item set-specific data** is a checkbox for "Open to additions". Check to allow other users to edit or add to the item set. Leave unchecked to have the item set be editable only by its creator, site admins, and global admins.
fr_fr: **Données spécifiques à la collection** est une case à cocher indiquant "Ouvert aux ajouts". Cochez pour autoriser d'autres utilisateurs à modifier ou à ajouter à la collection. Si la case n'est pas cochée, la collection ne sera modifiable que par son créateur, les administrateurs de sites et les administrateurs généraux.

source: ![Add mapping drawer showing the section "Item set-specific data". Below the section header is a single, unselected checkbox option labeled "Open to additions".](../modules/modulesfiles/csvimport_itemSetSD.png)
fr_fr: ![Ajouter le volet de correspondances montrant le champ "Données spécifiques à la collection". La case "Ouvert aux ajouts" n'est pas cochée.](../modules/modulesfiles/csvimport_itemSetSD.fr.png)

source: **Resource template (by label)**: Set the template for an item set by name. The name of the template as entered in the spreadsheet and the name of the template in Omeka S must match exactly.
fr_fr: **Modèle de ressource (par label)** : Paramétrer le modèle de ressource pour une collection par son nom. Le nom du modèle de ressource est saisi dans le tableur et doit correspondre exactement au nom du modèle dans l'Omeka S.

source: **Resource class (by term)**: Set the resource class for an item set. The term for the class in the spreadsheet and in the Omeka S installation must match exactly.
fr_fr: **Classe de ressource (par terme)** : établir la classe de ressource pour une collection. Le nom de la classe dans le tableur doit correspondre exactement à celui dans l'Omeka S.
