Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/csvimport.po
Languages: fr_fr

source: **Owner (by email address)**: Set an item set's owner by email address. This must be the email address associated with the user's account in the Omeka S installation.
fr_fr: **Propriétaire (par le courriel)** : Définir le propriétaire d'une collection par son adresse e-mail. Cette adresse doit être celle associée avec le compte utilisateur dans l'instance de l'Omeka S.

source: **Visibility public/private**: Set the visibility of the item set. Use "private" or "public" in the spreadsheet.
fr_fr: **Visibilité public/privé** : Définissez la visibilité de la collection. Utilisez "privé" ou "public" dans le tableur.

source: If you have data in a column in your CSV which you do not want to bring in to your Omeka S installation, simply do not map that column to a property or data type.
fr_fr: Si vous avez des données dans une colonne de votre CSV que vous ne voulez pas importer dans votre instance Omeka S, n'établissez pas de correspondance avec une propriété ou type de donnée.

source: To access options for data in a column of your CSV (represented by a row in the import table), click the wrench icon for that column heading.
fr_fr: Pour accéder aux options de données d'une colonne de votre CSV (transposée comme ligne dans le tableau d'import), cliquez sur l'icône de clé à molette pour l'en-tête concerné.

source: Column options are in addition to mappings. If you add options without also mapping column data to resource, media, or other data, nothing will be imported.
fr_fr: Les options de colonnes sont ajoutées aux correspondances. Si vous ajoutez des options sans établir de correspondance avec une ressource, un média ou une autre donnée, rien ne sera importé.

source: Import as URL reference. You can set the label for the URI by including the desired text after a space, for example: `http://example.com This Is The Label`
fr_fr: Importer comme référence URL. Vous pouvez indiquer l'étiquette pour une URI après une espace, par exemple : `http://example.com Ceci est l'étiquette`

source: If you have certain modules installed, such as Numeric Data Types, there may be additional data type options supplied by those modules.
fr_fr: Si vous avez installé certains modules comme [Numeric Data Types](../modules/numericdatatypes.md), il y aura peut-être d'autres options de types fournies par ces modules.

source: When you select one or more rows in the table (columns from your CSV file), you can use the "Batch edit options" button to apply the column options described above to multiple CSV columns at once.
fr_fr: Quand vous sélectionnez une ou plusieurs lignes du tableau (les colonnes de votre fichier CSV), vous pouvez utiliser le bouton "Options communes" pour appliquer les options de colonnes décrites ci-dessus à plusieurs colonnes à la fois.

source: ![a screenshot of the Mapping tab, with the boxes for Columns Title and Creator checked. A red arrow points to the Batch edit options button. On the right side of the screen, a drawer offers options for changing the settings as described](../modules/modulesfiles/csvimport_batchEditItemSet.png)
fr_fr: ![une capture de l'onglet de correspondances, avec les cases pour les colonnes Titre et Créateur cochées. Une flèche rouge pointe vers le bouton d'options de modification en lot. Sur la droite de l'écran, un volet propose des options pour changer les paramètres comme décrit plus haut](../modules/modulesfiles/csvimport_batchEditItemSet.fr.png)

source: Item Set import basic settings
fr_fr: Paramètres de base pour l'import de collections

source: These settings apply to the entire CSV which you are importing. Note that some of these settings can be overwritten by column options in the Map to Omeka S data tab.
fr_fr: Ces paramètres s'appliquent à l'ensemble du CSV que vous importez. Certains de ces paramètres peuvent être outrepassés par des options de colonne dans l'onglet Mapper vers les données Omeka S.

source: ![options as described below](../modules/modulesfiles/csvimport_ItemSetBasic.png)
fr_fr: ![options telles que décrites ci-dessous](../modules/modulesfiles/csvimport_ItemSetBasic.fr.png)

source: **Resource template**: Select a resource template from the drop-down menu to apply to the imported item sets. You can use the search field at the top of the dropdown to narrow results or find a particular template.
fr_fr: **Modèle de ressource** : Sélectionnez un modèle de ressource depuis le menu déroulant pour l'appliquer aux collections importées. Vous pouvez utiliser le champ de recherche pour filtrer les résultats ou trouver un modèle spécifique.

source: **Class**: Select a class from the drop-down menu to apply to the imported item sets. You can use the search field at the top of the dropdown to narrow results or find a particular class.
fr_fr: **Classe** : Sélectionnez une classe depuis le menu déroulant pour l'appliquer aux collections importées. Vous pouvez utiliser le champ de recherche pour filtrer les résultats ou trouver une classe spécifique.

source: **Owner**: Set the owner for the item sets by selecting a user from the drop-down menu. You can use the search field at the top of the dropdown to narrow results or find a particular user.
fr_fr: **Propriétaire** : Définissez le propriétaire pour les collections en sélectionnant un utilisateur dans le menu déroulant. Vous pouvez utiliser le champ de recherche pour filtrer les résultats ou trouver un utilisateur spécifique.

source: **Visibility**: Set the visibility of the imported item sets as public or private.
fr_fr: **Visibilité** : Définissez les collections importées comme privées ou publiques.

source: **Open/closed to additions**: Set whether users other than the owner (and site & global admins) will be able to add or edit the item sets.
fr_fr: **Ouvert ou fermé aux ajouts** : Déterminez si d'autres utilisateurs que le propriétaire (et les administrateurs généraux et de sites) peuvent ajouter ou modifier des collections.

source: **Multivalue separator**: Enter the multivalue separator character here, if you have used one. - The columns of data in your CSV should be separated by commas, however within those columns you can add a special character to create multiple inputs, for example a semicolon.
fr_fr: **Séparateur pour les valeurs multiples** : Saisissez le caractère de séparation pour les valeurs multiples, si vous en utilisez un. - Les colonnes de données de votre CSV sont séparées par des virgules, mais vous pouvez ajouter un caractère spécial pour créer des entrées multiples, par exemple un point-virgule.

source: Item Set import advanced settings
fr_fr: Paramètres avancés pour l'import des collections

source: ![Advanced settings page showing only the Action dropdown and the field for number of rows to process. ](../modules/modulesfiles/csvimport_ItemSetAdv.png)
fr_fr: ![Page des paramètres avancés montrant le menu déroulant Action et le champ pour les lignes à traiter](../modules/modulesfiles/csvimport_ItemSetAdv.fr.png)

source: This setting allows you to change the action of process from a straight import to one of the following options:
fr_fr: Ce paramètre permet de modifier l'action du processus d'import d'une des manières suivantes :

source: **Resource identifier property**: Select from a dropdown of all properties in your Omeka S installation. This should be the property in which you already have data, that you used to create the column data above.
fr_fr: **Propriété de l’identifiant de la ressource** : Sélectionnez depuis un menu déroulant des propriétés de votre instance Omeka S. Ces propriétés sont celles pour lesquelles vous avez déjà des données, et que vous avez utilisées pour créer les données de colonne ci-dessus.

source: Example: if the data in the Resource identifier column is "Title" with the first row of data having a title "A Study in Scarlet," and you set Resource identifier property to "Dublin Core: Title," then the actions will operate on a resource already in your Omeka S installation whose dc:title property is "A Study in Scarlet".
fr_fr: Exemple : Si la donnée dans la colonne d'identification de la ressource est "Titre", avec la première ligne ayant pour titre "A Study in Scarlet", et que vous paramétrez l'identifiant de ressource pour être "Dublin Core: Title" , alors le processus d'import cherchera une ressource de votre Omeka S ayant pour propriété 'dc:title' "A Study in Scarlet".

source: This will only work with exact matches.
fr_fr: Cette action ne fonctionne qu'avec les correspondances exactes.

source: If you have more than one resource with matching data, it will only take action on the oldest resource.
fr_fr: Si vous avez plus d'une ressource avec des données correspondantes, l'action n'affectera que la ressource la plus ancienne.

source: **Action on unidentified resources**: This option determines what to do when no matching resource exists in the Omeka S installation, but the selected action only applies to an existing resource ("Append", "Revise", "Update", or "Replace"). This option is not used when the main action is "Create" or "Delete" Your options are two radio buttons:
fr_fr: **Action sur les ressources non-identifiées** : Cette option détermine quoi faire lorsque aucune ressource correspondante n'existe dans l'instance Omeka S, mais que l'action d'import sélectionnée s'applique à une ressource existante ("Ajouter", "Corriger", "Mettre à jour", "Remplacer"). Cette option n'est pas utile lorsque votre processus d'import est "Créer" ou "Retirer". Les options sont :

source: Skip the row
fr_fr: Ignorer la ligne

source: Create a new resource
fr_fr: Créer une nouvelle ressource

source: Import media
fr_fr: Importer des médias

source: ![Mappings for a spreadsheet with ten columns. Some of the columns, such as those named Description and Title have automatically been mapped to Dublin Core properties.](../modules/modulesfiles/csvimport_mediaMap1.png)
fr_fr: ![Correspondances pour un tableur avec dix colonnes. Certaines des colonnes, comme celles nommées Description et Titre, ont été mappées automatiquement à des propriétés Dublin Core](../modules/modulesfiles/csvimport_mediaMap1.fr.png)

source: **Media-specific data** has a dropdown to set the item to which the media should be added. You can either use the item's internal ID, or match with any one of its unique properties (title, description). An item's ID is the number sequence at the end of the URL when on the view or edit page, so for `/admin/item/11576` the ID is 11576. You can also see the item's ID in the right-hand drawer on the item's view page.
fr_fr: **Données spécifiques au média** contient un menu déroulant permettant d'établir à quel contenu le média doit être attaché. Vous pouvez soit utiliser l'ID interne du contenu, ou l'associer par une de ses propriétés spécifiques (titre, description). L'ID d'un contenu correspond à la séquence chiffrée à la fin de l'URL de la page de vue ou de modification : pour `/admin/item/11576`, l'ID est 11576. Vous pouvez aussi voir l'ID du contenu dans le volet latéral de sa page de vue.

source: ![Media-specific data with dropdown](../modules/modulesfiles/csvimport_mediaMapData.png)
fr_fr: ![Données spécifiques au média avec menu déroulant](../modules/modulesfiles/csvimport_mediaMapData.fr.png)

source: **Resource template (by label)**: Set the template for the media by name. The name of the template as entered in the spreadsheet and the name of the template in Omeka S must match exactly.
fr_fr: **Modèle de ressource (par le label)** : Établissez le modèle de ressource pour le média par son nom. Le nom du modèle de ressource dans le tableur doit être le même que son nom dans l'Omeka S.

source: **Resource class (by term)**: Set the resource class for the media. The term for the class in the spreadsheet and in the Omeka S installation must match exactly.
fr_fr: **Classe de ressource (par terme)** : Établissez la classe du média. Le nom de la classe dans le tableur doit être le même que son nom dans l'instance Omeka S.

source: **Owner (by email address)**: Set the media's owner by email address. This must be the email address associated with the user's account in the Omeka S installation.
fr_fr: **Propriétaire (par adresse e-mail)** : Établissez le propriétaire du média par son adresse mail, la même que celle associée à son compte utilisateur dans l'instance Omeka S.

source: **Visibility public/private**: Set the visibility of the media. Use "private" or "public" in the spreadsheet.
fr_fr: **Visibilité publique/privée** : Définissez le statut privé ou public du média. Utilisez "privé" ou "public" dans le tableur.

source: **Media source**: For the column in your spreadsheet which points to the media you are creating, select which kind of media it is from the dropdown:
fr_fr: **Source du média** : Sélectionnez le type de média concerné (pour la colonne de votre tableur qui pointe vers le média créé) :

source: Import as URL reference. You can set the label for the URI by including the desired text after a space, for example: `http://example.com This Is The Label`.
fr_fr: Importer comme référence URL. Vous pouvez établir l'étiquette pour l'URI en incluant du texte après une espace, par exemple : `http://exemple.com Ceci est l'étiquette`.

source: ![drawer with options as described above](../modules/modulesfiles/csvimport_mediaColOpt.png)
fr_fr: ![volet avec les options décrites ci-dessus](../modules/modulesfiles/csvimport_mediaColOpt.fr.png)

source: ![a screenshot of the Mapping tab, with the boxes for Columns Title and Creator checked. A red arrow points to the Batch edit options button. On the right side of the screen, a drawer offers options for changing the settings as described](../modules/modulesfiles/csvimport_batchEditMedia.png)
fr_fr: ![une capture de l'onglet des correspondances, avec les cases cochées pour les colonnes Titre et Créateur. Une flèche rouge pointe vers le bouton pour les options de traitement en lot. Sur la droite de l'écran, un volet propose des options de modification des paramètres](../modules/modulesfiles/csvimport_batchEditMedia.fr.png)

source: Media import basic settings
fr_fr: Paramètres de base pour l'import de médias

source: **Resource template**: Select a resource template from the drop-down menu to apply to the imported media. You can use the search field at the top of the dropdown to narrow results or find a particular template.
fr_fr: **Modèle de ressource** : Sélectionnez un modèle de ressource depuis le menu déroulant pour l'appliquer au média importé. Vous pouvez utiliser le champ de recherche au-dessus du menu déroulant pour restreindre les résultats et trouver un modèle spécifique.

source: **Class**: Select a class from the drop-down menu to apply to the imported media. You can use the search field at the top of the dropdown to narrow results or find a particular class.
fr_fr: **Classe** : Choisissez une classe dans le menu déroulant pour l'appliquer au média importé. Vous pouvez utiliser le champ de recherche au-dessus du menu déroulant pour restreindre les résultats et trouver une classe spécifique.

source: **Owner**: Set the owner for the media by selecting a user from the drop-down menu. You can use the search field at the top of the dropdown to narrow results or find a particular user.
fr_fr: **Propriétaire** : Déterminez le propriétaire du média en sélectionnant un utilisateur depuis le menu déroulant. Vous pouvez utiliser le champ de recherche au-dessus du menu déroulant pour restreindre les résultats et trouver un utilisateur spécifique.

source: **Visibility**: Set the visibility of the imported media as public or private.
fr_fr: **Visibilité** : Déterminez la visibilité publique ou privée du média importé.

source: **Multivalue separator**: Enter the multivalue separator character here, if you have used one. - The columns of data in your CSV should be separated by commas; however, within those columns you can add a special character to create multiple inputs, for example a semicolon.
fr_fr: **Séparateur pour les valeurs multiples** : Saisissez le caractère de séparation pour les valeurs multiples, si vous en utilisez un. - Les colonnes de données de votre CSV sont séparées par des virgules, mais vous pouvez ajouter un caractère spécial pour créer des entrées multiples, par exemple un point-virgule.

source: Media import advanced settings
fr_fr: Paramètres avancés pour l'import de médias

source: There are two options on this tab which are only for advanced use.
fr_fr: Il y a deux options dans cet onglet.

source: The Action setting allows you to change the action of process from a straight import to one of the following options:
fr_fr: Le paramètres Action permet de modifier l'action du processus d'import d'une des manières suivantes :

source: **Append data to the resource**: Add new data to the resource.
fr_fr: **Ajouter des métadonnées à une ressource** : Ajouter de nouvelles données à une ressource.

source: **Revise data of the resource**: Replace existing data in the resource with data from the CSV, except if empty.
fr_fr: **Corriger les métadonnées d'une ressource** : Remplacer les données existantes de la ressource avec les données du CSV, sauf champ vide.

source: **Update data of the resource**: Replace existing data in the resource with data from the CSV, even when the cell is empty.
fr_fr: **Mettre à jour les métadonnées d'une ressource** : Remplacer des données existantes de la ressource par des données du CSV, même si le champ est vide.

source: **Replace all data of the resource**: Remove all properties of the resource, and fill with new information from the sheet.
fr_fr: **Remplacer toutes les métadonnées d'une ressource** : Retirer toutes les propriétés de la ressource et remplir avec des informations du tableur.

source: **Delete the resource**: Delete all matching resources.
fr_fr: **Supprimer une ressource** : Supprimer toutes les ressources correspondantes.

source: Example: if the data in the Resource identifier column is "Title" with the first row of data having a title "A Study in Scarlet," and you set Resource identifier property to "Dublin Core: Title," then the actions will operate on a resource already in your Omeka S installation whose `dc:title` property is "A Study in Scarlet".
fr_fr: Exemple : Si la donnée dans la colonne d'identification de la ressource est "Titre", avec la première ligne ayant pour titre "A Study in Scarlet", et que vous paramétrez l'identifiant de ressource pour être "Dublin Core: Title" , alors le processus d'import cherchera une ressource de votre Omeka S ayant pour propriété 'dc:title' "A Study in Scarlet".

source: Create a new resource.
fr_fr: Créer une nouvelle ressource.

source: In addition to the above, the Advanced Settings tab has an option to set the number of rows to process by batch. By default, this is set to 20. However, if you are running into errors with an import you may want to set it to 5 or even 1 in order to troubleshoot and determine the source of the error.
fr_fr: En plus de cela, l'onglet des Paramètres avancés permet d'établir le nombre de lignes à traiter en lot. Par défaut, le nombre est établi à 20. Toutefois, si vous rencontrez des erreurs lors de l'import, vous pouvez établir le nombre de lignes à 5 ou même 1 pour déterminer la source de l'erreur.

source: Once you have completed mappings, column options, and any settings, click the Import button in the upper right corner of the browser window. This should start the import and redirect you to the Past Imports tab. You should see a confirmation message saying "Importing in Job ID [number]".
fr_fr: Une fois les correspondances faites, ainsi que les options de colonnes et tout autre paramétrage, cliquez sur le bouton "Importer" dans le coin supérieur droit de la fenêtre. Cette action devrait démarrer l'import et vous rediriger vers l'onglet des imports précédents. Vous devriez voir un message de confirmation indiquant "Import en cours (Job #[numéro])".

source: Mixed resource import
fr_fr: Import de ressources diverses

source: This resource option allows you to import a sheet with a mix of resource types: items, item sets, and media.
fr_fr: Cette option de ressource permet d'importer un tableur avec un mélange de types de ressource : contenus, collections et média.

source: This tab displays an initial dropdown above a table with the columns from your spreadsheet as rows. Each row displays:
fr_fr: Cet onglet affiche un menu déroulant au-dessus du tableau contenant les colonnes (disposées en lignés) de votre tableur. Chaque ligne contient :

source: ![Mappings for a spreadsheet with nine columns.](../modules/modulesfiles/csvimport_mixedR1.png)
fr_fr: ![Correspondances d'un tableur avec neuf colonnes](../modules/modulesfiles/csvimport_mixedR1.fr.png)

source: The dropdown above the table is where you set which column in the CSV file indicates whether the data in that row is an item, item set, or media. You do not need to map this data in the table on this tab. Values in this column can be `item` or `items`, `item set` or `itemset` or `itemsets` or `item sets`, or `media`. Other values, or empty fields, will lead to the row not being imported.
fr_fr: Le menu déroulant au-dessus du tableau permet d'établir quelle colonne du fichier CSV indique si les données de la ligne constituent un contenu, une collection ou un média. Il n'y a pas besoin d'établir de correspondance pour ces données dans le tableau. Les valeurs dans cette colonne peuvent être `item` ou `items`, `item set`, `itemset`, `itemsets` ou `item sets`, `media`. Toute autre valeur (y compris un champ vide) fera que la ligne ne sera pas importée.

source: Rows with `media` in the resource type column need to indicate which item they are to be attached to, as in the [Media section above](#import-media), and require a media source to be included.
fr_fr: Les lignes affichant 'média' comme type de ressource doivent aussi indiquer à quel contenu le média est rattaché, comme dans la [section Média ci-dessus](#import-media). Une source pour le média est aussi requise.

source: **Properties** select a property to map the column data to, from any of the installed vocabularies. Use the Filter field to search the available properties for a specific property. ![Properties option open showing all of the installed vocabularies for the Omeka S installation: Dublin Core, Bibliographic Ontology, Friend of a Friend, Scripto and OWL-Time Ontology.](../modules/modulesfiles/csvimport_itemsMapProp.png)
fr_fr: **Propriétés** permet de sélectionner une propriété d'un vocabulaire de l'instance pour établir une correspondance. Utilisez le champ de recherche pour trouver une propriété spécifique. ![Option Propriétés ouverte affichant tous les vocabulaires de l'instance](../modules/modulesfiles/csvimport_itemsMapProp.png)

source: **Item-specific data** has a dropdown to set Item Set by selected property. If you have a column with data for an Item Set to which you want to add the item, you can set how it maps using this dropdown. You can either use the Item Set's internal ID, or any one of its properties (title, description).
fr_fr: **Données spécifiques au contenu** contient un menu déroulant pour attribuer une Collection via une propriété spécifique. Si vous avez une colonne avec des données pour une Collection à ajouter au Contenu, vous pouvez choisir comment faire la correspondance dans ce menu déroulant. Vous pouvez utiliser soit les identifiants internes de la collection, soit une de ses autres propriétés (titre, description).
