Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/csvimport.po
Languages: fr_fr

source: **Item set-specific data** is a checkbox for "Open to additions." Check to allow other users to edit or add to the item set. Leave unchecked to have the item set be editable only by its creator, site admins, and global admins.
fr_fr: **Données spécifiques à la collection** est une case à cocher "Ouvert aux ajouts". Cochez la case pour autoriser les autres utilisateurs à ajouter ou modifier des collections. Si vous souhaitez que les collections ne soient modifiables que par leur créateur, les administrateurs de sites et les administrateurs généraux, ne cochez pas la case.

source: **Media-specific data** has a dropdown to set the item to which the media should be added. You can either use the item's internal ID, or any one of its properties (title, description). An item's ID is the number sequence at the end of the URL when on the view or edit page, so for `/admin/item/11576` the ID is 11576. You can also see the item's ID in the right-hand drawer on the item's view page.
fr_fr: **Données spécifiques au média** présente un menu déroulant permettant d'établir à quel contenu le média doit être rattaché. Vous pouvez utiliser l'ID interne du contenu ou une autre de ses propriétés (titre, description). L'ID d'un contenu correspond à la séquence chiffrée à la fin de l'URL de la page de vue ou de modification d'un contenu : pour `/admin/item/11576`, l'ID est 11576. Vous trouverez aussi l'ID dans le volet de droite de la page de vue d'un contenu.

source: **Generic data** has a dropdown where you can set one of four options:
fr_fr: **Métadonnée commune** contient un menu déroulant proposant quatre options :

source: **Media source** For the columns in your spreadsheet that point to the media, select for each column from the dropdown:
fr_fr: **Source du média** : Sélectionnez dans le menu déroulant une option pour chacune de vos colonnes pointant vers un média :

source: **Use multivalue separator**: Check this box to use the multivalue separator for data in this column. You set the multivalue separator character in the initial import page, but you can change it in the Basic Settings tab.
fr_fr: **Utiliser un séparateur multivalué** : Cochez cette case pour utiliser un séparateur multivalué dans cette colonne. Le séparateur est déterminé dans la page d'import initial, mais peut être modifié dans l'onglet des Paramètres de base.

source: Import as URL reference. You can set the label for the URI by including the desired text after a space, for example: `http://example.com This Is The Label`.
fr_fr: Importer comme référence URL. Vous pouvez établir l'étiquette pour l'URI en incluant le texte voulu après une espace, par exemple : `http://example.com Ceci est l'étiquette`.

source: ![drawer with options as described above](../modules/modulesfiles/csvimport_mixedR2.png)
fr_fr: ![volet avec les options décrites ci-dessus](../modules/modulesfiles/csvimport_mixedR2.fr.png)

source: ![a screenshot of the Mapping tab, with the boxes for Columns Title and Creator checked. A red arrow points to the Batch edit options button. On the right side of the screen, a drawer offers options for changing the settings as described](../modules/modulesfiles/csvimport_batchEditMixed.png)
fr_fr: ![une capture de l'onglet des correspondances, avec les cases pour les colonnes Titre et Créateur cochées. Une flèche rouge pointe vers le bouton des options de traitement en lot. À la droite de l'écran, un volet offre les options pour modifier les paramètres](../modules/modulesfiles/csvimport_batchEditMixed.fr.png)

source: Mixed resources import basic settings
fr_fr: Paramètres de base pour l'import des ressources diverses

source: ![options as described below](../modules/modulesfiles/csvimport_mixedRBasic.png)
fr_fr: ![Options telles que décrites ci-dessous](../modules/modulesfiles/csvimport_mixedRBasic.fr.png)

source: **Visibility**: Set the visibility of the imported item sets as public or private.
fr_fr: **Visibilité** : Établissez la visibilité publique ou privée des collections.

source: **Item sets open/closed to additions**: Set whether users other than the owner (and site & global admins) will be able to add or edit the item sets.
fr_fr: **Collections ouvertes ou fermées à l'ajout** : Déterminez si les utilisateurs autres que le créateur (et les administrateurs de sites et généraux) peuvent ajouter ou modifier des collections.

source: **Item set for items**: Select from a dropdown of existing item sets.
fr_fr: **Collections pour les contenus** : Sélectionnez parmi les collections existantes.

source: Mixed resources import advanced settings
fr_fr: Paramètres avancés pour l'import des ressources diverses

source: **Resource identifier column**: Select from a dropdown of the columns in your CSV. This is the data from your spreadsheet which maps to existing data in your Omeka S installation.
fr_fr: **Colonne de l’identifiant de la ressource** : Sélectionnez depuis un menu déroulant des colonnes de votre CSV. Ces données sont celles de votre tableur qui entrent en correspondance avec celles de votre instance Omeka S.

source: Import users
fr_fr: Importer des utilisateurs

source: When importing users, you can only bring in data related to the user table in Omeka S: the user's email, display name, and role. Any additional data in your CSV will not be imported. None of these can be multivalue properties.
fr_fr: Quand vous importez des utilisateurs, vous pouvez uniquement transposer des données reliées au tableau des utilisateurs dans Omeka S : l'e-mail de l'utilisateur, son nom et son rôle. Toute autre donnée présente dans votre CSV ne sera pas importée. Aucune de ces propriétés ne peut être multivaluée.

source: A column header from the spreadsheet
fr_fr: Un en-tête de colonne du tableur

source: A trash can to delete mappings
fr_fr: Une poubelle pour supprimer des correspondances

source: A column to show options selected.
fr_fr: Une colonne montrant les options sélectionnées.

source: ![Table as described above, with rows for User, email, and role.](../modules/modulesfiles/csvimport_users.png)
fr_fr: ![Tableau tel que décrit ci-dessus avec des lignes pour Utilisateur, e-mail et rôle.](../modules/modulesfiles/csvimport_users.fr.png)

source: To map a column header to user information, click on the plus symbol button to the left of the column header. This will open a drawer on the right-hand side of the screen.
fr_fr: Pour établir une correspondance avec un en-tête de colonne, cliquez sur le bouton plus à gauche de l'en-tête. Un volet s'ouvre sur la droite de l'écran.

source: ![A red arrow points to the plus sign button to the left of the word "title"](../modules/modulesfiles/csvimport_usersMapButton.png)
fr_fr: ![Une flèche rouge pointe vers le bouton plus à gauche du mot "Nom"](../modules/modulesfiles/csvimport_usersMapButton.fr.png)

source: The drawer has a dropdown for Users info, with three options:
fr_fr: Le volet contient un menu déroulant avec trois options :

source: **Email**: The email address for the user
fr_fr: **E-mail** : l'adresse e-mail de l'utilisateur

source: **Display name**: The user's display name
fr_fr: **Nom à afficher** : le nom à afficher pour l'utilisateur

source: **Role**: The user's [role](../admin/users.md#roles-and-permissions).
fr_fr: **Rôle** : le [rôle](../admin/users.md#roles-and-permissions) de l'utilisateur.

source: Role values to use in this import are as follows:
fr_fr: Les valeurs de rôle à utiliser pour ce type d'import sont :

source: ![The same table as above, now with the mapping drawer open and the dropdown activated to show the three options.](../modules/modulesfiles/csvimport_usersMap.png)
fr_fr: ![Le même tableau, mais avec le volet de correspondance ouvert et le menu déroulant montrant les trois options](../modules/modulesfiles/csvimport_usersMap.fr.png)

source: Once you have completed the mappings, click the "Import" button.
fr_fr: Une fois que vous avez terminé les correspondances, cliquez sur le bouton "Importer".

source: Manage past imports
fr_fr: Gérer les imports précédents

source: To review past imports, click on the CSV Import module and select the "Past Imports" tab.
fr_fr: Pour passer les imports déjà effectués en revue, cliquez sur le module Import CSV et sélectionnez l'onglet "Imports précédents".

source: ![CSV Import subtab options on left hand nav](../modules/modulesfiles/csvimport_pastimportsnav.png)
fr_fr: ![Options de sous-onglet d'Import CSV dans la navigation de gauche](../modules/modulesfiles/csvimport_pastimportsnav.fr.png)

source: This will display a table with the following columns:
fr_fr: Cette action renvoie à un tableau contenant les colonnes suivantes :

source: An **Undo** Checkbox
fr_fr: Une case à cocher **Défaire**

source: **Date** of import
fr_fr: La **Date** de l'import

source: **Action** of the import (create, append, revise, update, replace, or delete).
fr_fr: L'**Action** de l'import (créer, ajouter, modifier, mettre à jour, remplacer ou supprimer).

source: Beneath the action description there are links to the job details and job log.
fr_fr: En-dessous de la description de l'action se trouve un lien vers les détails et le journal de la tâche.

source: **Comment** entered on import or indicating an error
fr_fr: Un **Commentaire** saisi à l'import ou indiquant une erreur

source: **Result** the items updated, added, or deleted
fr_fr: Le **Résultat** : le nombre de contenus mis à jour, ajoutés ou supprimés

source: **Status** of import
fr_fr: Le **Statut** de l'import

source: Import **Owner**.
fr_fr: Le **Propriétaire** de l'import.

source: ![CSV Import past imports table](../modules/modulesfiles/csvimport_pastimports.png)
fr_fr: ![tableau des imports précédents](../modules/modulesfiles/csvimport_pastimports.fr.png)

source: To see the details of an import, click the "Job details" link below the action description. To review logs, particularly in cases where an error occurred, click the "Log" link below the action description.
fr_fr: Pour voir les détails d'un import, cliquez sur le lien "Détails de la tâche" sous la description de l'action. Pour voir le journal de la tâche, particulièrement en cas d'erreur, cliquer sur le lien "Journal" sous la description de l'action.

source: Undo an import
fr_fr: Défaire un import

source: To undo an import, click on the CSV Import module and select the "Past Imports" page.
fr_fr: Pour défaire un import, cliquez sur le module Import CSV et sélectionnez la page "Imports précédents".

source: Check the "Undo" box in the row of the import which you want to undo, and click "Submit".
fr_fr: Cochez la case "Défaire" sur la ligne de l'import concerné et cliquez sur "Soumettre".

source: ![a red arrow points to a checked Undo box on the Past Imports page](../modules/modulesfiles/csvimport_undo.png)
fr_fr: ![Une flèche rouge pointe vers une case Défaire cochée sur la page des Imports précédents](../modules/modulesfiles/csvimport_undo.fr.png)

source: Depending on the size of the import, it may take some time to undo. On complete, the status of the import on the "Past Imports" table will say "Undone" followed by the date the import was reversed.
fr_fr: Cette opération peut prendre du temps, selon la taille de l'import. Une fois l'opération terminée, le statut de l'import dans le tableau des "Imports précédents" affichera "Défait", suivi de la date de suppression de l'import.

source: Troubleshooting
fr_fr: Dépannage

source: The following are known errors that can occur during an import:
fr_fr: Les erreurs suivantes sont les plus fréquentes lors d'un import :

source: **Encoding**: CSVs for import must be UTF-8 encoded.
fr_fr: **Encodage** : l'encodage des CSV à importer doit être en UTF-8.

source: Are your jobs starting and not completing? You might need to [set the path for PHP](../configuration.md#php-path) so that your system can perform the background process to make the items.
fr_fr: Si vos tâches commencent mais ne finissent pas, il faudra peut-être [établir le chemin PHP](../configuration.md#php-path) pour que votre système puisse réaliser le processus d'arrière-plan pour créer les contenus.

source: Integration with other modules
fr_fr: Intégration avec d'autres modules

source: Some other modules add functionality to the CSV import process. If you have these modules installed and active, you will have access to the following options when using CSV Import.
fr_fr: Certains modules ajoutent des fonctionnalités à l'import CSV. Si ces modules sont installés et activés, vous aurez accès aux options suivantes lorsque vous utilisez Import CSV.

source: If you have [File Sideload](filesideload) (minimum version 1.2.0) installed and active, you can use it as a source for media when running a CSV import.
fr_fr: Si [File Sideload](filesideload) (version minimum 1.2.0) est installé et activé, vous pouvez l'utiliser comme source pour les médias de l'import CSV.

source: Everything on the **Map to Omeka S data** tab will be the same. When you add a mapping and choose the "Media source" option, you will see that there is now an option for "Sideload".
fr_fr: L'onglet **Mapper vers des données Omeka S** est inchangé. Quand vous ajoutez une correspondance et choisissez l'option "Source du média", vous verrez qu'il y a maintenant une option "Sideload".

source: For the data in this column, you need to include the full file name, including extension. So, for example, if you want to import a JPG file named "Jekyll_and_Hyde_Title", then the data in the media column of the CSV you are importing should be `Jekyll_and_Hyde_Title.jpg`.
fr_fr: Pour les données saisies dans cette colonne, vous devez inclure le nom complet du fichier, dont l'extension. Par exemple, si vous voulez importer un fichier JPG nommé "Jekyll_and_Hyde_Title", alors les données dans la colonne média du CSV que vous importez devront être "Jekyll_and_Hyde_Title.jpg".

source: If you have [Numeric Data Types](numericdatatypes) installed and active, it will add the option to set a column data type as numeric data.
fr_fr: Si le module [Numeric Data Types](numericdatatypes) est installé et activé, cela ajoute une option pour établir un type de données de colonne comme données numériques.

source: Options are:
fr_fr: Les options sont :

source: Date/Time (ISO 8601)
fr_fr: Date/Heure (ISO 8601)

source: Interval (ISO 8601)
fr_fr: Intervalle (ISO 8601)

source: Duration (ISO 8601)
fr_fr: Durée (ISO 8601)

source: Integer.
fr_fr: Intégrale.

source: When importing data as numeric, it must be formatted precisely. Always check to be sure your data has imported correctly into the format of your choice; CSV Import will leave values empty if the formatting isn't recognized.
fr_fr: Si vous importez des données numériques, elles doivent être formatées précisément. Assurez-vous que les données ont été importées correctement dans le format de votre choix ; Import CSV laissera les champs vides si le formatage n'est pas reconnu.

source: `2022-08` (year and month, no date)
fr_fr: `2022-08` (année et mois, pas de date précise)

source: `2022-08-18T17:26:49+00:00` ([time offset from UTC](https://en.wikipedia.org/wiki/ISO_8601#Time_offsets_from_UTC))
fr_fr: `2022-08-18T17:26:49+00:00` ([format d'horaires UTC](https://en.wikipedia.org/wiki/ISO_8601#Time_offsets_from_UTC))

source: `2022-08-18T17:26:49Z` ([coordinated universal time](https://en.wikipedia.org/wiki/ISO_8601#Coordinated_Universal_Time_(UTC))).
fr_fr: `2022-08-18T17:26:49Z` ([horaire universel](https://en.wikipedia.org/wiki/ISO_8601#Coordinated_Universal_Time_(UTC))).

source: You cannot omit the year while providing a month and/or day. You cannot supply ordinal dates (as in, `2000-175` for the 175th day of the year 2000).
fr_fr: L'année est obligatoire lorsque vous indiquez un mois et/ou un jour. Vous ne pouvez pas fournir de dates ordinales (comme dans '2000-175', pour le 175e jour de l'année 2000).

source: `2007-03-01T13:00:00Z/2008-05-11T15:30:00Z` (Start and end)
fr_fr: `2007-03-01T13:00:00Z/2008-05-11T15:30:00Z` (Début et fin)

source: `2007-03-01T13:00:00Z/P1Y2M10DT2H30M` (Start time/date and duration)
fr_fr: `2007-03-01T13:00:00Z/P1Y2M10DT2H30M` (Point de départ/date et durée)

source: `P1Y2M10DT2H30M/2008-05-11T15:30:00Z` (Duration and end time/date).
fr_fr: `P1Y2M10DT2H30M/2008-05-11T15:30:00Z` (Durée et moment de fin/date).

source: `P23DT23H` (23 days & 23 hours)
fr_fr: `P23DT23H` (23 jours et 23 heures)

source: `P3Y6M4DT12H30M5S` (3 years, 6 months, 4 days, 12 hours, 30 minutes, & 5 seconds).
fr_fr: `P3Y6M4DT12H30M5S` (3 ans, 6 mois, 4 jours, 12 heures, 30 minutes et 5 secondes).

source: If you have [Custom Vocab](customvocab) installed and active, it will add your custom vocabularies as data types in Omeka. You can select these data types during your CSV Import.
fr_fr: Si [Custom Vocab](customvocab) est installé et activé, vos vocabulaires personnalisés seront ajoutés comme types de données dans Omeka. Vous pouvez sélectionner ces types de données pendant votre Import CSV.
