Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/customvocab.po
Languages: fr

source: Custom Vocab
fr: Custom Vocab (Vocabulaires personnalisés)

source: The [Custom Vocab module](https://omeka.org/s/modules/CustomVocab) allows you to create a controlled vocabulary and add it to a specific property in a resource template. When using that template for an item, the property will load with a dropdown limited to the options of the controlled vocabulary, rather than a text entry box.
fr: Le module Custom Vocab vous permet de créer un vocabulaire personnalisé et de l’ajouter à une propriété spécifique dans un modèle de ressource. Lorsque vous utilisez ce modèle pour un contenu, la propriété se charge avec une liste déroulante limitée aux options du vocabulaire contrôlé, plutôt qu’avec une zone de texte.

source: For example, you may want to create an institution-specific list of locations that correspond to different collections on your campus, or a controlled list of people or places related to your holdings. This can help reduce typos and name variations, and can allow you to offer [metadata browsing](../modules/metadatabrowse.md) for more fields.
fr: Par exemple, vous pouvez vouloir créer un liste de localisations spécifiques à votre institution, qui correspondrait à différentes collections présentes sur votre campus, ou encore une liste de personnes ou de lieux relatifs à vos ressources. Cette pratique permet d'éviter les fautes de frappe et les variations de nommage, et vous permet de proposer la [recherche par métadonnées](../modules/metadatabrowse.md) pour plus de champs.

source: Custom Vocab is available to users who are at the [Editor role and above](../admin/users.md).
fr: Custom Vocab est accessible par les utilisateurs ayant un rôle [Éditeur ou plus](../admin/users.md).

source: Create a custom vocab
fr: Créer un vocabulaire personnalisé

source: Once you have installed and activated the module, go to the Custom Vocab section in the left-hand navigation, under Modules.
fr: Dès que vous avez installé et activé le module, cliquez sur Vocabulaire Personnalisé dans le volet de navigation de gauche, dans la partie Modules.

source: The Add Custom Vocab page has four fields: Label, Language, Vocab Type, and Terms/Items/URI input.
fr: La page Ajouter un vocabulaire personnalisé comporte quatre champs : Libellé, Langue, Vocab Types et Vocables.

source: ![Add Custom Vocab with data entered in the label and terms fields](../modules/modulesfiles/customVocab-add-URI.png)
fr: ![Ajout d’un vocabulaire personnalisé avec les champs libellé et vocables saisis](../modules/modulesfiles/customVocab-add-URI.fr.png)

source: **Label**: A name for the vocabulary, which you will use to find it when adding to a resource template.
fr: **Libellé** le nom du vocabulaire, utilisé pour sélectionner ce vocabulaire pour l’ajouter un à un modèle de ressources.

source: **Language** (optional): The language of the vocab, using the [ISO 639-1 language code](http://www.iso.org/iso/language_codes).
fr: **Langue** (optionnel) : La langue du vocabulaire à choisir dans la liste des [code ISO 639-1](http://www.iso.org/iso/language_codes).

source: You can set the controlled vocabulary terms to a list of entered terms, to a list of existing items, or to a list of external URIs with or without labels:
fr: Vous pouvez définir un vocabulaire personnalisé soit sur une collection de contenus existants, soit sur une liste de vocables :

source: **Terms**: a list of plain-text terms, one word or phrase per line. This populates the property as text.
fr: **Vocables** pour le vocabulaire personnalisé, un mot ou une phrase par ligne. Cela complète la propriété par du texte.

source: **Items**: a drop-down of Item Sets in your Omeka S installation. Choosing one of these will create a custom vocab populated by items from that item set. When used, the property is populated as an Omeka Resource, not text.
fr: **Contenus:** une liste déroulante des collections de votre instance Omeka S. En choisissant l’un d’entre eux, un vocabulaire personnalisé sera créé à partir des contenus de la collection sélectionnée. Lorsqu’elle est utilisée, la propriété est considérée comme une ressource Omeka, et non comme du texte.

source: **URIs**: a list of URIs with or without labels, one URI per line. To include a label, add a space and the label after the URI (for example, "https://youromekainstall.org/item/1119 Canada"). When used, the property will populate as a link to the external resource.
fr: **URI** : une liste d'URI avec ou sans étiquette, une URI par ligne. Pour inclure une étiquette, ajouter une espace après l'URI (par exemple, "https://votreinstanceomeka.org:item/1119 Canada"). Cette propriété sera utilisée comme lien vers une ressource extérieure.

source: Hit "Submit" to save changes.
fr: Enregistrer les modifications.

source: Manage custom vocabs
fr: Gérer les vocabulaires personnalisés

source: ![Custom Vocab tab with two existing vocabularies](../modules/modulesfiles/customVocab_manage.png)
fr: ![Page Custom Vocab avec deux vocabulaires existants](../modules/modulesfiles/customVocab_manage.fr.png)

source: When editing a custom vocabulary, you can change the label, language, or terms.
fr: Lors de l’édition d’un vocabulaire personnalisé, vous pouvez modifier le libellé, la langue et les vocables.

source: Using a custom vocab
fr: Utilisation d’un vocabulaire personnalisé

source: Custom Vocabularies are applied through [resource templates](../content/resource-template.md).
fr: Les vocabulaires personnalisés sont appliqués par l’intermédiaire des [modèles de ressources](../content/resource-template.md).

source: Go to the Resource Templates and either add new or edit an existing template. Once you are editing the template:
fr: Allez dans les modèles de ressources et ajoutez un nouveau modèle ou modifiez un modèle existant. Une fois que vous éditez le modèle :

source: Add the property to which you want to apply the Custom Vocab.
fr: Ajoutez la propriété à laquelle vous voulez appliquer le Vocabulaire personnalisé.

source: Edit the property.
fr: Modifiez la propriété.

source: In the drawer which opens on the right, go to the Other options section and find the Data type dropdown.
fr: Dans le panneau qui s’ouvre à droite, allez dans la section Autres options et trouvez la liste déroulante Type de données.

source: Scroll through the dropdown and select the Custom Vocabulary you want to use.
fr: Faites défiler la liste déroulante et sélectionnez le Vocabulaire personnalisé que vous souhaitez utiliser.

source: Click set changes at the bottom of the drawer.
fr: Cliquez sur Appliquer au bas du panneau pour valider vos modifications.

source: Be sure to save your changes.
fr: Veillez à enregistrer vos modifications.

source: ![Resource Template data being edited with dropdown open to show available vocabularies](../modules/modulesfiles/customVocab_select.png)
fr: ![Modèle de ressource en cours d’édition avec la liste déroulante ouverte pour afficher les vocabulaires disponibles](../modules/modulesfiles/customVocab_select.fr.png)

source: When you click the title of a Resource Template to see its details, the Custom Vocab will show up in the Data Type table heading.
fr: Lorsque vous cliquez sur le titre d’un modèle de ressource pour en afficher les détails, le Vocabulaire personnalisé apparaît dans la colonne Type de données.

source: ![Resource Template "National Park" with the custom vocabulary State applied to Spatial Coverage](../modules/modulesfiles/customVocab_resource.png)
fr: ![Modèle de ressource « National Park » avec le vocabulaire personnalisé State appliqué à la Spatial Coverage](../modules/modulesfiles/customVocab_resource.fr.png)

source: When this Resource Template is used in an Item or Item Set, the designated properties will always load as a drop down menu with the values from the custom vocabulary.
fr: Lorsque ce modèle de ressource est utilisé pour un contenu ou une collection de contenus, les propriétés concernées seront toujours proposées sous forme de menu déroulant des vocables du vocabulaire personnalisé.

source: In this image, the Resource Template modified earlier is loaded for a new item. See that Spatial Coverage has a "select below" message and arrows indicating the property input is a drop down menu.
fr: Dans cette copie d’écran, le modèle de ressource modifié précédemment est chargé pour un nouveau contenu. Vous voyez que la propriété « Titre » comporte un message « choisir un terme ci-dessous » et une flèche indiquant que la propriété saisie est un menu déroulant.

source: ![as described](../modules/modulesfiles/customVocab_item1.png)
fr: ![comme indiqué](../modules/modulesfiles/customVocab_item1.fr.png)

source: This image shows the dropdown open, displaying the values from the "US states & territories" vocabulary.
fr: Cette image montre la liste déroulante, affichant les valeurs du vocabulaire « Vocabulaire institutionnel ».

source: ![as described](../modules/modulesfiles/customVocab_item2.png)
fr: ![comme indiqué](../modules/modulesfiles/customVocab_item2.fr.png)
