Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/filesideload.po
Languages: fr_fr

source: The [File Sideload module](https://omeka.org/s/modules/FileSideload) adds the ability to add media files that are already stored on the server where your Omeka S installation lives.
fr_fr: Le [module File Sideload](https://omeka.org/s/modules/FileSideload) ajoute la possibilité de charger des fichiers médias stockés sur le même serveur que votre Omeka S.

source: File Sideload is compatible with [CSV Import](../modules/csvimport.md). When installed, your CSV Import options will include the ability to add media via Sideload.
fr_fr: File Sideload est compatible avec [Import CSV](../modules/csvimport.md). Une fois installé, Import CSV inclut la possibilité d'ajouter des médias via Sideload.

source: Create a directory
fr_fr: Créer un répertoire

source: Create a directory (folder) on your server. It can be within the File Sideload module directory or on the same level as the Omeka S installation.
fr_fr: Créez un répertoire (dossier) sur votre serveur. Il peut être au sein du répertoire du module File Sideload ou au même niveau que l'instance Omeka S.

source: Upload files into this directory. All files or directories must be in this directory to be accessible.
fr_fr: Chargez des fichiers dans ce répertoire. Tous les fichiers et dossiers doivent être dans ce répertoire pour demeurer accessibles.

source: Note that when browsing these files from the module to add as media, you will only see the filenames, so you should name the files as clearly as possible (for example, "StudyInScarlet_coverpage.jpg" will be more helpful than "img001.jpg").
fr_fr: En parcourant ces fichiers pour les ajouter comme médias, vous ne verrez que leurs noms, veillez ainsi à les nommer de la façon la plus claire possible (par exemple, "StudyInScarlet_couverture.jpg" est plus pertinent que "img001.jpg").

source: After installing the module, you will need to configure the module to tell it where the directory is located.
fr_fr: Après avoir installé le module, il faudra le configurer pour indiquer où se trouve le répertoire.

source: From the Modules page of the left-hand navigation, scroll to File Sideload in the list and click the "Configure" button.
fr_fr: Depuis la page des modules de la navigation de gauche, descendez jusqu'à File Sideload dans la liste et cliquez sur le bouton "Configurer".

source: The File Sideload module has two configuration options.
fr_fr: Le module File Sideload a deux options de configuration.

source: ![An example configuration screen is filled out](../modules/modulesfiles/filesideload_config2.png)
fr_fr: ![Exemple d'écran de configuration](../modules/modulesfiles/filesideload_config2.fr.png)

source: **Sideload Directory**: the path, **relative to the server root**, of the directory in which the files are stored. This should look something like:
fr_fr: **Répertoire de chargement** : le chemin, **relatif à la racine du serveur**, du répertoire dans lequel les fichiers sont stockés. Il devrait ressembler à :

source: `/var/www/html/yourinstallationpath/omeka-s/modules/FileSideload/sideload`
fr_fr: `/var/www/html/lechemindevotreinstance/omeka-s/modules/FileSideload/sideload`

source: `/home/yourusername/yourwebsite.org/omeka-s/sideload` for shared hosting
fr_fr: `/home/votrenomdutilisateur/votresite.org/omeka-s/sideload` pour l'hébergement partagé

source: `/home/yourusername/public_html/omeka-s/modules/FileSideload/sideload` for cPanel users.
fr_fr: `/home/votrenomdutilisateur/public_html/omeka-s/modules/FileSideload/sideload` pour les utilisateurs de cPanel.

source: If you have shell access to the directory via terminal, you can copy and paste the results of the command `pwd`.
fr_fr: Si vous avez accès shell au répertoire par un terminal, vous pouvez copier et coller le résultat de la commande 'pwd'.

source: If you are using an FTP application, copy out the remote site path in the location bar of the application.
fr_fr: Si vous utilisez une application FTP, copiez le chemin du site dans la barre de localisation de l'application.

source: **Delete sideloaded file?**
fr_fr: **Supprimer les fichiers chargés ?**

source: If checked, any file added to an item as media will be deleted from the sideload directory, as the file is now saved as media in the Omeka S installation.
fr_fr: Si la case est cochée, tout fichier ajouté comme média à un contenu sera supprimé du répertoire sideload, le fichier étant suite à cela enregistré comme média sur l'instance Omeka S.

source: If unchecked, the files will remain in the directory, and will be available to be added as media to any item, until you manually remove them.
fr_fr: Si la case n'est pas cochée, les fichiers demeurent dans le répertoire jusqu'à ce que vous les supprimiez manuellement.

source: Add a sideload file to an item
fr_fr: Ajouter un fichier sideload à un contenu

source: With File Sideload installed and configured, and files in the directory, you can now use the module to add media to items.
fr_fr: Une fois Sideload installé et configuré, et des fichiers chargés dans le répertoire, vous pouvez utiliser le module pour ajouter des médias à vos contenus.

source: When editing an item, go to the Media tab. The Add New Media sidebar now includes a button for Sideload (at the very bottom).
fr_fr: Quand vous modifiez un contenu, ouvrez l'onglet Média. Le volet Ajouter un média contient maintenant un bouton pour Sideload (tout en bas).

source: Clicking on the button adds a Sideload media block. There are two fields:
fr_fr: En cliquant sur le bouton, vous ajoutez un bloc média Sideload. Ce bloc présente deux champs:

source: **Title**: Give the media file a new title (optional).
fr_fr: **Titre** : Donnez un nouveau titre au média (optionnel).

source: **File**: select a file from this dropdown menu. The menu will load the file names as they appear in the directory. Select one from the dropdown and save changes.
fr_fr: **Fichier** : sélectionner un fichier depuis ce menu déroulant. Le menu charge les noms de fichiers tels qu'ils apparaissent dans le répertoire. Sélectionnez-en un et enregistrez les modifications.

source: CSV Import integration
fr_fr: Intégration à Import CSV

source: With CSV Import, you can add media to items via File Sideload. Provide a column with full file names, not URLs, pointing to the files in your sideload directory. Add the mapping to Media source > Sideload.
fr_fr: Avec Import CSV, vous pouvez ajouter des médias aux contenus via File Sideload. Créez une colonne avec les noms de fichiers complets (pas les URLs) pointant vers les fichiers de votre répertoire Sideload. Ajoutez les correspondances à Source du média > Sideload.
