Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/index.po
Languages: fr

source: Modules Management
fr: Gestion des modules

source: Modules extend the functionality of your Omeka S installation and sites. A list of modules available for download is on the [Modules Directory](https://omeka.org/s/modules/). Instructions are available on each module's documentation page.
fr: Les modules étendent les fonctionnalités de votre instance Omeka S et de vos sites. Une liste des modules pouvant être téléchargés est disponible dans le [Répertoire des modules](https://omeka.org/s/modules/). Vous trouverez des consignes sur la page de documentation spécifique à chaque module.

source: !!! Note Not every module will work with every version of Omeka, especially newer modules on old installations. Older versions of modules may be available on their Github pages. Use the Modules Directory to find the "Github" link on the right side of the screen for each plugin, then look on the right hand side of the Github page for the "Releases" section.
fr: !!! Note Tous les modules ne sont pas compatibles avec toutes les versions d'Omeka, plus particulièrement de nouveaux modules sur des instances anciennes. Des versions précédentes des modules sont parfois accessible sur leurs pages Github. Utilisez le Répertoire des modules pour trouver le lien "Github" sur la droite de l'écran pour chaque module, puis cherchez dans la partie droite de la page Github pour trouver la section des "Versions".

source: ![Screen capture of admin dashboard showing Modules tab active.](modulesfiles/modulesbrowse.png)
fr: ![Capture d'écran du tableau de bord d'administration montrant l'onglet Modules actif.](modulesfiles/modulesbrowse.fr.png)

source: To manage the modules installed on your Omeka S site, click on the **Modules** section in the left-hand navigation of your [admin dashboard](../admin-dashboard.md).
fr: Pour voir quels modules sont installés sur votre site Omeka S, cliquez sur le lien Modules dans la navigation à gauche de votre [tableau de bord d'administration](../admin-dashboard.md).

source: Note that only [Global Administrators](../admin/users.md) can install and manage modules; Supervisors can browse installed modules but not modify them. Other users do not have access to this tab.
fr: Notez que seuls les Administrateurs généraux peuvent installer et gérer les modules. Les Administrateurs de Site peuvent parcourir les modules installés. Les autres utilisateurs n'ont pas accès à cet onglet.

source: Any modules that have been uploaded into the `/modules` folder of the installation should appear in the list of modules. Each module displays the name of the module with the version number, creator, and a summary of its function.
fr: Tout module chargé dans le dossier '/modules' de l'instance devrait apparaître dans la liste des modules. Chaque module affiche le nom du module ainsi que le numéro de la version, le créateur et un résumé de sa fonction.

source: Multiple buttons can appear to the right of a module’s label. Each button has both an icon and a label describing its action:
fr: Il y a plusieurs boutons qui apparaissent à droite du libellé du module. Chaque bouton possède une icône et un libellé décrivant son action :

source: **Configure** (a wrench icon): some modules have settings which can be adjusted. Click this icon to adjust settings for the module in this row.
fr: **Configurer** (une icône de clé à molette): certains modules ont des paramètres pouvant être ajustés. Cliquez sur l'icône pour modifier les paramètres du module de cette ligne.

source: **Activate/Deactivate** (sliding switch): when a module is active, the slider area background is transparent and the switch is to the left. When inactive, the background of the slider area background is opaque and the switch is to the right.
fr: **Activer/Désactiver** (interrupteur coulissant) : quand un module est actif, l'arrière plan de l'interrupteur est transparent et l'interrupteur est positionné à gauche. Quand le module est inactif, l'arrière plan est opaque et l'interrupteur est positionné à droite.

source: **Install/Uninstall** (arrow and rectangle): use this button to install or uninstall a module. When the button is green and the arrow points down, you can install the module. When the button is red and the arrow points up, you can uninstall the module.
fr: **Installer/Désinstaller** (flèche et rectangle) : utilisez ce bouton pour installer ou désinstaller un module. Quand le bouton est vert et que la flèche pointe vers le bas, vous pouvez installer le module. Quand le bouton est rouge et la flèche pointe vers le haut, vous pouvez désinstaller le module.

source: ![Icons described above, from right to left: configure, activate and deactivate, install and uninstall](modulesfiles/moduleButtons.png)
fr: ![Icônes telles que décrites ci-dessus, de droite à gauche: configurer, activer et désactiver, installer et désinstaller](modulesfiles/moduleButtons.fr.png)

source: When a module has a new release, it will display on the browse page with a message in green stating "A new version of this module is available. Get the new version." There will be a link to the download page for the module. [Follow the steps below to update a module](#updating-a-module). These warnings only show up on installed and activated modules. You can [toggle these notifications on the settings page](../admin/settings.md#general).
fr: Quand un module a une nouvelle version, ce sera affiché sur la page des modules avec un message en vert déclarant « Une nouvelle version de ce module est disponible. Téléchargez la nouvelle version », suivi d'un lien vers la page de téléchargement du module. (Voir mise à jour, ci-dessous, pour plus d'informations)

source: ![A list of modules in different states. One is uninstalled, one is installed but not active, two are active but only one is showing a Configure button. The last module on the list has a "new version" banner in green.](modulesfiles/moduleUpdatemsg.png)
fr: ![Une liste de modules avec des statuts différents. Un est désinstallé, un est installé mais inactif, deux sont actifs mais un seul à un bouton Configurer. Le dernier module de la liste a un bandeau vert "nouvelle version"](modulesfiles/moduleUpdatemsg.fr.png)

source: Adding modules to Omeka S
fr: Ajouter des modules à Omeka S

source: In order to appear in the **Modules** section of the admin dashboard for your Omeka S installation, module files must be manually added to the `/modules` folder of the installation, using an FTP program or SSH connection.
fr: Pour qu'il apparaisse dans la section **Modules** du tableau de bord admin de votre instance Omeka S, le fichier d'un module doit être ajouté manuellement au dossier '/modules' de l'instance, en utilisant un programme FTP ou une connexion SSH.

source: Modules registered with Omeka are available on the [Modules](https://omeka.org/s/modules/) directory of the Omeka S site. Other modules may be made available by their authors in other locations.
fr: Les modules qui ont été enregistrés sont disponibles sur la page [Modules](https://omeka.org/s/modules/) du site Omeka S. D'autres modules peuvent être mis à disposition par leurs auteurs à d'autres endroits.

source: To add a module to the site using FTP:
fr: Pour ajouter un module au site en utilisant FTP :

source: Download the zipped module to your computer.
fr: Téléchargez le module zippé sur votre ordinateur.

source: Open your FTP client, log on to the server that houses the Omeka S install, and navigate to the `/modules` folder (this should be located in the main folder of the install).
fr: Ouvrez votre client FTP, connectez-vous au serveur qui héberge l'instance Omeka S et naviguez vers le dossier `/modules` (il doit être situé dans le dossier principal de l'installation).

source: Upload the zipped module to the `/modules` folder .
fr: Téléchargez le module zippé dans le dossier `/modules`.

source: Unzip the module.
fr: Dézippez le module.

source: !!! note The folder that appears in the `/modules` folder should show the name of the module, without any version numbers. If you are having issues installing a module, check that you have unzipped the module correctly, without creating extra folder levels.
fr: !!! note Le dossier qui apparaît dans le dossier '/modules' devrait afficher le nom du module, sans numéro de version. Si vous rencontrez des problèmes à l'installation d'un module, vérifiez que vous avez correctement dézippé le module, sans créer de niveaux de dossiers supplémentaires.

source: Please note that if you are downloading the folder for a module from GitHub rather than the [Module Directory](https://omeka.org/s/modules/), you need to be sure to download the [latest release](https://help.github.com/en/articles/linking-to-releases) rather than the version in active development. If you are unsure how to do this, please consult the [GitHub help files](https://help.github.com/en).
fr: Veuillez noter que si vous téléchargez le dossier d'un module depuis GitHub au lieu du [répertoire de modules](https://omeka.org/s/modules/), vous devez vous assurer de télécharger la [dernière version](https://help.github.com/en/articles/linking-to-releases) plutôt que la version en développement. Si vous n'êtes pas sûr de ce que vous faites, veuillez consulter les [fichiers d'aide GitHub](https://help.github.com/en).

source: You can also use SSH to clone a module directly from that module's git repository. Do this only if you are comfortable with git, GitHub, and working with SSH.
fr: Vous pouvez aussi utiliser SSH pour cloner un module directement depuis le dépôt git. Ne faites ça que si vous êtes à l'aise avec git, github, et SSH.

source: Installing modules
fr: Installer des modules

source: To install a module, navigate to the Modules tab on the left-hand navigation of the admin dashboard of your Omeka S installation.
fr: Pour installer un module, naviguez vers l'onglet Modules dans la navigation de gauche du tableau de bord d'administration de votre installation Omeka S.

source: Find the module in the table and click the "Install" button. The module is now installed and will automatically be activated. For modules with configuration options, you will be taken to the configuration page for that module. For modules without configuration options, the Modules page will simply reload, with a success message at the top.
fr: Trouvez le module dans le tableau est cliquez sur le bouton "Installer". Le module est désormais installé et sera automatiquement activé. Pour les modules avec des options de configuration, vous serez dirigé vers une page de configuration. Pour les modules sans options de configuration, la page des Modules se réactualisera, avec un message de réussite affiché en haut de la page.

source: ![Success message with green highlight reading "The module was successfully installed"](modulesfiles/mods_insuccess.png)
fr: ![Message de réussite avec une emphase verte « Le module a été installé avec succès »](modulesfiles/mods_insuccess.fr.png)

source: Activating a module
fr: Activer un module

source: If you have a module which is installed but inactive, click the "Activate" button to use the module. You should see a success message once the page reloads. The "Activate" button will now read "Deactivate".
fr: Si vous avez un module installé mais inactif, cliquez sur le bouton "Activer" pour utiliser le module. Un message de réussite devrait apparaître au rechargement de la page. Le bouton "Activer" affiche désormais "Désactiver".

source: ![Success message with green highlight reading "The module was successfully activated"](modulesfiles/mods_acsuccess.png)
fr: ![Message de réussite avec une emphase verte « Le module a été activé avec succès »](modulesfiles/mods_acsuccess.fr.png)

source: Configuring a module
fr: Configurer un module

source: Some, but not all, modules include the option to configure settings for that module. If an active module displays the "Configure" button with a wrench icon, you should click through to understand the configuration settings for that module.
fr: Certains modules, mais pas tous, incluent des options de configuration. Si un module actif affiche le bouton "Configurer" (clé à molette), vous pouvez configurer ce module.

source: Information regarding configuration options for individual modules can be found on the documentation page for those modules.
fr: Les informations concernant les options de configuration pour ces modules peuvent être trouvées dans la documentation de ces modules.

source: Uninstalling a module
fr: Désinstaller un module

source: If a module is removed properly from an Omeka installation, all of the tables it created in the database will be deleted, and you will lose any data that has been generated in conjunction with that module while it was installed. For example, if you use the Mapping module to add geolocation data to all of your items, all of those fields will be deleted if you uninstall Mapping.
fr: Si un module est correctement désinstallé d'une instance Omeka, tous les tableaux qu'il aura générés dans la base de données sont supprimés, et toutes les données liées à ce module seront perdues. Par exemple, si vous utilisez Mapping pour ajouter des données de géolocalisation à vos contenus, tous les champs concernés seront supprimés lors de la désinstallation de Mapping.

source: Removing a module is essentially installing in reverse:
fr: Retirer un module est essentiellement l'inverse de l'installation :

source: Deactivate the module by clicking the "Deactivate" button.
fr: Désactivez le module en cliquant sur le bouton "Désactiver".

source: Uninstall the module by clicking the "Uninstall" button.
fr: Désinstaller le module en cliquant sur le bouton "Désinstaller".

source: A drawer will open on the right side of the window asking you to confirm that you want to uninstall the module. Click "Confirm uninstall" to continue.
fr: Un tiroir s'ouvrira sur la droite de la fenêtre vous demandant de confirmer que vous voulez désinstaller le module. Cliquez sur le bouton « Confirmer la désinstallation » pour continuer.

source: ![Uninstall module dialogue with the message "Are you sure you would like to uninstall this module?"](modulesfiles/mods_confirmuninstall.png)
fr: ![Dialogue de désinstallation du module avec le message « Êtes-vous sûr de vouloir désinstaller ce module ? »](modulesfiles/mods_confirmuninstall.fr.png)

source: The uninstalled module will continue to appear on your Modules page (with the option to install it) unless the folder for the module is removed from the `/modules` folder on the Omeka S installation, which can be done via FTP or SSH.
fr: Le module désinstallé continuera d'apparaître dans la page de vos modules sauf si le dossier du module est retiré du dossier '/modules' de l'instance Omeka S, ce qui peut être fait via FTP ou SSH.

source: Updating a module
fr: Mettre à jour un module

source: To update a module using FTP:
fr: Pour mettre à jour un module en utilisant FTP :

source: From the Modules tab on your Omeka S installation, deactivate the module you're going to update.
fr: Depuis l'onglet Modules de votre installation Omeka S, désactivez le module que vous vous apprêtez à mettre à jour.

source: Download the latest release of the module to your computer.
fr: Téléchargez la nouvelle version du module sur votre ordinateur.

source: Open your FTP client and log on to the server that houses the Omeka S install.
fr: Ouvrez votre client FTP et connectez-vous sur le serveur qui héberge l'instance Omeka S.

source: Navigate to the `/modules` folder (this should be located in the main folder of the install).
fr: Naviguez vers le dossier '/modules' (il doit être situé dans le dossier principal de l'instance).

source: Move the old copy of the module to your computer.
fr: Téléchargez l'ancien module sur votre ordinateur.

source: Upload the zipped folder for the latest version of the module to the `/modules` folder.
fr: Utilisez votre client FTP pour télécharger le dossier zippé de la dernière version du module vers le dossier '/modules'.

source: In your FTP client, unzip the new version module.
fr: Dans votre client FTP, dézippez la nouvelle version du module.

source: On the Omeka S installation dashboard, go to the Modules tab and activate the new version of the module.
fr: Sur le tableau de bord de l'instance Omeka S, allez dans l'onglet Modules et activez la nouvelle version du module.

source: Check to be sure your settings have been preserved and there are no errors. After this, you can safely delete the old module folder that you saved to your computer.
fr: Vérifiez que vos paramétrages ont bien été conservés et qu'il n'y a pas d'erreurs. Après cela, vous pouvez en toute sécurité supprimer le dossier de l'ancienne version du module que vous avez enregistré sur votre ordinateur.

source: If you are concerned about problems with the update, be sure to keep the older version of the module on your local machine in case you have to switch them back. Follow the same update steps with the earlier version of the module.
fr: Si vous êtes inquiets des potentiels problèmes de la mise à jour, assurez-vous de garder une copie de l'ancienne version du module sur votre machine locale au cas où vous devriez revenir à cette version. Vous feriez le retour en arrière de la même manière que pour la mise à jour.

source: If you run into problems while updating, turn on [error logging](../errorLogging) and post on the [Omeka Forum](https://forum.omeka.org/c/omeka-s/modules).
fr: Si vous rencontrez des problèmes pendant la mise à jour, activez [la journalisation des erreurs](../errorLogging) et demandez de l'aide sur le [Forum Omeka](https://forum.omeka.org/c/omeka-s/modules).
