Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/mapping.po
Languages: fr_fr

source: ![Map page block with only the WMS Overlays section open. All of the mentioned fields are empty](../modules/modulesfiles/Mapping_Page_Overlays.png)
fr_fr: ![Bloc de page Carte avec la section WMS ouverte. Les champs sont vides](../modules/modulesfiles/Mapping_Page_Overlays.fr.png)

source: Once you have added an overlay, it will appear above the fields for adding overlays.
fr_fr: Une fois que vous avez ajouté une couche, elle s'affiche au-dessus des champs pour ajouter d'autres couches.

source: Choose a default overlay by checking the box next to it. Edit an overlay by clicking on on the red pencil edit button, or click the red trashcan icon to delete the overlay.
fr_fr: Choisissez une couche par défaut en cochant la case qui l'accompagne. Modifiez une couche en cliquant sur le bouton crayon rouge ou cliquez sur l'icône poubelle pour supprimer la couche.

source: ![Screenshot of the WMS Overlays with empty fields and the US and Territories overlay above the fields. A blue arrow points to the overlay](../modules/modulesfiles/Mapping_Page_Overlays2.png)
fr_fr: ![Capture des couches WMS avec champs vides et la couche US et Territoires au-dessus. Une flèche pointe vers la couche](../modules/modulesfiles/Mapping_Page_Overlays2.fr.png)

source: Timeline adds a timeline display to the left of the map view. Note that this feature requires the [Numeric Data Types](../modules/numericdatatypes.md) module and at least one item that has a property with a Timestamp or Interval value (applied via the [resource template](../content/resource-template.md)).
fr_fr: Timeline ajoute une vue chronologique à la gauche de la carte. Cet affichage est dépendant du module [Numeric Data Types](../modules/numericdatatypes.md) et nécessite au moins un contenu avec une propriété Horodatage ou Intervalle (appliquée via le [modèle de ressource](../content/resource-template.md)).

source: **Title headline**: displays on the first slide of the timeline (see ["Timeline public view"](#timeline-public-view) below). You can use this to name the timeline.
fr_fr: **Title headline** : s'affiche sur la première slide de la chronologie (voir ["Affichage public de la chronologie"](#timeline-public-view) ci-dessous). Cette propriété vous permet de nommer la chronologie.

source: **Title text**: appears below the title headline on the first slide of the timeline (see ["Timeline public view"](#timeline-public-view) below). You can use this to provide context or narrative introduction for the timeline.
fr_fr: **Title text** : s'affiche sous le titre sur la première slide de la chronologie (voir ["Affichage public de la chronologie"](#timeline-public-view) ci-dessous). Cette propriété vous permet de donner des éléments de contexte ou de narration.

source: **Fly to**: is a dropdown menu where you can set the zoom level for each point in the timeline on the map. Your options are default view, or zoom levels 0-18 (even numbers only). The higher the number, the more zoomed in the map will be.
fr_fr: **Fly to** : menu déroulant qui permet d'établir le niveau de zoom pour chaque élément de la chronologie dans son affichage sur la carte. Les options sont la vue par défaut, ou des niveaux de zoom de 0 à 18. Le plus haut le nombre, le plus la carte sera zoomée.

source: Note that the transition between points is animated, so if you have very distant points the shift between them will involve a significant zoom out and in.
fr_fr: Notez que la transition entre les différentes localisation est animée : si celles-ci sont très éloignées, la transition consistera en un fort zoom arrière puis avant.

source: **Show contemporaneous events**: sets how two events with the same timestamp or interval are displayed. If checked, contemporaneous events will both display in the map when active in the story slider.
fr_fr: **Show contemporaneous events?** : définit l'affichage de deux événements ayant le même horodatage ou le même intervalle temporel. Si la case est cochée, les événements contemporains s'afficheront tous deux sur la carte en même temps.

source: For timestamp properties, if two events have a date of "1 January 2000," both events will show on the map when either is in the story slider.
fr_fr: S'il s'agit de deux événements avec le même horodatage, par exemple "1er janvier 2001", ils seront tous deux affichés sur la carte quand l'un ou l'autre apparaîtra dans les slides.

source: For interval properties, if one event has an interval of "28 July 1914 - 11 November 1918" and another has an interval of "January 1819- December 1920" both events will show on the map when either is in the story slider.
fr_fr: S'il s'agit d'intervalle se chevauchant, par exemple si un événement correspond à l'intervalle "28 juillet 1914-11 novembre 1918" et l'autre à l'intervalle "Janvier 1819-décembre 1920", les deux événements s'afficheront sur la carte lorsque l'un ou l'autre apparaît dans les slides.

source: Note that this setting only works with the default view of Timeline navigation position.
fr_fr: Ce paramètre ne fonctionne qu'avec la vue par défaut de la position de navigation chronologique définie ci-dessous.

source: **Timeline navigation position**: by default, the timeline displays with the story slider, to the left of the map. Using this dropdown, you can change where the story slider displays. Options are:
fr_fr: **Timeline navigation position** : par défaut, la chronologie s'affiche dans les slides à gauche de la carte. Vous pouvez changez son emplacement avec les options de ce menu déroulant :

source: Default position
fr_fr: Position par défaut

source: Full width, below story slider and map
fr_fr: Pleine largeur, en dessous des slides et de la carte

source: Full width, above story slider and map.
fr_fr: Pleine largeur, au-dessus des slides et de la carte.

source: **Property**: a dropdown menu; select the timestamp or interval property to use when populating the timeline. The dropdown menu will populate with the properties which have been defined in a resource type as using numeric data types Interval or Timestamp.
fr_fr: **Propriété** : menu déroulant ; sélectionnez la propriété d'horodatage ou d'intervalle temporel à utiliser pour remplir la chronologie. Le menu déroulant affiche les propriétés qui ont été définies comme utilisant les types de données numériques Intervalle ou Horodatage.

source: You may want to make a note of which property and numeric data type you are using before creating the map block. The dropdown only displays the term and data type but not which template it is associated with, for example `Date Created (numeric:timestamp)`.
fr_fr: Il est conseillé de noter quelles propriétés et types de données numériques vous utilisez avant de créer le bloc de la carte. Le menu déroulant n'affiche que les termes et types de données mais pas les modèles de ressources auxquels ils sont associés : par exemple, `Date (numeric:timestamp)`.

source: Noted that you can only select *one* property per timeline. You cannot mix timestamp and interval data.
fr_fr: À noter, vous ne pouvez sélectionnez *qu'une seule* propriété par chronologie. Vous ne pouvez pas mélanger des données d'horodatage et d'intervalle.

source: ![Mapping block with all options collapsed except Timeline, which shows options as described, all empty](../modules/modulesfiles/mapping-timelineBlock.png)
fr_fr: ![Bloc de cartographie avec toutes les options réduites sauf Timeline, qui affiche les options telles que décrites ci-dessus, toutes vides](../modules/modulesfiles/mapping-timelineBlock.fr.png)

source: To remove the timeline from a map block, click the "X" on the far right of the Property dropdown.
fr_fr: Pour retirer la chronologie d'un bloc de carte, cliquez sur le "X" à la droite du menu déroulant Propriété.

source: To see how the various settings of the timeline block appear on the public side, please see the [Timeline Public View](#timeline-public-view) section below.
fr_fr: Pour vois l'affichage public des différents paramétrages, voir la section [Vue publique de la chronologie](#timeline-public-view) ci-dessous.

source: Attachments (Map by attachments block)
fr_fr: Bloc Map by attachments

source: Markers are added to the map using Items.
fr_fr: Des marqueurs sont ajoutés à la carte en utilisant des Contenus.

source: Click "Add Attachment" (1) to select them from a list on the right (2). Note: This list will only be populated by items that have at least one location added to them (when editing the item).
fr_fr: Cliquez sur "Ajouter une pièce jointe" (1) pour sélectionner des contenus au sein de la liste qui s'affiche dans le volet de droite. Note : cette listes ne contient que les contenus qui ont au moins une localisation associée (lors de la création ou de la modification de ces contenus).

source: Clicking an item adds it to a list in the Attachments pane (3).
fr_fr: En cliquant sur un contenu, vous l'ajoutez à la liste des pièces jointes (3).

source: Click and drag items in this list to reorder them.
fr_fr: Cliquez et déplacez les contenus de la liste pour les réorganiser.

source: Delete items by clicking the red trashcan.
fr_fr: Supprimez des contenus en cliquant sur l'icône de poubelle.

source: ![Screenshot of the map with Add Attachment selected. On the right a list of items.](../modules/modulesfiles/Mapping_pageAttachments.png)
fr_fr: ![Capture de la carte avec "Ajouter une pièce jointe" sélectionné. Sur la droite une liste de contenus.](../modules/modulesfiles/Mapping_pageAttachments.fr.png)

source: To add multiple items at once, click the "Quick add" slider just above the list of items in the right hand drawer. This will add a checkbox to the left of each item. Check the boxes of those items you want to add to the map, then click the "Add selected" button at the bottom of the drawer.
fr_fr: Pour ajouter plusieurs contenus à la fois, cliquez sur l'interrupteur "Ajout rapide" au-dessus de la liste de contenus dans le volet de droite. Cette option ajoute une case à cocher à la gauche de chaque contenu. Cochez les cases des contenus que vous souhaitez ajouter à la carte, puis cliquez sur le bouton "Ajouter la sélection" en bas du volet.

source: ![Drawer with bulk add option activated](../modules/modulesfiles/Mapping-bulkAttachments.png)
fr_fr: ![Volet avec ajout rapide activé](../modules/modulesfiles/Mapping-bulkAttachments.fr.png)

source: Query (Map by query block)
fr_fr: Bloc Map by query

source: In order to use this block, you will need to run a query, or search, in your items. From the search results page, copy everything in your browser's address bar starting with the question mark all the way to the end of the search url (to the right).
fr_fr: Pour utilisez ce bloc, il faut lancer une requête (ou recherche) dans les contenus. Copiez l'url qui s'affiche dans la barre d'adresse, du point d'interrogation à la fin.

source: ![The address bar and very top of a search results page.](../sites/sitesfiles/sitespg_bpquery.png)
fr_fr: ![la barre d'adresse et le haut d'une page de résultats](../sites/sitesfiles/sitespg_bpquery.png)

source: Paste the query string into the Query field in the Map by query block. Note that at no point will items display on the admin side. You will need to go to the public view to see the items which result from your query.
fr_fr: Coller la requête dans le champ de requête du bloc Map by query. Aucun contenu ne s'affiche sur l'interface administrateur. Il faut se rendre sur la vue publique pour voir le résultat de la recherche.

source: ![A map by query block open to the Query section. There is a query pasted into the field.](../modules/modulesfiles/mapping-blockQuery.png)
fr_fr: ![Bloc Map by query avec un requête collée dans le champ concerné.](../modules/modulesfiles/mapping-blockQuery.png)

source: Public view
fr_fr: Vue publique

source: A map block will display on a public page at full page width. If you have settings in the [default view](#default-view) of the block, these should be applied. Otherwise the block will zoom so that all of the items are visible.
fr_fr: Un bloc de carte s'affiche sur l'interface publique avec une carte de la largeur de la page. Si vous n'avez pas activé la vue par défaut, le bloc sera zoomé pour que tous les contenus soient visibles.

source: Viewers can zoom either using the scroll function of their computer or the Zoom in/out buttons on the left side of the map.
fr_fr: Les utilisateurs peuvent zoomer en utilisant l'option de défilement de leur souris ou de leur pavé tactile, ou en utilisant les boutons idoines sur la gauche de la carte.

source: ![Map block with three individual markers and two green cluster circles of two markers. The map shows a portion of southern England.](../modules/modulesfiles/mapping-public.png)
fr_fr: ![Carte avec trois marqueurs et des clusters verts](../modules/modulesfiles/mapping-public.fr.png)

source: Each item will display as a marker on the map. Markers which are close together will display as a cluster circle, with a number indicating how many items share that location. As you zoom in, these clusters may break open.
fr_fr: Chaque contenu est représenté par un marqueur sur la carte. Les marqueurs proches les uns des autres sont signalés par un cercle de concentration vert, avec un nombre indiquer combien de contenu se trouvent à cette localisation. Lorsque les utilisateurs zooment, les cercles de concentration peuvent ou non se défaire.

source: Clicking on a marker will open a label for that marker. If you have not added a label or image for the marker, it will simply say "view item." If you have added a label, it will show the label, as well as representative media and a link to the media if the marker has one.
fr_fr: Lorsque vous cliquez sur un marqueur, son étiquette s'affiche. Si vous n'avez pas ajouté d'image ou de libellé pour ce marqueur, vous trouverez simplement l'indication "voir le contenu". Si vous avez ajouté un libellé, celui-ci s'affiche, tout comme le média associé ainsi qu'un lien vers celui-ci.

source: Item mapping marker with label only: ![](../modules/modulesfiles/mapping-publicLabel.png)
fr_fr: Marqueur avec seulement un libellé : ![](../modules/modulesfiles/mapping-publicLabel.fr.png)

source: Item mapping marker with label and image: ![](../modules/modulesfiles/mapping-publicLabelImg.png)
fr_fr: Marqueur avec libellé et image : ![](../modules/modulesfiles/mapping-publicLabelImg.fr.png)

source: Item mapping marker with no label or image: ![](../modules/modulesfiles/mapping-publicNoLabel.png)
fr_fr: Marqueur sans libellé ni image : ![](../modules/modulesfiles/mapping-publicNoLabel.fr.png)

source: Timeline public view
fr_fr: Vue publique de la chronologie

source: On the public side, the timeline will display to the left of the map, or above the map on mobile views. Each item appears on both the map and the timeline.
fr_fr: Sur l'interface publique, la chronologie s'affiche à la gauche de la carte, ou au-dessus de celle-ci pour les utilisateurs mobiles. Chaque contenu apparaît à la fois sur la carte et dans la chronologie.

source: On a map block with timeline, the block initially loads with the map either at default view or zoomed to display all markers. The timeline will display the title headline and text, as seen below:
fr_fr: Sur un bloc de carte avec chronologie, la carte est intialement chargée avec une vue par défaut ou zoomée pour contenir tous les marqueurs. La chronologie affiche d'abord son titre et sa description, comme ci-dessous :

source: ![Map block with timeline, displaying the first slide of the timeline. There are two lines of text, a larger font reading "Title Headline" and below it smaller font reading "title text".](../modules/modulesfiles/mapping-timelinePublic1.png)
fr_fr: ![Bloc de carte avec chronologie, affichant la première slide de la chronologie](../modules/modulesfiles/mapping-timelinePublic1.fr.png)

source: In the timeline half of the display, information appears on the top and the timeline on the bottom. The timeline viewer has zoom buttons which increase or decrease the horizontal display of time (zoom in for year by year, zoom out to see decades at once). The arrow below them returns the viewer to the title slide.
fr_fr: Dans la partie chronologie de l'affichage, les informations s'affichent au-dessus de la chronologie. La visionneuse de chronologie comprend aussi des bouton de zoom pour l'affichage temporel horizontal (zoomez pour voir les années, dézoomez pour les décennies entières).

source: When mousing over the timeline, the cursor changes to a four-directional arrow. Viewers can hold and drag left and right to scroll through the timeline. They can also navigate between items using the semi-opaque right and left arrows on the information area of the display.
fr_fr: L'utilisateur peut cliquer et déplacer sa souris pour naviguer vers la droite ou la gauche de la chronologie. Les flèches sous les boutons de zoom permettent de naviguer entre les slides.

source: Clicking on a maker will display that item's date or interval, title, description, and attached image. The information area has a scroll bar for longer material. The title acts as a link to the item's show page.
fr_fr: Si vous cliquez sur un marqueur, la date ou l'intervalle s'affiche, ainsi que le titre, la description et l'image associée. La partie information a une barre de navigation pour les descriptions plus longues. Le titre est cliquable et renvoie vers la page du contenu.

source: ![Map block with timeline, displaying the interval item "Steventon Rectory, 1775-1801". The information area includes the beginning of a long paragraph describing the item. The marker for the rectory in the timeline runs off the right side of the timeline, which displays 1760-1800.](../modules/modulesfiles/mapping-timelinePublic2.png)
fr_fr: ![Bloc de carte avec chronologie, montrant un intervalle ou une date. Long paragraphe dans la partie information.](../modules/modulesfiles/mapping-timelinePublic2.png)

source: Whenever an item is selected, its marker in the timeline will show up with a highlight to indicate that it is active.
fr_fr: Quand un contenu est sélectionné, son marqueur apparaît dans la chronologie en surbrillance.

source: **Numeric:Interval appearance** Interval properties display as a long bar running horizontally across the timeline, with bars reaching down to the timeline at the start and end dates of the interval. Overlapping intervals will stack.
fr_fr: **Affichage de Numeric:Interval** La propriété "Interval" est représentée par une longue barre horizontale encadrée par des crochets en début et fin d'intervalle. Les intervalles peuvent se chevaucher.

source: ![Interval timeline with both Steventon Rectory and Reading Abbey Girls' School. The latter is open and highlighted in the timeline display; it is shorter than and nested under the timeline display for the Rectory.](../modules/modulesfiles/mapping-timelinePublic3.png)
fr_fr: ![Deux intervalles qui se chevauchent, l'un est activé et l'autre non](../modules/modulesfiles/mapping-timelinePublic3.fr.png)

source: **Numeric:Timestamp appearance** Timestamp properties display as a flag on the timeline, with one bar anchoring them to the timeline. Items which overlap either due to date or long text will stack.
fr_fr: **Affichage de Numeric:Timestamp** La propriété "Horodatage" est représentée par un drapeau dont le mât le raccroche à la chronologie. Les contenus peuvent se chevaucher.

source: ![Timestamp timeline showing markers for the births of Cassandra and Jane Austen in the 1770s](../modules/modulesfiles/mapping-timelinePublic4.png)
fr_fr: ![Marqueurs de dates qui se chevauchent](../modules/modulesfiles/mapping-timelinePublic4.png)

source: **Timeline navigation position** If you select "full width, below story slider and map" in the "Timeline navigation position" dropdown, the timeline and map will display as follows:
fr_fr: **Position de navigation dans la chronologie** Si vous sélectionnez "full width, below story slider and map" dans le menu déroulant "Timeline navigation position", la chronologie s'affiche comme suit :

source: ![Timeline start page slide, with the timeline displaying full width below the map and story slider](../modules/modulesfiles/mapping-timelinePublicBelow.png)
fr_fr: ![Chronologie en-dessous de la carte](../modules/modulesfiles/mapping-timelinePublicBelow.fr.png)

source: If you select "full width, above story slider and map", the display will be similar but with the timeline above.
fr_fr: Si vous sélectionnez "full width, above story slider and map", la chronologie apparaît au-dessus de la carte.

source: **Show contemporaneous events** When "show contemporaneous events" is checked, the map zooms to display all events which take place on the same day.
fr_fr: **Affichez les événements contemporains** Quand la case "show contemporaneous events" est cochée, la carte est zoomée pour afficher tous les événements qui ont lieu le même jour.

source: In the image below, the timeline is using interval data. The event "Reading Abbey Girls' School" (March 1785 - December 1786) takes place within the same period as "Steventon Rectory" (1775-1801), so the map is zoomed out to display the location markers for both events.
fr_fr: Dans la capture ci-dessous, la chronologie utilise des données d'intervalle. L'événement "Revue passée par le Prince..." a lieu durant la même période que l'événement "La Butte Montmartre" : la carte est zoomée pour afficher les marqueurs de localisation des deux événements.

source: ![image as described](../modules/modulesfiles/mapping-timelinePublicSCE.png)
fr_fr: ![image telle que décrite](../modules/modulesfiles/mapping-timelinePublicSCE.fr.png)

source: If you would like to remove the mapping location from an item, you must delete all the map modifications. First, delete each marker (click the "Delete a Marker" button, select the markers, click to save). Then clear the map view settings (click the "Clear the default center and zoom level" button). The map will return to a global view. Save the item and confirm that the map no longer appears.
fr_fr: Pour retirer les informations cartographiques d'un contenu, vous devez supprimer toutes les modifications de la carte associée. D'abord, supprimez tous les marqueurs (cliquez sur le bouton "Supprimer un marqueur", sélectionnez les marqueurs, cliquez pour enregistrer). Ensuite, supprimez les paramétrages de vue de la carte (cliquez sur "Clear the default center and zoom level"). La carte retourne à sa vue par défaut. Enregistrez le contenu et vérifiez que la carte n'apparaisse plus.
