Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/mapping.po
Languages: fr_fr

source: The [Mapping module](https://omeka.org/s/modules/Mapping) allows you to geolocate Omeka S items. Maps can also include timelines that allow you to scroll through items on a map in chronological order.
fr_fr: Le [module Mapping](https://omeka.org/s/modules/Mapping) permet de géolocaliser les contenus Omeka S. Les cartes peuvent aussi contenir des éléments temporels permettant de circuler dans les contenus de manière chronologique.

source: ![Map with timeline](../modules/modulesfiles/mapping-timelinePublic1.png)
fr_fr: ![Carte avec frise chronologique](../modules/modulesfiles/mapping-timelinePublic1.fr.png)

source: The Mapping module has no global configuration settings. It adds a new "Mapping" tab to each item edit screen, and also adds page blocks to [Site Pages](../sites/site_pages.md) that can be used to display maps for browsing.
fr_fr: Le module Mapping n'a pas de paramètres de configuration. Il ajoute un onglet "Carte" à chaque contenu, ainsi que des blocs aux [pages de sites](../sites/site_pages.md) qui peuvent servir pour la navigation.

source: Item mapping
fr_fr: Cartographier un contenu

source: To add a map to a new or existing item, click to edit the item. Navigate to the "Mapping" tab to add location data to the item. Selecting the tab will open the map interface.
fr_fr: Pour ajouter une carte à un contenu, cliquez sur le bouton de modification du contenu. Allez à l'onglet "Carte" pour ajouter des données de localisation. En sélectionnant cet onglet, vous ouvrez l'interface de la carte.

source: ![Screenshot of the Add/Edit Item Page with Mapping tab selected. Large World Map with white buttons described below](../modules/modulesfiles/Mapping_Item_Add.png)
fr_fr: ![Capture de l'écran Modifier contenu avec onglet tab sélectionné. Carte du monde avec les boutons décrits ci-dessous](../modules/modulesfiles/Mapping_Item_Add.fr.png)

source: Manipulating the map
fr_fr: Manipuler la carte

source: Small white buttons on the left side of the map control and modify the appearance of the map. Hover over the buttons with the mouse to view tool-tips.
fr_fr: Des petits boutons blancs sur la gauche de la carte permettent de contrôler et modifier son aspect. Passer la souris dessus pour voir les conseils d'utilisation.

source: ![Screenshot of the buttons on the map described below](../modules/modulesfiles/Mapping_JustButtons.png)
fr_fr: ![Capture des boutons décrits ci-dessous](../modules/modulesfiles/Mapping_JustButtons.fr.png)

source: **Zoom in**: The small white square with a black plus sign. Each click zooms in one step (between 0 and 19).
fr_fr: **Zoom in** : Petit carré blanc avec un signe plus. Chaque clic permet de zoomer une fois (entre 0 et 19).

source: **Zoom out**: The small white square with black minus sign. Each click zooms out one step (between 0 and 19).
fr_fr: **Zoom out** : Petit carré blanc avec un signe moins. Chaque clic permet de dézoomer une fois (entre 0 et 19).

source: **Draw a Marker**: The small white square with black bubble marker. When you click the button your pointer becomes a blue marker. Click again on the map to place the marker.
fr_fr: **Draw a Marker** : Petit carré blanc avec une marqueur de position. Quand vous cliquez sur ce bouton, votre curseur devient un marqueur bleu. Cliquez sur la carte pour positionner le marqueur.

source: **Move Marker**: The small white square with black box and pencil icon. This option is only available after a marker has been added. Click the button and a pink box appears around each marker. Click a marker to move it. Click again to place. Use the grey buttons to "Save" or "Cancel".
fr_fr: **Move Marker** : Petit carré blanc avec une icône de crayon et de papier. Cette option n'est utilisable qu'après avoir placé un marqueur. Cliquez sur ce bouton pour faire apparaître une boîte rose autour du marqueur. Cliquez sur le marqueur pour le déplacer. Cliquez de nouveau pour le positionner. Utilisez les boutons gris pour sauvegarder ou annuler.

source: **Delete Marker**: The small white button with a trashcan icon. This option is only available after a marker has been added. Click the icon to select a marker. Click the marker to be removed and it will disappear. Use the grey buttons to "Save" or "Cancel" these changes.
fr_fr: **Delete Marker** : Petit bouton blanc avec une icône de poubelle. Cette option n'est disponible qu'après l'ajout d'un marqueur. Cliquez sur l'icône pour sélectionner le marqueur. Cliquez sur le marqueur à supprimer. Utilisez les boutons gris pour "Enregistrer" ou "Annuler".

source: **Search Address**: The small white square with a black magnifying glass icon. Click to enter an address in the search bar.
fr_fr: **Search Address** : Petit carré blanc avec une icône de loupe. Cliquez pour saisir une adresse dans la barre de recherche.

source: **Set the current view as default view**: The small white square with a target or crosshair symbol. The map will default to a zoomed out (global) view. Click to set the current view as the default view for this item.
fr_fr: **Set the current view as default view** : Petit carré blanc avec un symbole en forme de croix. La vue par défaut de la carte est dézoomée. Cliquez pour définir la vue actuelle comme vue par défaut pour ce contenu.

source: **Go to current default view**: The small black square with a black box around a dot. This option is only available after you have set a default view. Click to pan and zoom map to the selected view for this item.
fr_fr: **Go to current default view** : Petit carré noir avec un boîte noir autour d'un point. Cette option n'est disponible qu'une fois une vue par défaut établie. Cliquez pour activer la vue sélectionnée pour ce contenu.

source: **Clear the default center and zoom level**: The small white square with a black "X". This option is only available after you have set a default view. Click to clear pan and zoom preferences and return to the initial global view.
fr_fr: **Clear the default center and zoom level** : Petit carré blanc avec un "X". Cette option n'est disponible qu'une fois une vut par défaut établie. Cliquez pour désélectionner la vue choisie et revenir à la vue générale de départ.

source: In addition to these options, you can also navigate the map using your mouse or trackpad by scrolling to zoom and clicking and dragging to pan.
fr_fr: En plus de ces options, vous pouvez aussi naviguer sur la carte en utilisant votre souris ou votre pad en scrollant pour zoomer ou en maintenant le clic pour déplacer la vue.

source: Adding locations to an item
fr_fr: Ajouter des localisations a un contenu

source: In order to add a location to an item, edit the item and go to the "Mapping" tab.
fr_fr: Pour ajouter une localisation à un contenu, modifier le contenu et allez dans l'onglet "Carte".

source: To find the point where you want to locate the marker, you can do one of the following:
fr_fr: Pour trouver le point où vous souhaitez situer le marqueur, vous pouvez procéder d'une des manières suiavntes :

source: Zoom and drag to find the location.
fr_fr: Zoomer et vous déplacer sur la carte pour trouver la localisation.

source: Type the place name into the Search Address field (see Figure 4 below).
fr_fr: Saisir le nom du lieu dans le champ Search Address (voir Figure 4 ci-dessous).

source: Note that this will populate as you type, and will not search locations which do not match the formatting of the search function.
fr_fr: Cette action fait apparaître des propositions d'adresses au fur et à mesure que vous remplissez le champ et ne cherche pas les localisations qui ne correspondent pas au formatage de la fonction de recherche.

source: Enter latitude and longitude coordinates into the search box. These should be formatted as decimals, for example `38.897222, -77.064167`, not `38° 53′ 50″ N, 77° 3′ 51″ W`.
fr_fr: Saisissez des coordonnées de latitude et de longitude dans le champ de recherche. Celles-ci doivent être des décimales comme `38.897222, -77.064167`, et non `38° 53′ 50″ N, 77° 3′ 51″ W`.

source: ![Mapping tab with a search for "Roosevelt Island" in the search view. Below the search field are a number of suggested locations.](../modules/modulesfiles/Mapping_itemSearch.png)
fr_fr: ![Onglet Carte avec une recherche pour "Montmartre". Sous le champ de recherche se trouvent diverses suggestions.](../modules/modulesfiles/Mapping_itemSearch.fr.png)

source: Click on the **Draw a Marker** tool in the right hand toolbar. Your cursor will become a marker which can move around the map. To set the point, click on the map.
fr_fr: Cliquez sur l'outil **Draw a Marker** dans la barre d'outils. Votre curseur devient un marqueur que vous pouvez déplacer sur la carte. Pour établir une localisation, cliquez sur la carte.

source: ![Mapping tab with an active marker being drawn. The marker has a tooltip saying "click map to place marker"](../modules/modulesfiles/Mapping-drawMarker.png)
fr_fr: ![Onglet carte avec un marqueur actif. Le marqueur est accompagné du message "click map to place marker"](../modules/modulesfiles/Mapping-drawMarker.fr.png)

source: You can now click on the marker to add a label which will display on [public map views](#public-view) of the item. Be aware that this will display in a large font.
fr_fr: Vous pouvez ensuite cliquer sur le marqueur pour lui ajouter une étiquette qui apparaîtra sur la [vue publique de la carte](#public-view) du contenu. Cette étiquette apparaît dans une police de taille importante.

source: ![Close up of map with a marker selected. There is a field to enter the maker label.](../modules/modulesfiles/Mapping-addLabel.png)
fr_fr: ![Champ pour entrer l'étiquette visible](../modules/modulesfiles/Mapping-addLabel.fr.png)

source: When you are adding a label, you can also add an image to display on the marker when clicked in the [public view](#public-view). You can only select from images which have already been [attached to the item as media](../content/items.md#media). To remove the image, select "No Image" from the sidebar.
fr_fr: Quand vous ajoutez une étiquette, vous pouvez aussi ajouter une image qui apparaîtra sur le marqueur quand il sera cliqué sur la [vue publique](#public-view). Vous pouvez sélectionner uniquement une image qui est déjà [attachée au contenu comme média](../content/items.md#media). Pour retirer cette image, sélectionnez "No image" dans la barre latérale.

source: ![Marker selected with Image added. The media is also visible in the sidebar, along with an option for "no image"](../modules/modulesfiles/Mapping-addImage.png)
fr_fr: ![Marqueur avec une image ajoutée. Le média est aussi visible dans la barre latérale, ainsi que l'option "no image"](../modules/modulesfiles/Mapping-addImage.fr.png)

source: Editing markers
fr_fr: Modifier des marqueurs

source: To edit the label or image, simply click on the marker. This will open the options for the label and image, as seen above.
fr_fr: Pour modifier l'étiquette ou l'image, cliquez simplement sur le marqueur. Cette action ouvre les options décrites ci-dessus pour l'étiquette et l'image.

source: To **move a marker** you have added, use the "Move marker" button on the left hand toolbar (small white square with black box and pencil icon). Any marker on the map will become highlighted in a red, dotted-line outline. Click and drag the marker you want to move.
fr_fr: Pour **déplacer un marqueur**, utilisez le bouton "Move marker" dans la barre d'outils. Tous les marqueurs sont alors entourés d'une ligne rouge en pointillé. Cliquez et déplacez le marqueur choisi.

source: To apply your changes, click the "Save" option which opens from the "Move marker" button. To cancel the changes, click "Cancel". If you do not click save, the marker will not be moved.
fr_fr: Cliquez sur l'option "Enregistrer" qui s'ouvre avec le bouton "Move marker". Pour annuler, cliquez sur "Annuler". Si vous ne cliquez pas sur sauvegarder, le marqueur ne sera pas déplacé.

source: ![Marker being moved](../modules/modulesfiles/Mapping-moveMarker.png)
fr_fr: ![Marqueur déplacé](../modules/modulesfiles/Mapping-moveMarker.fr.png)

source: To **delete a marker**, first click the "Delete a marker" in the left hand toolbar (trash can icon). Click on the marker you want to delete; this will remove the marker from the map. In order to make the deletion permanent, you must click Save in the menu which opens from the "Delete a marker" button.
fr_fr: Pour **supprimer un marqueur**, cliquez sur "Delete a marker" dans la barre d'outils (icône de poubelle). Cliquez sur le marqueur que vous souhaitez supprimer ; cette action retire le marqueur de la carte. Pour rendre la suppression permanente, vous devez cliquez sur Enregistrer dans le menu qui s'ouvre avec le bouton "Delete a marker".

source: Note that you can use the "clear all" button in the menu which opens form the "delete a marker" button to clear all markers on the map.
fr_fr: Vous pouvez aussi utiliser le bouton "clear all" qui s'ouvre avec "delete a marker" pour supprimer tous les marqueurs de la carte.

source: ![Marker being deleted.](../modules/modulesfiles/Mapping-deleteMarker.png)
fr_fr: ![Marqueur en cours de suppression](../modules/modulesfiles/Mapping-deleteMarker.fr.png)

source: Setting the map display
fr_fr: Ajuster l'affichage de la carte

source: You can also set the map's default display zoom level and center, independently of the marker(s) you place. The default is to center on one marker and zoom fully in, or to zoom out far enough to contain all markers in the map view.
fr_fr: Vous pouvez aussi déterminer le niveau de zoom et le centre par défaut de la carte, indépendamment du ou des marqueur(s) positionnés. Par défaut, le centrage se fait sur un des marqueurs avec un zoom maximal ou suffisamment dézoomé pour contenir tous les marqueurs dans l'affichage de la carte.

source: CSV Import integration
fr_fr: Intégration avec Import CSV

source: Mapping is compatible with [CSV Import](../modules/csvimport.md) when importing items (not mixed resources).
fr_fr: Mapping est compatible avec [Import CSV](../modules/csvimport.md) pour l'import de contenus (mais par de ressources diverses).

source: If the two modules are enabled, your CSV Import process will have two new dropdown menus in the "Add mapping" sidebar when you are connecting a spreadsheet column to a property.
fr_fr: Si les deux modules sont activés, deux nouveaux menus déroulants apparaissent dans la barre latérale "Ajouter une correspondance" lorsque vous établissez une correspondance entre une colonne de tableur et une propriété.

source: The "Resource location" dropdown menu includes three options for pinning the item geographically (latitude, longitude, and latitude/longitude). You can import multiple values for these fields.
fr_fr: Le menu "Localisation de la ressource" inclut trois options pour établir la localisation du contenu (latitude, longitude ou latitude/longitude). Vous pouvez importer plusieurs valeurs pour ces champs.

source: The "Default map view" dropdown menu allows you to set a centerpoint and zoom level for the map that displays for that item. Without a map centerpoint, the map will center on the item's pin.
fr_fr: Le menu "Vue par défaut de la carte" permet d'établir un point de centrage et un niveau de zoom pour la carte associée à ce contenu. Sans point central déterminé, la carte sera centrée sur le marqueur.

source: You cannot set marker labels or marker images in CSV Import.
fr_fr: Vous ne pouvez pas déterminer d'étiquette ou d'image de marqueur via Import CSV.

source: You cannot [batch-edit](../content/items.md#batch-actions) mapping values after items are in your system, only edit them manually one item at a time. So, CSV Import can help you do things such as set a consistent map zoom level on each item, by supplying a spreadsheet with every item and the same zoom level number in each row.
fr_fr: Vous ne pouvez pas [modifier en lot](../content/items.md#batch-actions) les valeurs cartographiques une fois les contenus importés dans votre instance, vous ne pouvez que les modifier manuellement et une à une. Import CSV peut aider pour établir un niveau de zoom régulier pour chaque item en fournissant un tableur avec le même niveau de zoom pour chaque ligne de contenu.

source: Adding map blocks to a site
fr_fr: Ajouter des blocs de carte à un site

source: Mapping creates two page blocks you can add to your pages: "Map by attachments", where you manually add resources to the map block; and "Map by query", which allows you to use a search string to add resources to the map block.
fr_fr: Mapping crée deux blocs que vous pouvez ajouter à vos pages : "Map by attachments", qui permet d'ajouter manuellement des ressources au bloc ; et "Map by query" qui permet d'utiliser une chaîne de recherche pour ajouter des ressources au bloc.

source: To add a map to a new or existing page, click to edit the page. On the right, under "Add new block", click either the "Map by attachments" or "Map by query" option (1). Selecting one will open the map block to the page (2). The blocks include customizable features for the map in collapsable panes. Click the triangle to expand or collapse these fields (3).
fr_fr: Pour ajouter une carte à une page, cliquez pour la modifier. Sur la droite, sous "Ajouter un nouveau bloc", cliquez soit sur "Map by attachments" ou "Map by query" (1). Ceci ajoute le bloc de carte à a page (2). Les deux blocs incluent des options personnalisables pour la carte. Cliquez sur le triangle pour ouvrir ou refermer ces champs (3).

source: ![Screenshot of the Page with Map Block selected. Block includes menu options Default View, WMS Overlays and attachments.](../modules/modulesfiles/Mapping_Page_MapBlock1.png)
fr_fr: ![Capture de la Page avec le bloc de carte sélectionné. Il inclut les options Default View, WMS Overlays et pièces jointes](../modules/modulesfiles/Mapping_Page_MapBlock1.fr.png)

source: The "Map by attachments" and "Map by query" blocks have largely the same settings, with the exception of the final option.
fr_fr: "Map by attachments" et "Map by query" présentent les mêmes options, à l'exception de la dernière.

source: Default view
fr_fr: Vue par défaut

source: This section lets you set the appearance and zoom level of the map. There are three fields and a preview map. Within the preview map are buttons which you can use to set the default zoom and location of the map. If you do not set a default zoom or location, the map will adjust to display all resources.
fr_fr: Cette section permet de définir l'apparence et le niveau de zoom de la carte. Il y a trois champs et une carte de prévisualisation, qui contient des boutons pour établir le zoom et la localisation par défaut. Si vous ne définissez pas de zoom ou de localisation par défaut, la carte s'ajuste pour afficher toutes les ressources.

source: ![Map by attachments block open to Default Settings. There is no information in any field, and the preview map is zoomed in to level 2](../modules/modulesfiles/mappingBlockDefaultView1.png)
fr_fr: ![Bloc Map by attachments ouvert sur la vue par défaut. Les champs sont vides et la carte est en zoom niveau 2.](../modules/modulesfiles/mappingBlockDefaultView1.png)

source: **Basemap provider**: select from a dropdown of basemaps. Once selected, the preview map will update to show you the appearance of that map. The default is "OpenStreetMap.Mapnik".
fr_fr: **Basemap provider** : menu déroulant de fournisseurs pour la carte de base. Une fois sélectionnée, la carte de prévisualisation s'actualise. Le fournisseur par défaut est "OpenStreetMap.Mapnik".

source: **Minimum zoom level**: set the minimum zoom for the map. Fully zoomed out is 0.
fr_fr: **Minimum zoom level** : définir le niveau de zoom minimum de la carte. Le plus dézoomé correspond à 0.

source: **Maximum zoom level**: set the maximum possible zoom level. The highest is 19. Some basemaps do not function at higher levels; you will want to check to be sure you set your maximum at a level where you basemap is visible.
fr_fr: **Maximum zoom level** : définir le niveau maximum de zoom pour la carte. Le plus zoomé correspond à 19. Certaines cartes de départ ne fonctionnent pas à ce niveau de zoom ; vérifiez que vous définissez un niveau de zoom maximum auquel la carte reste visible.

source: Between the fields and the preview map is a message which tells you the current zoom level, as you zoom using the plus and minus buttons on the preview map or the scroll on your comptuer. Use this to help you determine where you want to set your minimum and maximum zoom levels.
fr_fr: Entre les champs et la carte, un message indique le niveau de zoom actuel. Utilisez cette information pour déterminer quels niveaux de zoom maximum et minimum choisir.

source: Within the preview map, there are five buttons:
fr_fr: Sur la carte de prévisualisation elle-même, il y a cinq boutons :

source: Zoom in: The small white square with a black plus sign. Each click zooms in one step (between 0 and 19).
fr_fr: Zoom in : Petit carré blanc avec un signe plus. Chaque clic ajoute un niveau de zoom (entre 0 et 19).

source: Zoom out: The small white square with black minus sign. Each click zooms out one step (between 0 and 19).
fr_fr: Zoom out : Petit carré blanc avec un signe moins. Chaque clic retire un niveau de zoom (entre 0 et 19).

source: Set the current view as default view: The small white square with a target or crosshair symbol. The map will default to a global view. Click to set the current view as the default view.
fr_fr: Set the current view as default view : Petit carré blanc avec un symbole de cible. La vue par défaut est globale. Cliquez pour établir la vue actuelle comme vue par défaut.

source: Go to current default view: The small black square with a black box around a dot. This option is only available after a default view has been set. Click to pan and zoom map to the selected view.
fr_fr: Go to current default view : Petit carré blanc avec une boîte entourant un point. Cette option n'est disponible qu'une fois la vue par défaut établie. Cliquez pour revenir à cette vue.

source: Clear the default center and zoom level: The small white square with a black "X". Click to clear pan and zoom preferences and return to the initial global view.
fr_fr: Clear the default center and zoom level : Petit carré blanc avec un "X". Cliquez pour retirer les préférence et revenir à la vue globale de départ.

source: ![closeup of the mapping buttons with labels added](../modules/modulesfiles/mappingBlockDefMapButtons.png)
fr_fr: ![capture des boutons de la carte avec des étiquettes ajoutées](../modules/modulesfiles/mappingBlockDefMapButtons.fr.png)

source: WMS overlays
fr_fr: Couches WMS

source: **Label**: Create a unique, descriptive label for the map overlay. This will be visible to visitors and should be used to differentiate between overlays.
fr_fr: **Libellé** : Créez un libellé pour la couche WMS. Celui-ci sera visible par les utilisateurs et doit permettre de différencier les couches.

source: **Base URL**: Add a URL to the WMS map.
fr_fr: **URL de base** : Ajoutez une URL à la carte WMS.

source: **Layers**: Any layers you wish to use, separated by commas.
fr_fr: **Couches** : Toutes couches que vous souhaitez utiliser, séparées par des virgules.

source: **Styles**: Any styles you wish to use, separated by commas.
fr_fr: **Styles** : Tous styles que vous souhaitez utiliser, séparés par des virgules.

source: Click Add Overlay to create the overlay. Click _Clear Inputs_ to clear each of the fields. Multiple overlays can be added.
fr_fr: Cliquez sur Ajouter une couche pour créer la couche. Cliquez sur Supprimer les entrées pour vider les champs. Plusieurs couches peuvent être ajoutées.
