Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/modules/sharing.po
Languages: fr_fr

source: Currently, Sharing supports the following options:
fr_fr: Actuellement, le module Sharing prend en charge les options suivantes :

source: Embed codes.
fr_fr: Codes d'incorporation.

source: Once Sharing has been installed and activated for an Omeka S install, it is available for all sites on the install.
fr_fr: Une fois que le module Sharing a été et activé pour une installation Omeka S, il est disponible pour tous les sites de l'installation.

source: ![Sharing module installed and activated in the general settings module page](../modules/modulesfiles/sharing1.png)
fr_fr: ![Module Sharing installé et activé dans la page des paramètres généraux des modules](../modules/modulesfiles/sharing1.png)

source: ![Left hand navigation options for sites: settings is at the bottom](../modules/modulesfiles/sharing2.png)
fr_fr: ![Options de navigation à gauche pour les sites : les paramètres sont en bas](../modules/modulesfiles/sharing2.png)

source: **Enable Sharing module for these methods**: gives a series of checkboxes, one for each service or option (Facebook, Twitter, etc.).
fr_fr: **Activer le module Sharing pour ces méthodes** : donne une série de cases à cocher, une pour chaque service ou option (Facebook, Twitter, etc.).

source: **Sharing buttons placement on the page**: sets the placement of the sharing buttons either at the top of the content (below the navigation and page header) or at the bottom (just above the footer).
fr_fr: **Positionnement des boutons de partage sur la page** : définit le placement des boutons de partage soit en haut du contenu (sous la barre navigation et l'en-tête de la page), soit en bas (juste au-dessus du pied de page).

source: ![Checkboxes for the sharing options listed above, in two rows](../modules/modulesfiles/sharing_options.png)
fr_fr: ![Les cases à cocher pour les options de partage sont listées au-dessus, en deux lignes](../modules/modulesfiles/sharing_options.png)

source: Ensure that the correct boxes are checked for your site. You can uncheck all of the boxes to turn off sharing for your site. Be sure to save your changes.
fr_fr: Assurez-vous que les cases appropriées sont cochées pour votre site. Vous pouvez décocher toutes les cases pour désactiver le partage pour votre site. Veillez à enregistrer vos modifications.

source: Public side
fr_fr: Côté public

source: Sharing icons for enabled services and options will display on pages you build, as well as individual item/show pages on your site.
fr_fr: Les icônes de partage pour les services et options activés s'afficheront sur les pages que vous créez, ainsi que sur les pages individuelles des articles et pages de votre site.

source: ![Share buttons for Facebook, twitter, and email displayed above an item's title, just under the page header](../modules/modulesfiles/sharing_buttons.png)
fr_fr: ![Boutons de partage pour Facebook, Twitter et e-mail affichés au-dessus du titre d'un contenu, juste en dessous de l'en-tête de la page](../modules/modulesfiles/sharing_buttons.png)

source: By default, the module will share the page title, the name of the site, and the name of the installation.
fr_fr: Par défaut, le module partagera le titre de la page, le nom du site et le nom de l'installation.

source: ![An example tweet for the page, listing the page’s title then a dot, followed by the site’s title then a dot, followed by the installation title, ending with a dummy URL for the site](../modules/modulesfiles/sharing_display1.png)
fr_fr: ![Un exemple de tweet pour la page, listant le titre de la page puis un point, suivi du titre du site puis un point, suivi du titre de l'installation, se terminant par une URL fictive pour le site](../modules/modulesfiles/sharing_display1.png)
