Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/index.po
Languages: fr

source: Resources
fr: Ressources

source: Miscellaneous
fr: Divers

source: Omeka S User Manual
fr: Manuel Utilisateur Omeka S

source: Omeka S is a web publication system for universities, galleries, libraries, archives, and museums. It creates a local network of independently curated exhibits sharing a collaboratively built pool of items and their metadata.
fr: Omeka S est un système de publication web pour les universités, galeries, bibliothèques, archives, et musées. Il crée un réseau local d'expositions indépendamment conservées partageant un réservoir de contenus et de métadonnées construit de manière collaborative.

source: The sections of this manual correspond to the navigation sections on the left-hand side of the :doc:`administrative dashboard <docs/admin-dashboard>`. of an Omeka S Installation:
fr: Les sections de ce manuel correspondent aux sections de navigation sur la gauche du :doc:`tableau de bord d'administration <docs/admin-dashboard>` d'une installation Omeka S:

source: Creating, editing, and managing sites, the public-facing parts of an Omeka S installation.
fr: Création, modification, et gestion des sites, les parties publiques d'une installation Omeka S.

source: Creating, editing, and managing the content of an installation: items, item sets, media, vocabularies, and resource templates.
fr: Création, modification, et gestion du contenu d'une installation: contenus, collections, media, vocabulaires, et modèles de ressource.

source: Access to functionality in the admin section varies by user role, but can include: users, jobs, and settings.
fr: L'accès aux fonctionnalités d’administration varient selon le rôle utilisateur, mais peut inclure: utilisateurs, tâches, et paramètres.

source: This section opens with basic information on managing the modules which extend the functionality of your Omeka S installation and sites. It then offers specific documentaiton for Omeka S modules created by RRCHNM, listed in alphabetial order.
fr: Cette section commence par des informations basiques sur la gestion des modules qui étendent les fonctionnalités de votre installation Omeka S et des sites. Elle fournit ensuite une documentation spécifique pour les modules Omeka S créés par RRCHNM, listés par ordre alphabétique.

source: This manual also includes a :doc:`glossary <docs/glossary>`, instructions on conducting :doc:`searches <docs/search>`, and how to turn on :doc:`error logging <docs/errorLogging>`.
fr: Ce manuel inclut aussi un :doc:`glossaire <docs/glossary>`, des instructions sur la réalisation de :doc:`recherches <docs/search>`, et comment activer :doc:`la journalisation des erreurs <docs/errorLogging>`.

source: Screencasts to supplement the documentation are linked from relevant pages, and can be browsed in the `Omeka S collection on Vimeo <https://vimeo.com/showcase/4215056>`_.
fr: Des liens vers des *screencasts* qui complètent la documentation sont ajoutés aux pages concernées, et ils peuvent être parcourus dans la `collection Omeka S sur Vimeo <https://vimeo.com/showcase/4215056>`_.

source: This documentation is CC-BY-NC
fr: Cette documentation est CC-BY-NC
