Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/admin/jobs.po
Languages: fr_fr

source: Jobs
fr_fr: Tâches

source: When a user starts running a process which will take some time, such as an API import, the progress of the process is displayed in the **Jobs** section of the admin dashboard. The table also displays completed, stopped, and error-interrupted jobs.
fr_fr: Lorsqu'un utilisateur commence à exécuter un processus qui prend un certain temps, tel qu'une importation d'API, l'avancement du processus est affiché dans l'onglet "Tâches" du tableau de bord de l'administrateur. Le tableau affiche également les travaux terminés, arrêtés et interrompus par une erreur.

source: The Jobs table shows a job’s **ID** number, **Class** of job, **Status** and the **Owner**, or user who started the job.
fr_fr: Le tableau des tâches présente le numéro d'identification du travail, la classe du travail, le statut et le propriétaire ou l'utilisateur qui a démarré le travail.

source: You can order the rows of the table by ID, Class, Status, or Owner (descending or ascending) using the drop-down menus just above the table on the upper right.
fr_fr: Vous pouvez classer les lignes du tableau par ID. Classe, Statut ou Propriétaire (décroissant ou croissant) à l’aide des menus déroulants situés juste au-dessus du tableau en haut à droite.

source: ![Table of jobs including all status messages](adminfiles/jobstable.png)
fr_fr: ![Tableau des tâches incluant tous les messages de statut](adminfiles/jobstable.png)

source: To see the details of a job, click on its ID number. On a job’s details page, you will see the following information:
fr_fr: Sur la page des détails d’une tâche, vous verrez les informations suivantes :

source: **Status** (In Progress, Error, Completed, Stopped)
fr_fr: *Statut* (In Progress, Error, Completed, Stopped)

source: **Started** and **Ended** (date stamps)
fr_fr: *Commencé* et *terminé* (horodatages)

source: **Class** (source of the job, for example `DspaceConnector\Job\Import`)
fr_fr: *Classe* (source de la tâche, par exemple `DspaceConnector\Job\Import`)

source: **Owner**
fr_fr: *Propriétaire*

source: **Args**
fr_fr: *Arguments*

source: **Log** - click on **view log** to see any error or other messages.
fr_fr: *Journal* - cliquer sur *voir le journal* pour voir le détail des erreurs et messages.
