Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/configuration.po
Languages: fr_fr

source: Configuration Options
fr_fr: Options de configuration

source: The following are commonly requested options which can be configured in the file `local.config.php` located in the config directory.
fr_fr: Les options suivantes sont couramment demandées et peuvent être configurées dans le fichier `local.config.php` situé dans le répertoire `config`.

source: For a full list of available configuration keys, please see the [developer documentation page on configuration settings](https://omeka.org/s/docs/developer/configuration/).
fr_fr: Pour obtenir la liste complète des clés de configuration disponibles, veuillez consulter la [page de la documentation du développeur relative aux paramètres de configuration.](https://omeka.org/s/docs/developer/reference/configuration/).

source: Password settings
fr_fr: Configuration des mots de passe

source: You can change the requirements for user passwords in the config file. Options include minimum length, number of upper and lowercase letters, and setting allowed symbols.
fr_fr: Vous pouvez modifier la configuration requise pour les mots de passe utilisateur dans le fichier de configuration. Les options incluent la longueur minimale, le nombre de lettres majuscules et minuscules et la définition des symboles autorisés.

source: Requirements will display on the user creation and edit pages.
fr_fr: Les conditions s'afficheront sur les pages de création et d'édition de l'utilisateur.

source: Thumbnails
fr_fr: Vignettes

source: The `thumbnails` configuration key holds most thumbnail settings:
fr_fr: La clé de configuration `thumbnails` contient la plupart des paramètres des vignettes:

source: Under `types`, set the maximum dimensions for derivative images for media files. There are separate options for large, medium, and square. Defaults for these are 800, 200, and 200 respectively (all sizes are pixels)
fr_fr: Sous `types`, définissez les dimensions maximum pour les images dérivées des fichiers media. Il y a des options séparées pour grandes (*large*), moyennes (*medium*), et carrées (*square*). Leurs valeurs par défaut sont 800, 200, et 200 respectivement (toutes les tailles sont en pixels)

source: `thumbnailer_options` is an array of options passed to the specific thumbnailer in use. For example, the `imagemagick_dir` thumbnail option sets the path to the folder where ImageMagick's `convert` command can be found on the server. This can be useful if Omeka S can't auto-detect the correct path for ImageMagick.
fr_fr: `thumbnailer_options` est un tableau d'options passées au vignettiste spécifique. Par exemple, l'option `imagemagick_dir` définit le chemin vers le dossier où la commande `convert` d'ImageMagick est située. Ça peut être utile si Omeka S n'arrive pas à détecter automatiquement le chemin correct pour ImageMagick.

source: The thumbnailer to use is set under the `service_manager` key, by setting the alias for `Omeka\File\Thumbnailer`:
fr_fr: Le vignettiste à utiliser est défini sous la clé `service_manager`, en définissant l'alias pour `Omeka\File\Thumbnailer`:

source: The default thubnailer is `Omeka\File\Thumbnailer\ImageMagick`. Also available are `Omeka\File\Thumbnailer\Imagick` (which uses the `imagick` PHP extension) and `Omeka\File\Thumbnailer\Gd` (which uses the commonly available `gd` PHP extension).
fr_fr: Le vignettiste par défaut est `Omeka\File\Thumbnailer\ImageMagick`. Sont aussi disponibles `Omeka\File\Thumbnailer\Imagick` (qui utilise l'extension PHP `imagick`) et `Omeka\File\Thumbnailer\Gd` (qui utilise l'extension PHP `gd` couramment disponible).

source: You can also set the thumbnailer to `Omeka\File\Thumbnailer\NoThumbnail`, which will prevent your Omeka S installation from generating thumbnails.
fr_fr: Vous pouvez aussi définir le vignettiste à `Omeka\File\Thumbnailer\NoThumbnail`, ce qui empêchera votre installation Omeka S de générer des vignettes.

source: PHP Path
fr_fr: Chemin PHP

source: Omeka S uses background jobs for some long-running tasks that operate on many items or just otherwise might take a long time. Omeka S uses the PHP CLI (command-line interface) to run these jobs, the `php` command.
fr_fr: Omeka S utilise des tâches de fond pour certaines tâches longues qui manipulent beaucoup de contenus ou simplement parce que ça peut prendre beaucoup de temps. Omeka S utilise la CLI (interface en ligne de commande) PHP pour exécuter ces tâches, la commande `php`.

source: Omeka S by default will try to automatically detect the path to the PHP CLI on the server, but for some servers this detection doesn't work, or there are multiple different `php` commands to choose from. In these situations you can manually configure the correct path in the configuration file:
fr_fr: Omeka S essaiera par défaut de détecter automatiquement le chemin vers la CLI PHP sur le serveur, mais sur certains serveurs cette détection ne fonctionne pas, ou il y a plusieurs commandes `php` différentes. Dans ces situations vous pouvez configurer manuellement le chemin correct dans le fichier de configuration:

source: (Note: the path here is just an example; the proper path will be specific to your server)
fr_fr: (Note: le chemin ici est juste un exemple; le chemin correct sera spécifique à votre serveur)

source: Mail
fr_fr: E-mail

source: The `mail` key can be used to configure how Omeka S sends emails.
fr_fr: La clé `mail` peut être utilisée pour configurer comment Omeka S envoie des e-mails.

source: The default is to use sendmail, where the server is responsible for having mail delivery configured and set up. Sendmail generally requires no configuration on the Omeka S side.
fr_fr: Le comportement par défaut est d'utiliser sendmail, où le serveur est responsable d'avoir une distribution des e-mails configurée et en place. Sendmail ne demande généralement aucune configuration du côté d'Omeka S.

source: Another option for some servers is to configure a direct SMTP connection for sending mail. An example configuration, to be added at the end of `local.config.php` follows (see the [laminas-mail docs](https://docs.laminas.dev/laminas-mail/transport/smtp-options/) for clarification):
fr_fr: Une autre options pour certains serveurs et de configurer une connexion SMTP directe pour envoyer les e-mails. Un exemple de configuration, à ajouter à la fin du fichier `local.config.php`, suit (voir la [documentation de laminas-mail](https://docs.laminas.dev/laminas-mail/transport/smtp-options/) pour des précisions):
