Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/errorLogging.po
Languages: fr

source: Retrieving Error Messages
fr: Récupérer les messages d'erreur

source: If you are experiencing problems with your Omeka S installation, or you want to turn on development-style error tracking, you can do so in two different ways. You will need to edit the `.htaccess` and/or `local.config.php` files, depending on which way you choose. You must use a ftp or terminal client to do so; if you're not sure how to do this, please contact your system administrator or hosting provider.
fr: Si vous avez des problèmes avec votre installation Omeka S, ou si vous voulez activer le suivi des erreurs dans le cadre du développement, vous pouvez le faire de deux manières différentes. Vous aurez besoin de modifier les fichiers `.htaccess` et/ou `local.config.php`, selon la manière choisie. Vous devez utiliser un client FTP ou un terminal; si vous n'êtes pas certain de la manière de faire, contactez votre administrateur système ou votre hébergeur.

source: Display Error Details
fr: Afficher le détail des erreurs

source: One option is to enable on-page display of error details. This will cause "Omeka S has encountered an error" pages to show the error message and details instead of a generic message, and also will display PHP-level errors and warnings on pages if they occur.
fr: Une des options est d'activer l'affichage du détail des erreurs sur la page. Les pages « Omeka S a rencontré une erreur » montreront alors le message d'erreur détaillé à la place du message générique, et affichera aussi les erreurs et avertissements PHP sur les pages concernées.

source: To enable this display, edit your `.htaccess` file.
fr: Pour activer cet affichage, modifiez votre fichier `.htaccess`.

source: The `.htaccess` file is located in the main folder of your Omeka S installation.
fr: Le fichier `.htaccess` est situé dans le dossier principal de votre installation Omeka S.

source: Change line 1 of that file from `SetEnv APPLICATION_ENV "production"` to `SetEnv APPLICATION_ENV "development"`
fr: Modifiez la première ligne de ce fichier en remplaçant `SetEnv APPLICATION_ENV "production"` par `SetEnv APPLICATION_ENV "development"`

source: Log Errors
fr: Journal des erreurs

source: Another option for retrieving error detail information is enabling logging in Omeka S. With logging enabled, Omeka S will write out the details of all errors to a file. Any "Omeka S has encountered an error" page will have its details logged, and additional debugging/warning information may also be logged. You may want to choose this option if you want to get detailed error information but do not want to expose error messages to visitors or other users.
fr: Une autre option pour récupérer le détail des erreurs est d'activer la journalisation dans Omeka S. Avec la journalisation activée, Omeka S écrira le détail des erreurs dans un fichier. Toutes les pages « Omeka S a rencontré une erreur » auront leur erreur détaillée dans le journal, et des informations supplémentaires pourront également être journalisées. Vous voudrez peut-être choisir cette option si vous voulez obtenir le détail des erreurs sans les exposer aux visiteurs ou aux autres utilisateurs.

source: To enable error logging, edit your `local.config.php` file.
fr: Pour activer la journalisation des erreurs, modifiez votre fichier `local.config.php`.

source: The `local.config.php` file is located in the `config` folder.
fr: Le fichier `local.config.php` est situé dans le dossier `config`.

source: Change line 4 from `'log' => false,` to `'log' => true,`
fr: Modifiez la ligne 4 en remplaçant `'log' => false,` par `'log' => true,`

source: Errors will be logged to the file `log/application.log`. Make sure this file is writable by your web server.
fr: Les erreurs seront journalisées dans le fichier `log/application.log`. Assurez vous que ce fichier soit accessible en écriture par le serveur web.
