Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/s-planning-tips.po
Languages: fr

source: Planning Tips
fr: Conseils de planification

source: In Omeka S, you build your [sites](sites/index) page by page, using already existing resources on your installation. While it is best to have some resources before you start building out the pages, you can begin planning your site before you create the first item or item set.
fr: Dans Omeka S, vous construisez vos [sites](sites/index) page par page, en utilisant des ressources existantes sur votre installation. Bien qu'il soit préférable d'avoir quelques ressources avant de commencer à construire les pages, vous pouvez démarrer la planification de votre site avant de créer le premier contenu ou la première collection.

source: What follows are some questions and ideas to help guide you as you plan your sites in Omeka S.
fr: Ce qui suit est une liste de questions et d'idées pour vous guider dans la planification de vos sites dans Omeka S.

source: Site audience and goals
fr: Audience et buts du site

source: **Who is the primary audience of this site?** Being specific will help you shape the site; "people interested in historic architecture" is much more useful than "the general public." Do you have secondary audiences? What do you want these specific audiences to accomplish when they come to the site?
fr: **Qui est l'audience principale de ce site ?** Être spécifique vous aidera à façonner le site; "des personnes intéressées par l'architecture historique" est beaucoup plus utile que "le public général". Avez-vous des audiences secondaires ? Que voulez-vous que ces audiences spécifiques soit capables d'accomplir quand ils viennent sur le site ?

source: **What are the goals of your site?** What do you want your specific audiences to accomplish when they come to the site? What do you want people to take away from the site? What content do you want to highlight?
fr: **Quels sont les buts de votre site ?** Que voulez-vous que vos audiences spécifiques soient capables d'accomplir quand ils viennent sur le site ? Que voulez-vous que les utilisateurs puissent récupérer depuis le site ? Quels contenus souhaitez-vous mettre en valeur ?

source: Resources
fr: Ressources

source: **What will you do with items in this website?** [Items](content/items) are the building blocks of Omeka S. What sort of [resource templates](content/resource-template) will you want to create and use to fully describe your items? Any item you include on an Omeka S will have a public item show page, so try to ensure that the information in an item's metadata can stand on its own.
fr: **Qu'allez-vous faire des contenus sur ce site web ?** Les [contenus](content/items) sont les éléments de base d'Omeka S. Quel type de [modèles de ressource](content/resource-template) voudrez-vous créer et utiliser pour pleinement décrire vos contenus ? Chaque contenu que vous incluez dans Omeka S aura une page publique, donc essayez de vous assurer que les informations présentes dans les métadonnées d'un contenu se suffisent à elles-même.

source: **What will you do with item sets?** You can use [item sets](content/item-sets) to group items to be included on a [site](sites/index), and they can be a way to guide visitors' browsing on your sites. For some sites, item sets are robust resources themselves.
fr: **Qu'allez-vous faire avec les collections ?** Vous pouvez utiliser des [collections](content/item-sets) pour grouper les contenus à inclure dans un [site](sites/index), et ils peuvent être un moyen de guider les visiteurs parcourant vos sites. Pour certains sites, les collections sont des ressources robustes elles-même.

source: How do you want to group items into sets? What metadata fields will your item sets use? Do your item sets have relations to each other or to items?
fr: Comment voulez-vous grouper les contenus dans les collections ? Quels champs de métadonnée vos collections utiliseront ? Vos collections ont-elles des relations entre elles ou avec des contenus ?

source: **What do you want your data to do?** What properties are you going to want to consistently describe in your site? Do you want some of these to display with a different label - for example 'author' instead of 'creator' for books? Use a [resource template](content/resource-template) and change the label of the property.
fr: **Que voulez-vous que vos données fassent ?** Quelles propriétés allez-vous vouloir pour décrire de manière cohérente dans votre site ? Voulez-vous que certaines soient affichées avec un libellé différent – par exemple « auteur » à la place de « créateur » pour des livres ? Utilisez un [modèle de ressource](content/resource-template) et modifiez le libellé de la propriété.

source: In Omeka S, items and item sets can use other resources - items, item sets, and media - as properties; for example, you can make an item for William Shakespeare and have that item fill the 'creator' property for a 'Hamlet' item. How can your resources use this functionality?
fr: Dans Omeka S, les contenus et les collections peuvent utiliser d'autres ressources – contenus, collections, et media – comme des propriétés; par exemple, vous pouvez créer un contenu pour William Shakespeare et utiliser ce contenu pour remplir la propriété « créateur » d'un contenu « Hamlet ». Comment vos ressources peuvent-elles utiliser cette fonctionnalité ?

source: Do you want to use a set of terms (controlled vocabulary) for certain items? You might want to use [Custom Vocab](modules/customvocab). Or do you want to use a terms list created by the Library of Congress or the Getty? Then you might use [Vocab Suggest](modules/valuesuggest).
fr: Voulez-vous utiliser un ensemble de termes (vocabulaire contrôlé) pour certains contenus ? Vous voudrez peut-être utiliser [Custom Vocab](modules/customvocab). Ou voulez-vous utiliser une liste de termes créés par la *Library of Congress* ou Getty ? Alors vous pourrez utiliser [Value Suggest](modules/valuesuggest).

source: Building a site
fr: Construire un site

source: With Omeka S you will build your site from the ground up, which means you need to give some thought to how you want to organize your site.
fr: Avec Omeka S vous construirez votre site à partir de zéro, ce qui signifie que vous avez besoin de réfléchir à la manière dont vous voulez organiser votre site.

source: What pages do you want to include? What kind of content do you want on these pages? How do you want to arrange them? Try sketching out a sample menu or wireframes for the site. Use that as a guide as you build your pages.
fr: Quelles pages voulez-vous inclure ? Quel type de contenu voulez-vous sur ces pages ? Comment voulez-vous les disposer ? Essayez de d'esquisser un exemple de menu ou des maquettes pour votre site. Utilisez ça comme guide pendant la construction des pages.

source: Pages are made up of [blocks](sites/site_pages.md#page-blocks), which can include text, images, and much more. What kind of content do you want on the pages you build? Bear in mind that you can rearrange page blocks as you build, so you can play around with the order of the content on your pages if you need to.
fr: Les pages sont faites à partir de [blocs](sites/site_pages.md#page-blocks), qui peuvent inclure du texte, des images, et bien plus. Quel type de contenu voulez-vous sur les pages que vous construisez ? Gardez en tête que vous pouvez réorganiser les blocs pendant la construction, donc vous pouvez vous amuser avec l'ordre du contenu de vos pages si besoin.

source: How do you want to interact with your visitors on your site? Do you want to [collect](modules/collecting) resources from your visitors? Allow them to [share](modules/sharing) your content on social media?
fr: Comment voulez-vous interagir avec les visiteurs de votre site ? Voulez-vous [collecter](modules/collecting) des ressources de vos visiteurs ? Les autoriser à [partager](modules/sharing) votre contenus sur les réseaux sociaux ?
