Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/index.po
Languages: fr

source: Sites Management
fr: Gestion des sites

source: Sites are the public-facing side of an Omeka-S installation. With sites you can create content and interpretation around a group of items from your installation.
fr: Les sites sont la partie publique d'une installation Omeka S. Avec les sites vous pouvez créer du contenu et une interprétation autour d'un groupe de contenus de votre installation.

source: Sites are managed and access via the *Sites* tab on the left-hand side of the administrative dashboard.
fr: Les sites sont gérés et sont accessibles via l'onglet *Sites* de la partie gauche du tableau de bord d'administration.

source: ![Manage sites view showing Add New button and table of sites with one site](../sites/sitesfiles/sites_admin.png)
fr: ![Vue de gestion des sites montrant un bouton Ajouter Nouveau et un tableau des sites contenant un site](../sites/sitesfiles/sites_admin.png)

source: The manage sites page displays a table with all the sites for the installation, giving the title and owner for each site.
fr: La page de gestion des sites affiche un tableau avec tous les sites de l'installation, donnant le titre et le propriétaire de chaque site.

source: Use the two drop-downs on the right side above the table to sort sites. You can sort by *title*, *URL slug* or *owner*, either ascending or descending. Click the sort button to apply your choices.
fr: Utilisez les deux listes déroulantes. Vous pouvez trier par *titre*, *fragment d'URL* ou *propriétaire*, soit de manière ascendante ou descendante. Cliquez sur le bouton de tri pour appliquer vos choix.

source: Above the table of sites, on the left, is the pagination for the item sets table, where you can click the left and right arrows to move forward and back or enter a page number to go a specific page of item sets.
fr: Au dessus du tableau des sites, sur la gauche, se trouve la pagination pour le tableau des collections, où vous pouvez cliquer sur les flèches gauche et droite pour vous déplacer en avant et en arrière ou entrez un numéro de page pour aller à une page spécifique des collections.

source: Each row gives the title of a site, options to *view* (box with outward arrow), *edit* (pencil), or *delete* (trash can), and displays the owner of the site. *Only global admins and site owners can delete a site.*
fr: Chaque ligne donne le titre d'un site, les options pour *voir* (la boîte avec une flèche sortante), *modifier* (le crayon), ou *supprimer* (la poubelle), et affiche le propriétaire d'un site. *Seuls les administrateurs globaux et les propriétaire d'un site peuvent supprimer un site.*

source: Sites which are not public will have the private icon (an eye with a slash through it) display to the right of the site title.
fr: Les sites qui ne sont pas publiques auront l'icône privée (un œil traversé par une barre oblique) affichée à droite du titre du site.

source: Clicking on the site title will take you to a summary page for the site which displays the site’s *url slug,* and *title,* from which you can return to the site list using a button on the left side of the scree, or *edit* or *view* the site using buttons in the upper right
fr: Cliquer sur le titre du site vous emmènera vers la page de résumé du site qui affichera le *fragment d'URL* du site, et son *titre*, et depuis laquelle vous pouvez retourner à la liste des sites en utilisant un bouton sur le côté gauche de l'écran, ou *modifier* ou *voir* le site en utilisant les boutons dans le coin supérieur droit

source: ![show page for the site “What Does This Look Like” indicating that the theme is default and the slug is public views.](../sites/sitesfiles/sites_quickshow.png)
fr: ![page résumé pour le site « What Does This Look Like » indiquant que le thème est le thème par défaut et le fragment d'URL est public views.](../sites/sitesfiles/sites_quickshow.png)

source: Adding a site
fr: Ajouter un site

source: To create a site, click the *Add new site* button in the upper right-hand corner of the site browse page.
fr: Pour créer un site, cliquez sur le bouton *Ajouter un nouveau site* dans le coin supérieur droit de la page qui liste les sites.

source: The Add New Site page has three tabs: Admin, Theme, and Item Pool.
fr: La page « Ajouter un nouveau site » a trois onglets: Administration, Thème, et Réservoir de contenus.

source: The Admin tab
fr: L'onglet Administration

source: Give your site a *title* (required)
fr: Donnez un *titre* à votre site (obligatoire)

source: create a *slug* for the site’s url. The url will be *installurl/site/slug*. This is optional - if you leave this field blank, Omeka S will create a slug based on the site title.
fr: créez un *identifiant* pour l'URL du site. L'URL sera *installurl/site/identifiant*. C'est facultatif - si vous laissez ce champ vide, Omeka S créera un identifiant basé sur le titre du site.

source: Create a *summary* for your site, a brief idea of what it is about which will appear on your installation's landing page and on [list of site blocks](site_pages.md#page-blocks)
fr: Créez un *résumé* pour votre site, un idée brève du contenu du site qui apparaîtra sur la page d'accueil de votre installation and sur [les blocs de liste des sites](site_pages.md#page-blocks)

source: ![Admin tab for a new site with nothing entered](../sites/sitesfiles/sitesadd_admin.png)
fr: ![Onglet administration pour un nouveau site sans aucune saisie](../sites/sitesfiles/sitesadd_admin.png)

source: The Theme tab
fr: L'onglet Thème

source: Select from the installed themes. Each theme appears as a button with a screenshot of the theme, the theme name, and a link to its creator. When a theme is selected, it will highlight slightly in gray and a checkbox will appear in the bottom right corner of the button.
fr: Sélectionnez depuis la liste des thèmes installés. Chaque thème apparaît comme un bouton avec une capture d'écran du thème, le nom du thème et un lien vers son créateur. Quand un thème est sélectionné, il sera mis en évidence en gris et une case à cocher apparaîtra dans le coin inférieur droit du bouton.

source: ![Theme tab with default theme selected](../sites/sitesfiles/sitesadd_theme.png)
fr: ![L'onglet Thème avec le thème par défaut sélectionné](../sites/sitesfiles/sitesadd_theme.png)

source: Publication settings
fr: Paramètres de publication

source: In the upper right hand corner of the screen, next to the *Add* button, you can set the visibility of your site using the the *make public/private* button (eye icon).
fr: Dans le coin supérieur droit de l'écran, à côté du bouton *Ajouter*, vous pouvez modifier la visibilité de votre site en utilisant le bouton *rendre public/privé* (l’icône d’œil).

source: ![make public button showing an eye icon](../content/contentfiles/item_public.png) Public
fr: ![bouton rendre public montrant une icône d’œil](../content/contentfiles/item_public.png) Publique

source: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png) Private
fr: ![bouton rendre privé montrant une icône d'œil traversé par une barre oblique](../content/contentfiles/item_private.png) Privé

source: You will probably want to leave the site Private until you have added some content.
fr: Vous voudrez probablement laisser le site privé jusqu'à ce que vous ayez ajouté du contenu.

source: Add site
fr: Ajouter un site

source: When you are ready, click the Add button in the upper right corner. Once the page is created, you will be redirected to the site info tab of the site management.
fr: Quand vous êtes prêt, cliquez sur le bouton Ajouter dans le coin supérieur droit. Une fois la page créée, vous serez redirigé vers l'onglet d'informations du site.

source: If you decide you do not want to create this site, click the Cancel button in the upper right next to the Add button
fr: Si vous décidez de ne pas créer ce site, cliquez sur le bouton Annuler dans le coin supérieur droit, à côté du bouton Ajouter

source: Manage a site
fr: Gérer un site

source: To manage a site, navigate to the *Sites* tab from the Omeka S Admin Dashboard. Click either on the site’s title or the edit (pencil) button in the list of sites.
fr: Pour gérer un site, naviguez vers l'onglet *Sites* depuis le tableau de bord Omeka S. Cliquez soit sur le titre du site ou sur le bouton modifier (crayon) dans la liste des sites.

source: This will take you to the Site Info page, and open the context menu for that site in the left hand navigation.
fr: Cela vous emmènera vers la page d'informations du site, et ouvrira le menu contextuel pour ce site dans la navigation à gauche.

source: The context menu for every site has the site title at the top, with an icon of a computer (the site icon) to the right. To the left of the site title is a view button (box with escaping arrow). Clicking the view button will open the public side of the site in a new window.
fr: Le menu contextuel pour chaque site a le titre du site en haut, avec une icône d'ordinateur (l'icône de site) à droite. À gauche du titre du site il y a un bouton voir (une boîte avec une flèche sortante). Cliquer sur le bouton voir ouvrira la partie publique du site dans une nouvelle fenêtre.

source: ![Context menu for the site Jane Austen, with two modules installed](../sites/sitesfiles/sites_menu.png)
fr: ![Menu contextuel pour le site Jane Austen, avec deux modules installés](../sites/sitesfiles/sites_menu.png)

source: Site admin left hand navigation options are:
fr: Les options de navigation dans l'administration du site sont:

source: *[Site Admin](../sites/site_settings.md)*,
fr: *[Administration du site](../sites/site_settings.md)*,

source: *[Resources](../sites/site_resources.md)*,
fr: *[Ressources](../sites/site_resources.md)*,

source: *[User Permissions](../sites/site_users.md)*,
fr: *[Permissions utilisateur](../sites/site_users.md)*,

source: *[Theme](../sites/site_theme.md)*, and
fr: *[Thème](../sites/site_theme.md)*, and

source: Modules, if installed.
fr: Modules, si installés.

source: Any modules which you have installed that have site-specific settings will appear below the site Settings tab in the site's context menu. In the image above, the modules Metadata Browse and Collecting are installed.
fr: Chaque module que vous avez installé et qui a des paramètres spécifique à un site apparaîtra sous l'onglet Paramètres dans le menu contextuel du site. Dans l'image ci-dessus, les modules Metadata Browse et Collecting sont installés.

source: The standard options in the left hand navigation of the Omeka S Admin (items, item sets, etc) are still available below the site context menu.
fr: Les options standards dans la navigation à gauche de l'administration Omeka S (contenus, collections, etc.) sont toujours disponibles sous le menu contextuel du site.
