Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/site_pages.po
Languages: fr

source: Site Pages
fr: Pages de sites

source: Pages form the content of your [sites](../sites/index.md). A site can have one or many pages.
fr: Les pages forment le contenu de vos [sites](../sites/index.md). Un site peu avoir une ou plusieurs pages.

source: Manage the pages for a site by navigating to the Sites section on the left-hand navigation of the admin dashboard. Select the site for which you want to manage the pages and click either the title or the edit (pencil) button to edit that site.
fr: Gérez les pages de votre site en naviguant vers l'onglet Sites dans la navigation à gauche du tableau de bord d'administration. Sélectionnez le site pour lequel vous voulez gérer les pages et cliquez soit sur le titre soit sur le bouton modifier (crayon) pour modifier ce site.

source: Once you are editing the site, click the Pages link in the left-hand navigation.
fr: Maintenant que vous êtes en train de modifier le site, cliquez sur l'onglet Pages dans la navigation à gauche.

source: When you create a new site, Omeka S automatically adds a page titled "Welcome" with a single HTML block (see below). You can edit this page or delete it.
fr: Quand vous créez un nouveau site, Omeka S ajoute automatiquement une page intitulée "Bienvenue" avec un seul bloc HTML (voir ci-dessous). Vous pouvez modifier cette page ou la supprimer.

source: Adding pages
fr: Ajouter des pages

source: From the page for the site, click the Pages link. Then click the "Add new page" button on the upper left side of the window.
fr: Depuis la page du site, cliquez sur l'onglet Pages. Puis cliquez sur le bouton "Ajouter une nouvelle page" dans le coin supérieur droit de la fenêtre.

source: To add a page you must enter a **Title**. You can also enter a **URL Slug**. Both of these can be edited later.
fr: Pour ajouter une page vous devez saisir un **Titre**. Vous pouvez aussi saisir un **identifiant d'URL**.

source: A title is required to create the page. If you do not enter a slug, Omeka S will create one from the page title. A slug is the page’s portion of the URL and can only contain letters, numbers, and hyphens; no other characters are allowed.
fr: Le titre est obligatoire pour créer une page. Si vous ne saisissez pas d'identifiant pour l'URL, Omeka S en crée un à partir du titre de la page. L'identifiant est la partie de l'URL qui correspond à la page : il ne peut contenir que des lettres, des chiffres et des tirets ; aucun autre caractère n'est autorisé.

source: In addition, there is a checkbox for "Add to navigation". If checked, the page will automatically be added to the end of the main [navigation](../sites/site_navigation.md) level for the site. If you do not check this box, you can manually add the page to the site navigation and arrange it from the Navigation page.
fr: En outre, il y a une case à cocher pour « Ajouter à la navigation ». Si elle est cochée, la page apparaîtra automatiquement au niveau de la [navigation](../sites/site_navigation.md) du site. Si vous ne cochez pas cette case, vous devrez manuellement ajouter la page à la navigation du site plus tard.

source: ![Page view showing the fields for Add Page](../sites/sitesfiles/sitepg_add.png)
fr: ![Vue de la page montrant les champs pour Ajouter une page](../sites/sitesfiles/sitepg_add.fr.png)

source: The eye icon, to the left of the "Cancel" and "Add" buttons, is a toggle to set the visibility of your page. If the toggle is set to public (no line), then anyone can see the page. If the toggle is set to private (line through the eye icon), the page will only be visible to logged-in users of the Omeka S installation who have site permissions (Supervisors and Global Admins will always be able to see private pages).
fr: L'icône d’œil à gauche des boutons "Annuler" et "Ajouter" permet de définir la visibilité de votre page. Si la visibilité est définie comme publique (oeil ouvert), alors tout le monde pourra voir la page. Si elle est définie comme privée (œil barré), la page sera visible uniquement par les utilisateurs authentifiés de l'installation Omeka S qui ont des droits sur le site (les Administrateurs de sites et les Administrateurs généraux pourront toujours voir les pages privées).

source: Clicking or hitting enter on the eye icon toggles between public and private.
fr: Cliquer sur l'icône d’œil ou appuyer sur Entrée pour basculer entre public et privé.

source: Page is public: ![make public button showing an eye icon](../content/contentfiles/item_public.png){style="display:inline;"}
fr: ![bouton rendre public montrant une icône d’œil](../content/contentfiles/item_public.fr.png) Public

source: Page is private: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png){style="display:inline;"}
fr: ![bouton rendre privé montrant une icône d'œil traversé par une barre oblique](../content/contentfiles/item_private.fr.png) Privé

source: Once you have entered this information and set visibility, click the "Add" button in the upper right hand corner of the browser window. You will be automatically taken to that page's edit view (see below).
fr: Une fois que vous avez saisi ces informations et défini la visibilité, cliquez sur le bouton "Ajouter" dans le coin supérieur droit de la fenêtre du navigateur. Vous serez automatiquement dirigé vers la vue de modification de la page (voir ci-dessous).

source: If you decide you do not want to create the page, click the "Cancel" button.
fr: Si vous décidez de ne pas créer la page, cliquez sur le bouton "Annuler".

source: Browse pages
fr: Parcourir les pages

source: The Pages page (once you have at least one page) will display all of your pages in their navigation order. Child pages will display below the parent page with a `-` before the page title.
fr: L'onglet Pages (une fois que vous avez au moins une page) affichera toutes vos pages dans leur ordre de navigation. Les pages enfants seront affichées sous leur parent avec un `-` devant le titre de la page.

source: Every page is listed with its Title, buttons to view (box with an arrow coming out), edit (pencil), or delete (trash can) the page, and the page's slug.
fr: Chaque page est listée avec son Titre, des boutons pour voir (boîte avec une flèche sortante), modifier (crayon), ou supprimer (poubelle) la page, ainsi que l'identifiant de la page.

source: ![A sites page browse view, with 12 pages listed, some of which are child pages of the others.](../sites/sitesfiles/sitepg_browse.png)
fr: ![La vue parcourir les pages, avec 12 pages listées, dont certaines sont des pages enfant.](../sites/sitesfiles/sitepg_browse.fr.png)

source: Use the [Navigation](../sites/site_navigation.md) screen of the site to set the order of pages, including setting child and parent pages.
fr: Utilisez l'onglet [Navigation](../sites/site_navigation/) de l'administration du site pour définir l'ordre des pages, y compris la parenté des pages.

source: Editing pages
fr: Modifier les pages

source: After clicking the Pages link, select the page you wish to edit by clicking the name of the page or the edit button (pencil). Note: clicking on the Page title will take you to the public view of that page.
fr: Après avoir cliqué sur l'onglet Pages, sélectionnez la page que vous voulez modifier en cliquant sur le nom de la page ou sur le bouton modifier (crayon). Note: cliquer sur le titre de la page vous emmènera vers la vue publique de cette page.

source: The edit view for a page will display the page's title across the top. In the upper left is the public/private toggle (the eye icon), and buttons to view the public version (opens in a new tab), delete the page, cancel changes, or save changes. Note that changes will not display on the public view until after they have been saved.
fr: La vue modification d'une page affichera le titre de la page en haut. Dans le coin supérieur gauche se situe le bouton public/privé (l'icône d'oeil), et les boutons pour voir la version publique (qui s'ouvre dans un nouvel onglet), supprimer la page, annuler les modifications, ou enregistrer les modifications. Notez que les modifications ne s'afficheront pas sur la vue publique tant qu'elles n'auront pas été enregistrées.

source: At the top of the work area are fields for the page title and URL slug. You can edit these at any time, but remember that the slug must be unique within the site (you cannot have two pages with the slug "welcome" on the same site).
fr: En haut de la zone de travail se situent les champs pour le titre de la page et l'identifiant pour l'URL. Vous pouvez les modifier à n'importe quel moment, mais souvenez-vous que l'identifiant doit être unique au sein du site (vous ne pouvez pas avoir deux pages avec l'identifiant « bienvenue » sur un même site).

source: ![A page in edit view, with one media block added](../sites/sitesfiles/sitepg_edit.png)
fr: ![Une page en vue modification, avec un bloc media ajouté](../sites/sitesfiles/sitepg_edit.fr.png)

source: On the right hand side you can choose to add a new block by selecting one of the following page elements:
fr: Sur la droite vous pouvez choisir d'ajouter un nouveau bloc en sélectionnant parmi les configurations suivantes :

source: Asset
fr: Fichier

source: Browse preview
fr: Aperçu des ressources

source: Item showcase
fr: Vitrine de contenus

source: Item with metadata
fr: Contenu avec métadonnées

source: Line break
fr: Saut de ligne

source: List of pages
fr: Liste des pages

source: List of sites
fr: Liste des sites

source: Media Embed
fr: Média intégré

source: Page title
fr: Titre de page

source: Table of contents.
fr: Table des matières.

source: If you have the relevant modules installed, you may also have:
fr: Contenus avec métadonnées Si vous avez les modules correspondants installés, vous pouvez aussi avoir :

source: Collecting
fr: Collectes

source: Item Carousel
fr: Carrousel de contenus

source: Once you have added blocks to your page, click the "Save" button in the right hand corner. To leave without saving changes, click "Cancel".
fr: Une fois que vous avez ajouté des blocs à votre page, cliquez sur le bouton "Enregistrer" dans le coin supérieur droit. Pour partir sans enregistrer les changements, cliquez sur "Annuler".

source: You can delete any of the blocks by clicking on the trash can icon located in the upper right corner of the block.
fr: Vous pouvez supprimer n'importe quel bloc en cliquant sur l'icône de poubelle située dans le coin supérieur droit du bloc.

source: ![The “media” block is marked for deletion and thus highlighted in red.](../sites/sitesfiles/sitepg_delblock.png)
fr: ![Le bloc « media » est marqué pour la suppression et donc mis en évidence en rouge.](../sites/sitesfiles/sitepg_delblock.fr.png)

source: Change the order of blocks by clicking on the three horizontal lines on the upper left corner of the block and then dragging and dropping it to the desired location.
fr: Changez l'ordre des blocs en cliquant sur les trois lignes horizontales dans le coin supérieur gauche du bloc puis en le glissant et en le déposant à l'endroit souhaité.

source: Some modules may create additional blocks for your site pages. For information on working with these blocks, please see the documentation for that [module](../modules/index.md).
fr: Certains modules peuvent créer des blocs supplémentaires pour vos pages de site. Pour plus d'informations sur ces blocs, veuillez vous référer à la documentation du [module](../modules/index.md) concerné.

source: From the public side
fr: Interface publique

source: If you are on the admin side and click "View" in the upper right-hand corner of a page, it will take you to the public view for that page.
fr: Si vous êtes du côté administration et que vous cliquez sur « Voir » dans le coin supérieur droit de la page, vous allez être redirigé vers la vue publique de cette page.

source: As you are browsing the public side of your site, you can edit the page you are viewing if you are currently logged in and the [user bar option is turned on in Site Settings](../sites/site_settings.md#general-settings).
fr: Pendant que vous naviguez sur l'interface de votre site, vous pouvez modifier la page que vous êtes en train de regarder si vous êtes authentifié et que [l'option de la barre utilisateur est activée dans les paramètres du site](site_settings.md#general-settings).

source: The user bar, which appears across the top of the page, includes a link to edit the current page - circled in red in the below image.
fr: La barre utilisateur, qui apparaît en haut de la page, contient un lien qui permet de modifier la page actuelle - entourée en rouge dans l'image ci-dessous.

source: ![User bar for a page from the site Jane Austen, with "Edit page" circled in red](../sites/sitesfiles/sitepg_edit_public.png)
fr: ![La barre utilisateur pour le site Jane Austen, avec « Modifier la page » entouré en rouge](../sites/sitesfiles/sitepg_edit_public.fr.png)

source: Page blocks
fr: Blocs de page

source: Pages are made up of blocks, each of which has a different form of content.
fr: Les pages sont faites de blocs, chacun d'eux ayant une forme différente de contenu.

source: Allows a user to include files on a page that are not media attached to items (i.e. logos or other illustrative materials). Users may upload new assets or select from existing assets.
fr: Cela permet aux utilisateurs d'intégrer des fichiers à une page qui ne sont pas des médias liés à un contenu (i.e. logos ou autres illustrations). Les utilisateurs peuvent charger de nouveaux fichiers ou utiliser les fichiers existants.

source: ![Asset block with asset selection sidebar open which includes an asset upload option and an asset selection option](sitesfiles/sitepg_asset_selection.png)
fr: ![Bloc Fichier avec le volet de sélection de fichiers ouvert, qui comprend une option pour charger de nouveaux fichiers et une autre pour sélectionner des fichiers](sitesfiles/sitepg_asset_selection.fr.png)

source: Once an asset is selected, the user has the option to include additional asset information:
fr: Une fois le fichier sélectionné, l'utilisateur peut intégrer des informations complémentaires :

source: Page link: allows the user to set a link so that when the asset is clicked by an end-user they are directed to that page.
fr: Le lien de la page : permet de lier le fichier à une page à laquelle l'utilisateur sera mené en cliquant dessus.

source: Alternative link title: allows the user to set a link title. If the link title is unset, the system will default to the file name.
fr: Un titre alternatif pour le lien : permet d'établir un titre de lien. Si ce n'est pas fait, le système indiquera par défaut le nom du fichier.

source: Caption: allows the user to set a caption to print to the page with the asset.
fr: Une légende : permet de saisir une légende qui s'affichera avec le fichier.

source: Click "Apply changes" to set the asset information. Should a user wish to revisit that material, they should click the wrench icon to open the edit sidebar.
fr: Cliquez sur "Appliquer les changements" pour confirmer les informations du fichier. Celui-ci reste modifiable en cliquant sur l'icône de clé anglaise qui apparaît en haut à droite du bloc.

source: ![Asset options sidebar with inputs for page link, alternative link title, and caption](sitesfiles/sitepg_asset_sidebar.png)
fr: ![Volet des options de fichier, avec lien de la page, titre alternatif du lien et légende](sitesfiles/sitepg_asset_sidebar.fr.png)

source: Additionally, the Asset block includes a set of options for controlling the display of the file on the page:
fr: En outre, le bloc Fichier propose des options de contrôle de l'affichage du document sur la page :

source: Class: allows the user to indicate a style class to control the display of the file.
fr: Classe : permet d'indiquer une classe pour gérer l'affichage du fichier.

source: Alignment: allows the user to select the positioning of the file on the page. Options are default, float left, float right, and center.
fr: Alignment : permet de choisir la position du fichier sur la page. Les options sont "par défaut", "flotter à gauche", "flotter à droite" et "centré".

source: Allows you to add a block of items on a site page.
fr: Permet d'ajouter un bloc de contenus dans une page de site.

source: ![Browse Preview block with the query element](../sites/sitesfiles/sitepg_browsepreview_query.png)
fr: ![Bloc Aperçu des ressources avec le volet de recherche ouvert](../sites/sitesfiles/sitepg_browsepreview_query.fr.png)

source: From the **Resource type** dropdown, choose the kind of resource you want to display in the block: Items, Item Sets, or Media.
fr: Depuis la liste déroulante *Type de ressource*, choisissez le type de ressource que vous voulez afficher dans le bloc: Contenus, Collections, ou Médias.

source: Using the **Search query** element interface, select your universe of items.
fr: En utilisant la modification de la **requête de recherche**, sélectionner vos contenus.

source: Click the "Edit" button to reveal the advanced search interface in the drawer. Once you are satisfied with the universe of items in your search, clicking the "Apply" button will set the universe of items for the Browse block.
fr: Cliquez sur le bouton "Modifier" pour faire apparaître le volet contenant l'interface de recherche. Une fois les ensembles de contenus sélectionnés, cliquez sur le bouton "Appliquer".

source: ![Advanced search query drawer](../sites/sitesfiles/sitepg_query_search.png)
fr: ![Tiroir de sélection de contenu](../sites/sitesfiles/sitepg_query_search.fr.png)

source: Once a query has been set, you can click "Edit" to update the universe of items. You can click "Advanced Edit" to directly edit the query string. Finally, you can "Clear" a query to start over. If you have cleared a search in error, you can "Restore" it.
fr: Vous pouvez toujours modifier votre sélection de contenus. Vous pouvez également cliquer sur "Modification avancée" pour modifier directement la chaîne de requête. Enfin, vous pouvez "Retirer" une requête ou la "Restaurer" si vous l'avez retirée par erreur.

source: ![Browse block with the edit query element](../sites/sitesfiles/sitepg_query_update.png)
fr: ![Bloc de recherche avec l'élément de modification de la recherche](../sites/sitesfiles/sitepg_query_update.fr.png)

source: The **Limit** field lets you set the number of resources to display in the block; any additional results from your query can be accessed on a search page linked from the bottom of the block (you set the text of the link in the **Link text** field below).
fr: Le champ *Limite* vous permet de définir le nombre de ressources à afficher dans le bloc ; les autres contenus seront accessibles sur une page de recherche liée au bas du bloc (vous pouvez définir le texte du lien dans le champ **Texte du lien** en dessous).

source: The **Components** field lets you decide what to display in your browse for each resource: the Heading, the Body, and or the Thumbnail. If not set in Site Settings, Heading defaults to resource Title and Body to resource Description.
fr: Le champs **Composants** permet de choisir ce qui sera ou non affiché pour chaque ressource : le Titre, le Corps et/ou la Vignette. S'ils ne sont pas définis dans les paramètres du site, le Titre est par défaut le nom de la ressource et le Corps sa description.

source: The **Preview Title** field sets the heading above the browse section on the page.
fr: Le champ *Titre de l'aperçu* définit le titre de la section aperçu sur la page.

source: The **Link text** field sets the link text at the bottom of the block - the block will only display as many results as you set in the **Limit** field above.
fr: Le champ *Texte du lien* définit le texte du lien en bas du bloc - le bloc affichera au maximum le nombre de résultats que vous avez défini dans le champ **Limite**.

source: Creates an HTML box in which you can add formatted text and links. When you click in the box, a formatting menu will display above the text field.
fr: Crée une boîte HTML dans laquelle vous pouvez ajouter du texte formaté et des liens. Quand vous cliquez dans la boîte, un menu de formatage s'affiche au-dessus du champ texte.

source: Basic block:
fr: Bloc de base :

source: ![Page block for HTML content](../sites/sitesfiles/sitepg_html.png)
fr: ![Bloc de page pour du contenu HTML](../sites/sitesfiles/sitepg_html.fr.png)

source: With formatting menu open:
fr: Avec le menu de formatage ouvert :

source: ![Page block for HTML content with active field, showing formatting menu](../sites/sitesfiles/sitepg_html2.png)
fr: ![Bloc de page pour du contenu HTML avec le champ actif, montrant le menu de formatage](../sites/sitesfiles/sitepg_html2.fr.png)

source: You can embed content from elsewhere on the internet using iFrames or other embed codes in the HTML block.
fr: Vous pouvez intégrer du contenu depuis n'importe où sur internet en utilisant des iframes ou d'autres codes d'intégrations dans le bloc HTML.

source: Click into the HTML block content area to show the formatting menu and then click on the button labeled "Source". ![HTML block with formatting menu open. A red arrow points to the Source button](../sites/sitesfiles/sitepg_htmlSource1.png)
fr: Cliquez dans la zone de contenu du bloc HTML pour afficher le menu de formatage puis cliquez sur le bouton libellé « Source ». ![Bloc HTML avec le menu de formatage ouvert. Une flèche rouge pointe vers le bouton Source](../sites/sitesfiles/sitepg_htmlSource1.fr.png)

source: This will open a dialog box where you can write HTML content.
fr: Cette action ouvre une boîte de dialogue où vous pouvez écrire du contenu HTML.

source: Copy and paste the embed code into the source code editor. ![Source box open with a short paragraph of text and an iframe from Vimeo](../sites/sitesfiles/sitepg_htmlSource2.png)
fr: Copiez et collez le code d'intégration dans l'éditeur de code source. ![La boîte de source ouverte avec un court paragraphe de texte et une iframe venant de Vimeo](../sites/sitesfiles/sitepg_htmlSource2.fr.png)

source: Click the green "OK" button at the bottom of the editor.
fr: Cliquez sur le bouton vert "OK" en bas de l'éditeur.

source: Your embed should show up in the HTML block either as a gray rectangle or as the embedded content. ![HTML block showing the text and an embedded video](../sites/sitesfiles/sitepg_htmlSource3.png)
fr: Votre code d'intégration devrait s'afficher dans le bloc HTML soit comme un rectangle gris soit comme le contenu intégré. ![Bloc HTML montrant le texte et une vidéo intégrée](../sites/sitesfiles/sitepg_htmlSource3.fr.png)

source: Finally, you can assign a **Class** to the HTML block for styling by your theme. If you do not assign a class, your HTML contents will show up without a wrapping `div` or other container. If you do assign a class, your HTML entry will appear inside a `<div class="[your class here]">` container.
fr: Enfin, vous pouvez choisir une **Classe** pour le bloc HTML déterminant sa mise en forme selon votre thème. Si vous n'assignez pas de classe, vos contenus HTML s'affichent sans conteneur 'div' ou autre. Si vous assignez une classe, le contenu apparaît dans un conteneur '<div class="[votre classe]">'.

source: A list of items.
fr: Une liste de contenus.

source: In item showcase blocks, multiple attachments build horizontally, creating rows across the page.
fr: Dans les blocs vitrine de contenus, les pièces jointes s'empilent de manière horizontale, ce qui crée des lignes sur la page.

source: ![Block for item showcase with one item added](../sites/sitesfiles/sitepg_showcase.png)
fr: ![Bloc pour une vitrine de contenus avec un contenu ajouté](../sites/sitesfiles/sitepg_showcase.fr.png)
