Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/site_theme.po
Languages: fr

source: Theme Selection
fr: Sélection du thème

source: The Theme section of the Site menu allows you to select the theme for your site, and to set theme-specific settings.
fr: L'onglet thème du menu contextuel du site vous permet de sélectionner le thème de votre site, et d'en définir les paramètres spécifiques.

source: Install a theme
fr: Installer un thème

source: In order to appear on the **Themes** page for sites, themes must be manually added to the `/themes` folder of the installation, using an FTP program or an SSH connection.
fr: Pour apparaître dans l'onglet *Thèmes* des sites, les thèmes doivent être manuellement ajoutés au dossier `themes` de l'installation, en utilisant un programme FTP ou une connexion SSH.

source: To add a theme to the site using FTP:
fr: Pour ajouter un thème au site en utilisant FTP :

source: Download the zipped theme to your computer.
fr: Téléchargez le thème zippé sur votre ordinateur.

source: Open your FTP client, log on to the server that houses the Omeka S install and navigate to the `/themes` folder (this should be located in the main folder of the install).
fr: Ouvrez votre client FTP, connectez-vous au serveur qui héberge l'installation Omeka S et naviguez vers le dossier `/themes` (il doit être situé dans le dossier principal de l'installation).

source: Upload the zipped theme to the `/themes` folder .
fr: Téléchargez le thème zippé dans le dossier `/themes`.

source: Unzip the theme.
fr: Dézippez le thème.

source: You can also use git to clone a theme directly from the git repository. Do this only if you are comfortable with git.
fr: Vous pouvez aussi utiliser git pour cloner un thème directement depuis le dépôt. Faites cela uniquement si vous êtes à l'aise avec git.

source: Select a theme
fr: Sélectionner un thème

source: When you navigate to the Theme screen, the currently active theme will appear on the top of the page. If you did not select a theme when adding the site, this will be the Default theme.
fr: Quand vous naviguez vers l'onglet Thème, le thème actif apparaîtra en haut de la page. Si vous n'aviez pas sélectionné de thème à la création du site, ce sera le thème par défaut.

source: A large image of the active theme appears on the left, with the theme title, version, creator, and a button to "Edit theme settings" on the right.
fr: Une grande image du thème actif apparaît sur la gauche, avec le titre du thème, le créateur, et un bouton pour les paramètres du thème sur la droite.

source: ![Theme tab with Center Row as the current theme](../sites/sitesfiles/sitetheme_tab.png)
fr: ![Onglet thème avec Center Row comme thème actuel](../sites/sitesfiles/sitetheme_tab.fr.png)

source: Below the current theme are tiles for all other installed themes. The tiles have a small image of the theme in action, the theme name and version, and a link to the creator of the theme.
fr: Sous le thème actuel se trouvent des boutons pour tous les autres thèmes installés. Les boutons ont une petite image du thème, le nom du thème et un lien vers le créateur du thème.

source: To switch themes, click on the theme which you want to use. It will highlight slightly in gray, with a checkbox in the lower right-hand corner of the theme tile.
fr: Pour changer de thème, cliquez sur le thème souhaité. Il devrait être légèrement mis en évidence en gris, avec une coche dans le coin inférieur droit du bouton du thème.

source: ![A selected theme showing the highlight and checkmark](../sites/sitesfiles/sites_themeselect.png)
fr: ![Un thème sélectionné montrant la mise en évidence et la case cochée](../sites/sitesfiles/sites_themeselect.fr.png)

source: Click the "Save" button in the upper right-hand corner of the window to save changes. Click the "Cancel" button to leave without saving your changes.
fr: Cliquez sur le bouton "Enregistrer" dans le coin supérieur droit de la fenêtre pour sauvegarder les modifications. Cliquez sur le bouton "Annuler" pour partir sans enregistrer les modifications.

source: Theme settings
fr: Paramètres du thème

source: Theme settings allow you to customize aspects of the site's theme, such as adding a logo to the top or writing footer text.
fr: Les paramètres du thème vous permettent de personnaliser l'aspect du thème du site, par exemple en ajoutant un logo, ou en rédigeant un texte de pied de page.

source: To edit the settings of your selected theme, click on the button labeled "Edit theme settings" to the right of the current theme thumbnail.
fr: Pour modifier les paramètres de votre thème sélectionné, cliquez sur le bouton libellé "Modifier les paramètres du thème" à droite de la vignette du thème actuel.

source: Note that your settings for a specific theme on a site will be saved when you change themes. For example, if you customized the footer for the default theme, then switched to using The Daily for a while, then switched back to the default theme, your custom footer would still be there.
fr: Notez que vos paramètres pour un thème spécifique sur un site seront conservés même si vous changez de thème. Par exemple, si vous aviez personnalisé le pied de page du thème par défaut, puis changé pour le thème The Daily, puis de nouveau pour le thème par défaut, votre pied de page personnalisé sera toujours là.

source: Settings options
fr: Options de paramétrage

source: Depending on which theme you have selected, you may see any of the following setting options:
fr: Selon le thème que vous avez sélectionné, vous pouvez voir certaines des options suivantes :

source: (All themes)
fr: (Tous les thèmes)

source: Upload a asset (file) to function as a logo in the header of your site. Allowed file types are: jpg, gif, png, svg, and svgz.
fr: Téléchargez une ressource (un fichier) comme logo dans l'en-tête de votre site. Les types de fichiers autorisés sont : jpg, gif, png, svg, et svgz.

source: This asset is not associated with any of the items, and will be stored separately; once uploaded to a site you will be able to select it again without re-uploading even if you change themes for a while. Any asset uploaded to one site will be available for all sites on the installation.
fr: Cette ressource n'est associée à aucun des contenus, et sera stockée séparément ; une fois téléchargée pour un site vous pourrez le sélectionner à nouveau sans la re-télécharger, même si vous changez de thème. Toutes les ressources téléchargées pour un site seront disponibles pour tous les sites de l'instance.

source: ![Logo option](../sites/sitesfiles/sitetheme_logo.png)
fr: ![Option Logo](../sites/sitesfiles/sitetheme_logo.fr.png)

source: To upload a logo, click the "Select" button. This will open a sidebar where you can either upload a new file from your computer or choose from assets already uploaded to the installation.
fr: Pour télécharger un logo, cliquez sur le bouton Sélectionner. Cette action ouvre une barre latérale où vous pouvez soit télécharger un nouveau fichier depuis votre ordinateur, soit choisir parmi les ressources déjà téléchargées.

source: ![Logo option with sidebar open](../sites/sitesfiles/sitetheme_logo2.png)
fr: ![Option Logo avec la barre latérale ouverte](../sites/sitesfiles/sitetheme_logo2.fr.png)

source: Note that the logo completely replaces the header, including the site title, for the site, so you may want to consider an image with text if it is important to you that users see the site title.
fr: Notez que le logo remplace complètement l'en-tête, y compris le titre du site, pour le site, donc envisagez une image avec du texte si vous souhaitez que les utilisateurs voient le titre du site.

source: To remove a logo, click the "Clear" button in that block (only visible when a logo is active) and save changes.
fr: Pour supprimer un logo, cliquez sur le bouton "Retirer" dans ce bloc (visible uniquement si un logo est actif) et enregistrer les changements.

source: Footer content
fr: Contenu de pied de page

source: A text field in which you can enter content to appear in the footer of the site.
fr: Un champ texte dans lequel vous pouvez saisir du contenu qui apparaîtra dans le pied de page du site.

source: ![footer text field with prompt visible](../sites/sitesfiles/sitetheme_footer.png)
fr: ![champ de texte de pied de page avec l'invite visible](../sites/sitesfiles/sitetheme_footer.fr.png)

source: By default the message is "Powered by Omeka S."
fr: Par défaut le message est "Powered by Omeka S".

source: You can add HTML formatting to the text by manually adding the tags.
fr: Vous pouvez ajouter du formatage HTML au texte en ajoutant manuellement des tags.

source: Top Navigation Depth
fr: Profondeur de la navigation du haut

source: (Default, Cozy, Foundation)
fr: (Défaut, Cozy, Foundation)

source: Top Navigation Depth allows you the limit the depth of the top navigation menu on the public side of the site. The default setting, 0, does not restrict the number of levels of the top navigation menu. Setting it to one would only show the top-level pages or links of your site.
fr: La profondeur de la navigation du haut vous permet de limiter la profondeur du menu de navigation du haut de la partie publique du site. La valeur par défaut, 0, ne limite pas le nombre de niveaux du menu de navigation du haut. Le définir à un montrerait uniquement les pages ou liens de premier niveau de votre site.

source: ![Theme settings with Top Navigation depth at 0](../sites/sitesfiles/sitetheme_depth.png)
fr: ![Paramètres du thème avec la profondeur de la navigation du haut à 0](../sites/sitesfiles/sitetheme_depth.fr.png)

source: Color Selection
fr: Sélection de la couleur

source: (Default, Cozy, The Daily)
fr: (Défaut, Cozy, The Daily)

source: The themes Default, Cozy, and The Daily include an option to enter values for the *main accent color*; Cozy also has an option for the *navigation background color*.
fr: Les thèmes Défaut, Cozy, et The Daily incluent une option pour saisir des valeurs pour la *couleur d'emphase principale* ; Cozy a aussi une option pour la *couleur d'arrière-plan de la navigation*.

source: ![color option fields](../sites/sitesfiles/sitetheme_color.png)
fr: ![champs d'options de couleur](../sites/sitesfiles/sitetheme_color.fr.png)

source: The Main Accent color is used for link text and on-hover colors, as in the image below:
fr: La couleur d'emphase principale est utilisée pour les liens texte et les couleurs de survol, comme dans l'image ci-dessous :

source: ![arrow points to instances of main accent color in use](../sites/sitesfiles/sitetheme_mainaccent.png)
fr: ![une flèche pointe vers les instances de la couleur d'emphase principale en action](../sites/sitesfiles/sitetheme_mainaccent.fr.png)

source: The navigation background color sets the color of the navigation sidebar for the theme.
fr: La couleur d'arrière plan de la navigation définit la couleur de la barre latérale de navigation pour le thème.

source: ![arrow points to sidebar](../sites/sitesfiles/sitetheme_navcolor.png)
fr: ![une flèche pointe vers la barre latérale](../sites/sitesfiles/sitetheme_navcolor.fr.png)

source: Edit either field by typing a color value into the field. Either a triplet or a six-character hexadecimal code will work. Once you have entered a valid value, the color bar on the left will automatically update to show the color entered, even without saving changes.
fr: Modifiez le champ en saisissant une [valeur de couleur](https://en.wikipedia.org/wiki/Web_colors) : soit un triplet soit un code hexadécimal. Une fois que vous avez saisi une valeur valide, la barre de couleur sur la gauche sera automatiquement mise à jour pour afficher la couleur saisie, même sans enregistrer les changements.

source: The default values are stored in the prompt text for the field. For the Cozy theme, the default values are: the main accent color is `087b94` and the navigation background color is `bfdcdc`.
fr: Les valeurs par défaut sont stockées dans le texte d'invite du champ. Pour le thème Cozy, les valeurs par défaut sont : la couleur d'emphase principale est `087b94` et la couleur d'arrière-plan de navigation est `bfdcdc`.

source: Layout for browse pages
fr: Disposition des pages de navigation

source: Select how to display items within their browse views.
fr: Sélectionnez comment afficher les contenus à l'intérieur des vues de liste.

source: **Grid**: Items are organized into rows and columns. This is recommended for items that prominently feature images.
fr: **Grille** : Les contenus sont organisés en lignes et colonnes. Recommandé pour les contenus qui présentent des images.

source: **List**: Items are stacked into a single column.
fr: **Liste** : Les contenus sont empilés en une seule colonne.

source: **Toggle (default: grid)**: Site visitors can choose to display the browse views as grids or lists, with grids as the default.
fr: **Bouton (défaut: grille) :** Les visiteurs du site peuvent choisir d'afficher les vues en grille ou en liste, les grilles constituant la vue par défaut.

source: **Toggle (default: list)**: Site visitors can choose to display the browse views as grids or lists, with lists as the default.
fr: **Bouton (défaut: liste) :** Les visiteurs du site peuvent choisir d'afficher les vues liste en grille ou en liste, les listes constituant la vue par défaut.

source: Foundation theme settings
fr: Paramètres du thème Foundation

source: Foundation is a theme that comes with a few default stylesheets for fast prototyping or getting started with modifying themes. As a result, it has some unique settings. For more information on using Foundation, including working with Sass, see the [theme ReadMe file](https://github.com/omeka-s-themes/foundation-s/blob/master/README.md).
fr: Foundation est un thème qui vient avec quelques feuilles de style par défaut pour un prototypage rapide ou pour débuter avec la modification de thèmes. Par conséquent, il a des paramètres uniques. Pour plus d'informations sur l'utilisation de Foundation, y compris l'utilisation de Sass, voir le [fichier Readme du thème](https://github.com/omeka-s-themes/foundation-s/blob/master/README.md).

source: Settings not described above:
fr: Paramètres non décrits ci-dessus :

source: **Stylesheet:** The theme provides 4 style options. * **Default** uses ZURB Foundation's default styles for prototyping, which are all viewable in their documentation under the [Kitchen Sink](https://get.foundation/sites/docs/kitchen-sink.html). * **Revolution** aims to capture the feel of old documents and juxtaposes it with a bright red accent. It includes a textured paper background image. * **Sea Foam** offers a clean, friendly look with a teal palette. * **Inkwell** features a high contrast serif family for its typography, as well as sunny yellow accents.
fr: **Feuille de style :** Le thème propose 4 options de style. * **Défaut*** utilise les styles par défaut de ZURB Foundation, tous visibles dans leur documentation sous [Kitchen Sink](https://get.foundation/sites/docs/kitchen-sink.html). * **Revolution** reproduit l'effet de documents anciens avec des accents rouge vif. * **Sea Foam** offre une palette bleu sarcelle, propre et accueillante. * **Inkwell** propose une typographie serif contrastée et des accents jaunes.

source: **Navigation layouts:** Global navigation can display as a **horizontal top bar with optional dropdown menus** or a **left vertical column**.
fr: **Dispositions de la navigation :** La navigation globale peut être affichée comme une **barre haute horizontale avec des menus déroulants optionnels** ou comme une **colonne verticale gauche**.

source: **Show Top Navigation Child Pages:** Toggle display of child pages within the main navigation. If unchecked, only the top-level navigation will display.
fr: **Afficher les pages enfant de la navigation supérieure :** Active l'affichage des pages enfants dans la navigation principale. Si non cochée, seule la navigation de premier niveau sera affichée.

source: **Layout for Show Pages:** Resource metadata can show display as **stacked** with properties as headings above their values, or **inline** with properties as headings inline with their values.
fr: **Disposition pour les pages de ressources :** Les métadonnées de ressources peuvent être affichées **empilées** avec des propriétés comme les titres au-dessus de leur valeurs, ou **en ligne** avec des propriétés comme les titres alignées avec leurs valeurs.

source: **Truncate Body Property:** Set how much of the browse body property displays on the browse page. You can:
fr: **Tronquer la propriété de corps :** Définit quelle portion de la propriété de corps est affichée sur la page de liste. Vous pouvez :

source: **Show full value** which displays all of the property text.
fr: **Afficher la valeur complète** qui affiche tout le texte de la propriété.

source: **Show 4 lines and fade out** which displays 4 lines of text with a fade at the end of the text block.
fr: **Afficher 4 lignes et s'estomper** qui affiche 4 lignes de texte avec un fondu à la fin du bloc de texte.

source: **Show 4 lines and ellipsis** which displays 4 lines of text concluding with an ellipsis (...).
fr: **Afficher 4 lignes et des points de suspension** qui affiche 4 lignes de texte finissant par une ellipse (...).
