Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/site_settings.po
Languages: fr

source: Site Admin
fr: Administration de site

source: The Site Admin page allows you to manage the main settings for the site on which you are working. Changes will only be applied to this site and will not change other sites' settings.
fr: La page d'administration de site vous permet de gérer les paramètres principaux du [site](../sites/index.md) sur lequel vous travaillez. Les modifications seront uniquement appliquées à ce site et ne modifieront pas les paramètres des autres sites.

source: In the left-hand navigation, once you have select a site from the Sites page, it is the first link under the site title, represented with a gear icon.
fr: C'est le premier onglet sous le titre du site, représenté par une icône d'engrenage.

source: The Site Admin page has two tabs: Info and Settings.
fr: La page d'administration du site a deux onglets, Info et Paramètres.

source: The site info settings for an Omeka S site are where you can change the basic info for the site - the same information you entered when you created the site. You can change the:
fr: Les paramètres d'informations pour un site Omeka S sont l'endroit où vous pouvez modifier les informations basiques du site - les mêmes informations que vous saisissez à la création d'un site. Vous pouvez changer :

source: In the upper right hand corner of the window on this tab, you can use buttons to:
fr: Dans le coin supérieur droit de la fenêtre de cet onglet, vous pouvez utiliser les boutons pour :

source: Set your site as public or private using the eye icon
fr: Rendre votre site public ou privé en utilisant l'icône d’œil (voir ci-dessous)

source: Delete the site
fr: *supprimer* le site

source: Cancel making changes
fr: *annuler* les modification et

source: Save your changes.
fr: *Enregistrer* les modifications.

source: The **make public/private** button (eye icon) is used to both indicate and set whether the site is visible to the public or only to users of this Omeka S installation.
fr: Le bouton **rendre public/privé** (icône d’œil) est utilisé à la fois pour indiquer et modifier si le site est visible publiquement ou uniquement par les utilisateurs de cette installation Omeka S.

source: Site is public: ![make public button showing an eye icon](../content/contentfiles/item_public.png){style="display:inline;"}
fr: Le site est public : ![icône d'oeil ouvert](../content/contentfiles/item_public.fr.png){style="display:inline;"}

source: Site is private: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png){style="display:inline;"}
fr: Le site est public: ![icône d’œil barré](../content/contentfiles/item_private.fr.png)

source: Settings
fr: Paramètres

source: To implement any changes you make, click "Save" at the top right of the browser window when you are done. To leave without saving changes, click "Cancel".
fr: Pour mettre en œuvre les changements réalisés, cliquez sur "Enregistrer" dans le coin supérieur droit de la fenêtre du navigateur. Pour partir sans enregistrer les changements, cliquez sur "Annuler".

source: General settings
fr: Paramètres généraux

source: ![general settings, all at default](../sites/sitesfiles/sites_settingsgen.png)
fr: ![paramètres généraux, tous à leur valeur par défaut](../sites/sitesfiles/sites_settingsgen.fr.png)

source: **Attachment link type**: sets the target of links from attachments you add to [site page blocks](../sites/site_pages.md#page-blocks) (for example, in an [item showcase](../sites/site_pages.md#item-showcase)). It offers a dropdown with the following options:
fr: **Type d'affichage pour le média** : définit la cible des liens des pièces jointes que vous ajoutez au [blocs de page de site](site_pages.md#page-blocks) (par example, dans une [vitrine de contenus](site_pages.md#item-showcase). Il propose une liste déroulante avec les options suivantes :

source: Item page: clicking on the attachment takes users to the item page associated with the attached media.
fr: Page de contenu : cliquer sur la pièce jointe emmène l'utilisateur vers la page du contenu associé au média joint.

source: Media page: clicking on the attachment takes users to the media page.
fr: Page de média : cliquer sur la pièce jointe emmène l'utilisateur vers la page de média.

source: Direct link to file: clicking on the attachment takes user to the file alone.
fr: Lien direct au fichier : cliquer sur la pièce jointe emmène l'utilisateur vers le fichier.

source: **Embed media on item pages**: when checked, any linked media (such as videos) will be embedded on the item pages. When unchecked, site visitors will click through to view playable media.
fr: **Intégrer les médias sur les pages de contenu** : une case à cocher. Si cochée, tous les médias liés (tels que des vidéos) seront intégrés dans les pages de contenu. Si non cochée, les visiteurs du site cliqueront dessus pour voir le média.

source: **Show page pagination**: when checked, "Previous" and "Next" links will display at the bottom of every page in the site, proceeding through your navigation. If unchecked, these links will not display.
fr: **Afficher la pagination** : une case à cocher. Si cochée, des liens "Précédent" et "Suivant" s'affichent en bas de chaque page de site.

source: **Show user bar on public views**: sets whether there is a bar across the top of public site pages which allow users to access the admin side of the site.
fr: **Montrer la barre utilisateur sur les pages publiques** : détermine si il y a une barre au-dessus des pages du site public qui permet aux utilisateurs d'accéder à la partie administration du site.

source: When users are logged in, the user bar has the following options:
fr: Quand les utilisateurs sont authentifiés, la barre utilisateur présente les options suivantes :

source: Installation Title: takes you back to the installation admin.
fr: Titre de l'installation : vous amène vers l'administration de l'installation.

source: Site Title: takes you back to the landing page for managing the site (site/show).
fr: Titre du site : vous amène à la page principale de gestion du site (site/show).

source: Resource view: depending on what you are viewing, this is a link to the admin side management for [Pages](../sites/site_pages.md), [Items](../content/items.md), or [Item Sets](../content/item-sets.md).
fr: Vue ressource : selon ce que vous êtes en train de visualiser, vous trouverez un lien vers la partie administration pour les [pages](site_pages), les [contenus](../content/items), ou les [collections](../content/item-sets)

source: Edit link for that page, item set, or item.
fr: Lien de modification pour cette page, cette collection, ou ce contenu.

source: User's display name: takes you to your user page.
fr: Nom d'affichage de l'utilisateur : vous amène vers la page utilisateur.

source: Logout: logs out current user.
fr: Déconnexion : déconnecte l'utilisateur actuel.

source: ![a blue bar across the top of the image displays the following words in light blue text, indicating a link: Stackable Sandbox, Jane Austen, Pages, Edit Page, Signed in as Megan, and a button to Logout.](../sites/sitesfiles/sites_userbarin.png)
fr: ![une barre bleue en haut de l'image affiche les mots suivants en bleu clair, indiquant un lien: Omeka S, Gymnastique artistique, Pages, Modifier la page, Connecté en tant que Megan, et un bouton pour se déconnecter.](../sites/sitesfiles/sites_userbarin.fr.png)

source: When users are not logged, the user bar only displays a login option.
fr: Quand les utilisateurs ne sont pas authentifiés, la barre utilisateur affiche uniquement une option de connexion.

source: ![A blue bar across the top of the image only has a small button reading "Log In". Below this, the site's title "A Tin Box" is displayed in black text on a white background.](../sites/sitesfiles/sites_userbarout.png)
fr: ![Une barre bleue en haut de l'image a seulement un petit bouton intitulé "Se connecter". En dessous, le titre du site « Gymnastique artistique » est affiché sur un fond blanc.](../sites/sitesfiles/sites_userbarout.fr.png)

source: The options for this setting are:
fr: Les options pour ce paramètre sont :

source: Never
fr: Jamais

source: When identified (when logged in)
fr: Si identifié (si connecté)

source: Always.
fr: Toujours.

source: **Disable JSON-LD embed**: Check this box to disable JSON-LD embedding on resource browse and show pages.
fr: **Désactiver la diffusion intégrée des ressources en JSON-LD** : Cochez cette case pour désactiver l'intégration de JSON-LD sur les pages de ressources.

source: Language
fr: Langue

source: ![browse settings, all empty](../sites/sitesfiles/sites_settingsbrowse.png)
fr: ![paramètres de consultation, tous vides](../sites/sitesfiles/sites_settingsbrowse.fr.png)

source: **Restrict browse to attached items** is a checkbox. If checked, the Browse functions of your site will only show items which have been added to a page block. If unchecked, browse pages and blocks on your site will include all items in the Item Pool.
fr: **Limiter la navigation aux contenus attachés à des pages** est une case à cocher. Si cochée, les fonctions de consultation de votre site montreront uniquement les contenus qui ont été ajoutés à un bloc de page. Si non cochée, les pages de consultation et les blocs sur votre site incluront tous les contenus du réservoir de contenus.

source: **Results per page** sets the number of results per page on browse pages by entering a number. If left blank, the site will use the default from the [global settings](../admin/settings.md).
fr: **Résultats par page** définit le nombre de résultats par page sur les pages. Si laissé vide, le site utilisera la valeur par défaut définit dans les [paramètres généraux](../admin/settings).

source: Depending on the [site theme](../sites/site_theme.md), you may want to make this a multiple of 4 for a more elegant display. Note that using very large numbers (50, 75, 100) may cause browse pages to load slowly.
fr: En fonction du [thème du site](../sites/site_theme), vous voudrez peut-être indiquer un multiple de 4 pour un affichage plus élégant. Notez qu'utiliser de très grands nombres (50, 75, 100) peut provoquer des lenteurs au chargement des pages.

source: **Browse heading property** sets which property to use as the heading for each resource on a browse page. By default, this is Dublin Core: Title. The dropdown allows you to select from all available vocabularies, and includes a search bar to quickly find the desired property.
fr: **Propriété définissant le titre, dans les listes** détermine quelle propriété sera utilisé comme titre pour chaque ressource sur une page de parcours. Par défaut, c'est Dublin Core: Title. La liste déroulante vous permet de sélectionner parmi tous les vocabulaires disponibles, et contient une barre de recherche pour trouver rapidement la propriété voulue.

source: ![The browse heading property option is open. The current selection, Dublin Core: Title, is at the top. Immediately below it is a search bar, indicated by a magnifying glass symbol. Below that are some properties from the the friend of a friend vocabulary.](../sites/sitesfiles/sites_setbrowseprop.png)
fr: ![L'option de propriété pour le titre est ouverte. La sélection actuelle, Dublin Core: Title, est en haut. Immédiatement en dessous se trouve la barre de recherche, indiquée par un symbole de loupe. Sous celle-ci se trouvent certaines propriétés du vocabulaire « friend of a friend ».](../sites/sitesfiles/sites_setbrowseprop.fr.png)

source: **Browse body property** sets which property to use as the body text for each resource on a browse page. By default, this is Dublin Core: Description. The dropdown allows you to select from all available vocabularies, and includes a search bar to quickly find the desired property.
fr: **Propriété définissant le corps, dans les listes** détermine quelle propriété sera utilisée comme corps de texte pour chaque ressource sur une page de liste. Par défaut, c'est Dublin Core: Description. La liste déroulante vous permet de sélectionner parmi tous les vocabulaires disponibles, et contient une barre de recherche pour trouver rapidement la propriété voulue.

source: Show
fr: Afficher

source: Search
fr: Recherche

source: ![search settings, all empty](../sites/sitesfiles/sites_settingssearch.png)
fr: ![Paramètres de recherche, tous vides](../sites/sitesfiles/sites_settingssearch.fr.png)

source: **Search type** is a dropdown which allows you to set from which site(s) the search bar generates results:
fr: **Type de recherche** est une liste déroulante qui vous permet de définir pour quel(s) site(s) la barre de recherche génère des résultats :

source: This site: only return results from this site.
fr: Ce site : retourne uniquement des résultats depuis ce site.

source: All sites: return results for all sites on the installation.
fr: Tous les sites : retourne des résultats pour tous les sites de l'installation.

source: **Search resources** is a series of checkboxes which let you select which types of resources are searched from the main search field on the site. Select from: site pages, items, and item sets. You can select all if you want.
fr: **Rechercher les ressources** est une série de cases à cocher qui vous permet de sélectionner quels types de ressources sont recherchées depuis le champ de recherche principal sur le site. Sélectionnez parmi : pages de site, contenus et collections. Vous pouvez tous les sélectionner si souhaité.

source: **Templates** allows you to limit the properties for advanced item or item set search to only properties included in a template or templates. When this field is empty, the "Search by Value" on the advanced search will display all properties from all vocabularies in the Omeka S installation. Applying a template not only limits the options in the dropdown, it also includes your alternate labels for properties:
fr: **Modèles** vous permet de limiter les propriétés pour la recherche avancée de contenus ou de collections aux propriétés incluses dans un ou plusieurs modèles. Si ce champ est vide, la « Recherche par Valeur » de la recherche avancée affichera toutes les propriétés de tous les vocabulaires de l'installation Omeka S. Appliquer un modèle non seulement limite les options de la liste déroulante, mais inclut aussi vos libellés alternatifs pour les propriétés :

source: Click in the field to add a template; you can add more than one template by clicking in the field again.
fr: Cliquez dans le champ pour ajouter un modèle ; vous pouvez ajouter plusieurs modèles en cliquant à nouveau dans le champ.

source: **Restrict to templates** will restrict search results to only those items which are using the selected templates.
fr: **Restreindre aux modèles de ressource** restreindra les résultats de recherche aux contenus utilisant les modèles sélectionnés.
