Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/site_pages.po
Languages: fr

source: Using the drop-down menu in the block, you can:
fr: En utilisant le menu déroulant dans le bloc, vous pouvez :

source: Set the thumbnail size for these items as large (default), medium, or square.
fr: Définir la taille de vignette pour ces images entre grand (par défaut), moyen, ou carré.

source: Set the attachment title as:
fr: Définir le titre de la pièce jointe :

source: item title (title of the attached item);
fr: le titre du contenu (le titre du contenu attaché) ;

source: media title (title of the specific piece of media you select associated with the item); or
fr: le titre du media (le titre du media spécifique que vous sélectionnez pour être associé au contenu) ; ou

source: no title.
fr: aucun titre.

source: Click the "Add Attachment" button to add an item to the block. This will open a drawer on the right side of the page to browse and select items.
fr: Cliquez sur le bouton "Ajouter une pièce jointe" pour ajouter un contenu au bloc. Cela ouvrira un tiroir sur le côté droit de la page pour parcourir et sélectionner des contenus.

source: If you have a large number of items to navigate, or multiple items with the same title, you can use the "Filter search" options by clicking the triangle button to the right of its label.
fr: Si vous avez un grand nombre de contenus à parcourir, ou plusieurs contenus avec le même titre, vous pouvez utiliser les options du « Filtre de recherche » en cliquant le bouton triangulaire sur la droite.

source: These options are:
fr: Ces options sont :

source: Filter by class: opens a dropdown to select from all of the classes for the vocabularies in the Omeka S installation.
fr: Filtrer par classe : ouvre une liste déroulante pour sélectionner parmi toutes les classes des vocabulaires de l'installation Omeka S.

source: Filter by item set: opens a dropdown to select from all item sets in the installation, not just those associated with the site on which you are working.
fr: Filtrer par collection : ouvre une liste déroulante pour sélectionner parmi toutes les collections de l'installation, pas seulement celles associées au site concerné.

source: Filter by item id: you can put in the specific item id for an item (the number which appears in the url when you are looking at the item on the admin).
fr: Filtrer par identifiant de contenu : vous pouvez saisir un identifiant de contenu spécifique (le numéro qui apparaît dans l'URL quand vous regardez le contenu depuis l'administration).

source: Once you have applied your changes to the filter, you must click the search button (magnifying glass) to apply the filters or run the search.
fr: Une fois que vous avez appliqué vos modifications au filtre, vous devez cliquer sur le bouton de recherche (loupe) pour appliquer les filtres ou lancer la rechercher.

source: ![Select item drawer with filter options displayed](../sites/sitesfiles/sitepg_selectitemFilter.png)
fr: ![Tiroir de sélection de contenu avec les options de filtre affichées](../sites/sitesfiles/sitepg_selectitemFilter.fr.png)

source: Once you’ve selected an item, the drawer will shift to that item’s information. You can add a caption and select which media (if more than one) you want to use. To return to the list of items, click the "Select item" button at the top of the drawer. To use the item displayed and apply the caption, etc, click the "Apply changes" button at the bottom of the drawer.
fr: Une fois que vous avez sélectionné un contenu, le tiroir va basculer vers les informations de ce contenu. Vous pouvez ajouter une légende et sélectionner quel média (s'il y en a plusieurs) vous voulez utiliser. Pour revenir à la liste des contenus, cliquez sur le bouton "Changer le contenu" en haut du tiroir. Pour utiliser le contenu affiché et appliquer la légende, etc., cliquez sur le bouton "Appliquer les changements" en bas du tiroir.

source: ![Item view with apply changes option](../sites/sitesfiles/sitepg_applyitem.png)
fr: ![Vue de contenu avec l'option appliquer les changements](../sites/sitesfiles/sitepg_applyitem.fr.png)

source: To add multiple items at once, click the "Quick add" slider just above the list of items in the right hand drawer. This will add a checkbox to the left of each item. Check the boxes of those items you want to add to the block, then click the "Add selected" button at the bottom of the drawer.
fr: Pour ajouter plusieurs contenus en même temps, cliquez sur le curseur « ajout rapide » au-dessus de la liste des contenus dans le tiroir de droite. Cela ajoutera une case à cocher à la gauche de chaque contenu. Cochez les cases des contenus que vous voulez ajouter au bloc, puis cliquez sur le bouton « Ajouter la sélection » en bas du tiroir.

source: ![Select item drawer with quick add activated - every item in the view now has a checkbox.](../sites/sitesfiles/sitepg_selectitemQuick.png)
fr: ![Tiroir de sélection de contenu avec l'ajout rapide activé - chaque contenu dans la vue a maintenant une case à cocher.](../sites/sitesfiles/sitepg_selectitemQuick.fr.png)

source: To cancel the item selection, click the X in the upper right corner of the drawer at any time.
fr: Pour annuler la sélection du contenu, cliquez sur le X dans le coin supérieur droit du tiroir à n'importe quel moment.

source: Once you’ve added an item, it will appear in the Item List block. You can edit the caption or media options by clicking the edit (wrench) button for that row, and you can delete the item using the delete (trash can) icon.
fr: Une fois que vous avez ajouté un contenu, il apparaîtra dans le bloc Pièces jointes. Vous pouvez modifier la légende ou les options de média en cliquant sur le bouton modifier (clé à molette) pour cette ligne, et vous pouvez supprimer le contenu en utilisant l'icône supprimer (poubelle).

source: You can add multiple items to the list.
fr: Vous pouvez ajouter plusieurs contenus à la liste.

source: This block displays an item along with all associated metadata (entered when creating or editing the [item](../content/items.md)).
fr: Ce bloc affiche un contenu avec ses métadonnées associées (saisie à la création ou modification du [contenu](../content/items.md)).

source: Add attachments in the same manner as the [media embed](../sites/site_pages.md#media-embed) page block.
fr: Ajoutez des pièces jointes de la même manière que pour le bloc [media](#media-embed).

source: ![Item with metadata block with nothing attached](../sites/sitesfiles/sitepg_iwm.png)
fr: ![Bloc Contenu avec métadonnées et aucune pièce jointe](../sites/sitesfiles/sitepg_iwm.fr.png)

source: Line break creates a transparent or opaque line break on the page, clearing all blocks. Select whether the line is transparent or opaque from the dropdown.
fr: Le bloc saut de ligne crée un saut de ligne transparent ou opaque sur la page. Choisissez si la ligne doit être transparente ou opaque depuis la liste déroulante.

source: ![line break table, dropdown selected to transparent](../sites/sitesfiles/sitepg_line.png)
fr: ![tableau saut de ligne, liste déroulante définie à transparent](../sites/sitesfiles/sitepg_line.fr.png)

source: HTML blocks wrap around Media blocks and at times you may want to clear the page. You might also want to create a visual break on the page.
fr: Les blocs HTML enveloppent les blocs Media et vous pouvez ainsi aérer la page. Vous pouvez aussi créer une cassure visuelle sur la page.

source: This block displays a linked list of pages. You may select from pages that are within the site but custom links such as Custom URL, Browse, and Browse Item Set are not available.
fr: Ce bloc affiche une liste de pages en lien. Vous pouvez choisir parmi les pages du site, mais vous ne pouvez pas lier des URL, pages de navigation ou pages de navigation des collections.

source: Clicking the "Add pages" button in the block, which will reveal a draw that contains all of the pages in the site. Click on the individual page to add it to the list.
fr: Cliquer sur le bouton "Ajouter des pages" ouvre un volet qui contient toutes les pages du site. Cliquez sur les pages que vous souhaitez ajouter à la liste.

source: ![Page edit interface with List of pages block activated to open page select drawer](../sites/sitesfiles/sitespg_listPagesAdd.png)
fr: ![Une page en vue modification, avec un bloc Liste des pages ajouté](../sites/sitesfiles/sitespg_listPagesAdd.fr.png)

source: You may drag and nest pages into any order.
fr: Vous pouvez déplacer et indenter les pages comme souhaité.

source: ![List of pages block with three pages showing nesting](../sites/sitesfiles/sitespg_listPagesOrder.png)
fr: ![Bloc Liste de pages avec indentation](../sites/sitesfiles/sitespg_listPagesOrder.fr.png)

source: This block displays a list of all of the sites on your Omeka S install. This block has the following options:
fr: Ce bloc affiche une liste de tous les sites de votre installation Omeka S. Il propose les options suivantes :

source: Sort sites by: Alphabetical order (A-Z); Oldest first; Newest first. By default this is set to alphabetical.
fr: Trier les sites par : Ordre alphabétique (A-Z) ; À partir du plus ancien ; À partir du plus récent. L'ordre est par défaut alphabétique.

source: Max number of sites allows you to limit the number of sites which display at once. If left blank, all sites will display.
fr: Le nombre maximum de sites vous permet de limiter le nombre de sites qui s'affichent en même temps. Si vide, tous les sites seront affichés.

source: A checkbox to turn on pagination; applied only if you set a display limit.
fr: Une case à cocher pour activer la pagination, appliqué seulement si vous définissez une limite.

source: A checkbox to show site summaries.
fr: Une case à cocher pour afficher le résumé des sites.

source: A checkbox to show site thumbnails.
fr: Une case à cocher pour afficher la vignette des sites.

source: A checkbox to exclude the current site from the list.
fr: Une case à cocher pour exclure le site actuel de la liste.

source: ![List of sites block](../sites/sitesfiles/sitepg_slist1.png)
fr: ![Bloc Liste de sites](../sites/sitesfiles/sitepg_slist1.fr.png)

source: Media embed
fr: Média intégré

source: Creates a block with one or more pieces of media associated with items in the item pool. In media blocks, multiple attachments stack vertically.
fr: Crée un bloc avec un ou plusieurs médias associés à des contenus du réservoir de contenus. Dans les blocs médias, les pièces jointes s'empilent de manière verticale.

source: ![media block with no media attached](../sites/sitesfiles/sitepg_media.png)
fr: ![bloc media sans media attaché](../sites/sitesfiles/sitepg_media.fr.png)

source: The Media block has options for the display of the media:
fr: Le bloc Média a des options pour l'affichage des médias :

source: Thumbnail type: choose from large, medium, and square.
fr: Type de vignette : choisissez entre grand, moyen, et carré.

source: Thumbnail alignment: float left, float right, and center.
fr: Alignement de la vignette : flotter à gauche, flotter à droite, et centré.

source: !!! note If you want media to appear beside a block of text, place a media block *above* an HTML block, select a smaller thumbnail size, and choose either float left or right for alignment. In the example below, the media has a thumbnail type of "medium", alignment "float right," and attachment title of the "item title":
fr: !!! note Pour qu'un média s'affiche à côté d'un bloc de texte, positionnez le bloc média *au-dessus* du bloc HTML, sélectionnez une taille de vignette plus petite et choisissez un alignement à droite ou à gauche. Dans l'exemple ci-dessous, le média a une vignette de taille moyenne et un alignement à droite :

source: To **add media to the block**, click the "Add attachment" button.
fr: Pour **ajouter un média au bloc**, cliquez sur le bouton *ajouter une pièce jointe*.

source: On loading, the drawer will show a list of your items, most recent first. You can select from the first page, page through using the forward and back arrows, or search using the search bar. You can select from the first page, page through using the forward and back arrows, or search using the search bar.
fr: Au chargement, le tiroir montrera une liste de vos contenus, les plus récents d'abord. Vous pouvez sélectionner depuis la première page, naviguer à travers les pages en utilisant les flèche avant et arrière, ou rechercher en utilisant la barre de recherche.

source: ![Select item drawer](../sites/sitesfiles/sitepg_selectitem.png)
fr: ![Tiroir de sélection de contenu](../sites/sitesfiles/sitepg_selectitem.fr.png)

source: To add multiple items at once, click the "quick add" slider just above the list of items in the right hand drawer. This will add a checkbox to the left of each item. Check the boxes of those items you want to add to the block, then click the "Add selected" button at the bottom of the drawer.
fr: Pour ajouter plusieurs contenus en même temps, cliquez sur le curseur « ajout rapide » au-dessus de la liste des contenus dans le tiroir à droite. Cela ajoutera une case à cocher à la gauche de chaque contenu. Cochez les cases des contenus que vous voulez ajouter au bloc, puis cliquez sur le bouton « Ajouter la sélection » en bas du tiroir.

source: Displays the title of the current page.
fr: Affiche le titre de la page actuelle.

source: ![Page block display site's title](../sites/sitesfiles/sitepg_title.png)
fr: ![Le bloc de page affiche le titre du site](../sites/sitesfiles/sitepg_title.fr.png)

source: Table of contents
fr: Table des matières

source: If the current page has child pages, you can add a table of content block for those pages.
fr: Si la page actuelle a des pages enfant, vous pouvez ajouter un bloc Table des matières pour ces pages.

source: The Depth option allows you to set how many levels of child pages you want to display. If left blank, it will display all possible levels. Please enter a whole number.
fr: L'option profondeur vous permet de définir combien de niveaux de pages enfant vous souhaitez afficher. Si vide, tous les niveaux seront affichés. Veuillez saisir un nombre entier.

source: ![Table of content block with no depth option set](../sites/sitesfiles/sitepg_toc.png)
fr: ![Bloc Table des matières avec l'option profondeur non définie](../sites/sitesfiles/sitepg_toc.fr.png)

source: Add and arrange pages using the [Site Navigation](../sites/site_navigation.md) settings.
fr: Ajoutez et organisez les pages en utilisant les paramètres de la [Navigation du site](../sites/site_navigation.md)

source: Other blocks
fr: Autres blocs

source: For module-specific blocks, such as [Collecting](../modules/collecting.md) or [Mapping](../modules/mapping.md), see the documentation for that module.
fr: Pour les blocs spécifiques à un module (comme [Collecting](../modules/collecting.md) ou [Mapping](../modules/mapping.md)), voir la documentation de ce module.

source: Deleting pages
fr: Supprimer des pages

source: To delete a page, go to the Pages section of the relevant site. Click the delete (trash can) button at the right end of the row for that page.
fr: Pour supprimer une page, allez vers l'onglet *Pages* du site qui contient cette page. Cliquez sur le bouton supprimer (poubelle) à l'extrémité droite de la ligne pour cette page.

source: A drawer will open on the right side of the page asking you to confirm that you wish to delete the page, with the name of the page displayed under the confirmation button. To proceed, click the "Confirm delete" button. Otherwise, click the "X" in the upper right corner of the drawer to cancel.
fr: Un tiroir apparaîtra à droite de la page et vous demandera de confirmer que vous souhaitez supprimer la page, avec le nom de la page affiché sous le bouton de confirmation. Pour continuer, cliquez sur le bouton *Confirmer la suppression*. Sinon, cliquez sur le *X* dans le coin supérieur droit du tiroir pour annuler.

source: ![Delete drawer for the Novels page](../sites/sitesfiles/sitepg_delete.png)
fr: ![Tiroir de suppression pour la page Novels](../sites/sitesfiles/sitepg_delete.fr.png)
