Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/site_navigation.po
Languages: fr

source: Once you click [Sites](../sites/index.md) and select a site to work on, you can use the Navigation link the left sidebar to manage the navigation, or menu, of your site. You can add or delete links, browse pages, and your [pages](../sites/site_pages.md) to the navigation, as well as arrange and nest them.
fr: Quand vous cliquer sur [Sites](../sites/index.md) et sélectionnez un site sur lequel travailler, vous pouvez utiliser la navigation sur la gauche pour gérer la navigation, ou le menu, de votre site. Vous pouvez alors ajouter ou supprimer des liens, des pages de recherche et vos [pages](../sites/site_pages.md), ainsi que les organiser et les emboîter.

source: Themes present your navigation links in different ways. You can also modify navigation settings under [Theme settings](../sites/site_theme.md#theme-settings), such as the depth of nested links to display. Be sure to refresh and check your public pages to ensure the navigation is working correctly after you make changes.
fr: Les thèmes présentent vos liens de navigation de différentes façons. Vous pouvez aussi modifier les paramètres de navigation dans les [paramètres du thème](../sites/site_theme.md#theme-settings), dont l'emboîtement des liens. Veillez à recharger les pages publiques pour vous assurer que la navigation fonctionne correctement après modification.

source: ![Editing navigation with a drawer on the right side of the screen for adding links](../sites/sitesfiles/sitenav_main.png)
fr: ![Modification de la navigation avec un tiroir sur le côté droit de l'écran pour ajouter des liens](../sites/sitesfiles/sitenav_main.fr.png)

source: For every item in the navigation, you have three options: view (box with arrow icon); edit (pencil icon); or delete (trash can icon). Parent navigation pages also have a gray square with a black triangle which collapses or expands their child pages.
fr: Pour chaque élément dans la navigation, vous avez trois options : voir (icône de boîte avec une flèche) ; modifier (icône de crayon) ; ou supprimer (icône de poubelle). Les pages de navigation parents ont aussi un carré gris avec un triangle noir qui replie ou déplie leurs pages enfants.

source: ![Close up of two navigation sections. The top is "Quotes" which has a dark gray square on the end of it containing a black triangle pointing down. The bottom navigation section is called "Share a quote" and does not have the gray square](../sites/sitesfiles/sitenav_detail.png)
fr: ![Gros plan de deux sections de navigation](../sites/sitesfiles/sitenav_detail.fr.png)

source: Homepage
fr: Définir la page d'accueil

source: By default, the topmost page in the navigation acts the main page for your site. Note that custom URLs will not work as a homepage - Omeka will ignore these entries in your navigation and select the first page.
fr: Par défaut, la page au plus haut de la navigation est la page principale de votre site. Notez que les URLs personnalisées ne fonctionneront pas en page d'accueil - le bloc au plus haut de la navigation doit être une page.

source: You can set the homepage without changing the order of your pages using the **Select a homepage** section in the righthand drawer. This section has a dropdown which lists all the pages in your site. Simply select the page you want to use as your homepage.
fr: Vous pouvez définir la page d'accueil sans modifier l'ordre de vos pages en utilisant la section **Choisir une page d'accueil** dans le tiroir à droite. Cette section a une liste déroulante qui liste toutes les pages de votre site. Sélectionnez simplement la page que vous voulez utilisez comme page d'accueil.

source: ![Select a homepage dropdown open to show all the pages in this site](../sites/sitesfiles/sitenav_homeselect.png)
fr: ![Liste déroulante de sélection de page d'accueil qui montre toutes les pages du site](../sites/sitesfiles/sitenav_homeselect.fr.png)

source: To change which page is used as the homepage, select a different page from the dropdown. If you want to revert to using the top page in the navigation, click the "X" to the right of the page name in the menu (circled in red in the below image).
fr: Pour changer la page d'accueil, sélectionner une page différente dans la liste déroulante. Si vous voulez revenir à l'utilisation de la première page de la navigation, cliquez sur le « x » à droite du nom de la page dans le menu (entouré en rouge dans l'image ci-dessous).

source: ![Select a homepage set to Map page](../sites/sitesfiles/sitenav_homedel.png)
fr: ![Sélectionnez une page d'accueil défini à la page Map](../sites/sitesfiles/sitenav_homedel.fr.png)

source: Adding links
fr: Ajouter des liens

source: Add to the navigation of the site using the options on the right hand side of the page. There are two sections: Add a custom link and Add a link to a site page.
fr: Ajoutez à la navigation du site en utilisant les options sur le côté droit de la page. Il y a deux sections: [Ajouter un lien personnalisé](#add-a-custom-link) et [Ajouter un lien vers une page du site](#site-page).

source: Add a custom link
fr: Ajouter un lien personnalisé

source: To add a link you can use the **Add a custom link** options on the right hand drawer to add:
fr: Pour ajouter un lien vous pouvez utiliser les options *Ajouter un lien personnalisé* dans le tiroir à droite pour ajouter :

source: A Custom URL to any web address
fr: Une *URL personnalisée* vers n'importe quel adresse web

source: A "Browse" page for items on your site
fr: Une page Parcourir pour les contenus de votre site

source: A "Browse item sets" page for item sets on your site
fr: Une page Parcourir pour les collections de votre site

source: Other pages added by modules you have installed.
fr: D'autres pages ajoutées par les modules installés.

source: You can add one of your [pages](../sites/site_pages.md), which will be listed in the right-hand drawer, under "Add a link to a site page". If you would like to search for a specific page, begin typing the page title in the search box with the helper text "Filter pages".
fr: Vous pouvez ajouter une de vos [pages](../sites/site_pages.md) listées dans le volet de droit sous "Ajouter un lien vers une page du site".

source: The **Custom URL** link option, when added to your navigation, have three fields: the link **type** (showing as "Custom URL"), the **label** (the text that will appear in the site navigation menu), and the **URL**.
fr: Lorsque vous ajoutez une **URL personnalisée** à votre navigation, un bloc avec trois champs s'affiche : le **type** de lien, le **libellé** (texte qui apparaîtra dans le menu de navigation du site) et l'**URL**.

source: ![URL link option with the label "RRCHNM" and URL chnm.gmu.edu](../sites/sitesfiles/sitenav_url.png)
fr: ![Bloc URL avec le libellé « RRCHNM » et l'URL chnm.gmu.edu](../sites/sitesfiles/sitenav_url.fr.png) Bloc URL

source: **Browse** links create a browse page for [resources](../sites/site_resources.md) already associated with your site. There are options to create a browse items page and a browse item sets page.
fr: Le lien **Parcourir** crée une page parcourir pour les [ressources](../sites/site_resources.md) déjà associées à votre site. Il y a des blocs pour créer une page de parcours des contenus et des collections.

source: You can change the **label** of the link to reflect what, specifically, site visitors will browse.
fr: Vous pouvez changer le *libellé* du lien pour expliciter ce que les visiteurs vont parcourir.

source: ![Browse page form with the query element](../sites/sitesfiles/sitenav_query.png)
fr: ![Formulaire de la page parcourir avec l'élément de requête](../sites/sitesfiles/sitenav_query.fr.png)

source: To refine the Browse page, you can use the Query interface to create a search query that returns the desired results.
fr: Pour affiner la page Parcourir, vous pouvez utiliser l'interface de Requête pour créer une requête de recherche qui retournera les résultats désirés.

source: Click the "Edit" button to reveal the advanced search interface in the drawer. Once you are satisfied with the pool of items in your search, clicking the "Apply" button will set the pool of items for the Browse page.
fr: Cliquer sur le bouton "Modifier" pour ouvrir l'interface de recherche avancée dans le volet droit. Une fois les choix des contenus de recherche faits, cliquer sur le bouton "Appliquer".

source: ![Advanced search query drawer](../sites/sitesfiles/sitenav_query_search.png)
fr: ![Tiroir de recherche avancée](../sites/sitesfiles/sitenav_query_search.fr.png)

source: Once a query has been set, you can click "Edit" to update the pool of items. You can click "Advanced edit" to directly edit the query string. Finally, you can "Clear" a query to start over. If you have cleared a search in error, you can "Restore" it.
fr: Une requête peut toujours être modifier en cliquant sur le bouton "Modifier". Cliquer sur le bouton "Modification avancée" pour modifier directement la chaîne de requête. Enfin, vous pouvez "Retirer" une requête. Si vous retirez une requête par erreur, vous pouvez la "Restaurer".

source: ![Browse page form with the edit query element](../sites/sitesfiles/sitenav_query_update.png)
fr: ![Formulaire de la page parcourir avec l'élément de modification de requête](../sites/sitesfiles/sitenav_query_update.fr.png)

source: Site page
fr: Page de site

source: Site page blocks create links to pages you have built for your site. The **page** field indicates which page is in use, as does the block title. You can change the **label** for the page link in the navigation, as in the example image below. Note that changing the label does not change the page title.
fr: Les blocs de page de site créent des liens vers les pages que vous avez construites pour votre site. Le champ *page* indique quelle page est utilisée, comme le fait le titre du bloc. Vous pouvez modifier le *libellé* du lien de page dans la navigation, comme dans l'image d'exemple ci-dessous. Notez que modifier le libellé ne change pas le titre de la page.

source: ![Page block with for the page "Her Life and Times"](../sites/sitesfiles/sitenav_pages.png)
fr: ![Bloc de page pour la page Qu'est-ce que la gymnastique artistique libellée « Encore plus de gymnastique »](../sites/sitesfiles/sitenav_pages.fr.png) Bloc de page de site

source: If you have many pages, you can use the **Filter pages** field to find the names and slugs of specific pages.
fr: Si vous avez beaucoup de pages, vous pouvez utiliser le champ *Filtrer les pages* pour trouver les noms et identifiants de pages spécifiques.

source: Be sure to click Save before leaving the Navigation tab to save changes. If you do not want to save changes, click the Cancel button.
fr: Soyez sûr de cliquer sur Enregistrer avant de quitter l'onglet Navigation pour enregistrer les changements. Si vous ne voulez pas enregistrer les changements, cliquez sur le bouton Annuler.

source: Editing and arranging links
fr: Modifier et organiser la navigation

source: When you add a link block it is automatically expanded. To collapse an open link block, click the edit (pencil) icon in the upper right corner of each block, next to the delete (trash) icon. When you arrive at the Navigation tab after saving changes or from the main site edit page, the navigation items should be collapsed; open the block by clicking the edit (pencil) icon.
fr: Quand vous ajoutez un bloc de lien, il est automatiquement déplié. Pour replier un bloc de lien ouvert, cliquez sur l'icône de modification (crayon) dans le coin supérieur droit du bloc, à côté de l'icône supprimer (poubelle). Quand vous arrivez sur l'onglet Navigation après avoir enregistré les changements ou depuis la page principale de modification du site, les éléments de navigation sont alors repliés ; ouvrez le bloc en cliquant sur l'icône de modification (crayon).

source: The topmost item in the navigation is the main page for your site.
fr: L'élément le plus haut dans la navigation est la page principale de votre site.

source: You can arrange your navigation links by dragging and dropping them into your preferred order. Nest links by dragging the desired child link on top of the desired parent link; when you do so a small black triangle should appear to the left of the parent block.
fr: Vous pouvez organiser les liens de navigation en les glissant et en les déposant dans l'ordre souhaité. Emboîtez les liens en glissant le lien enfant sur le lien parent; quand vous faites ça un petit triangle noir doit apparaître à gauche du bloc parent.

source: ![The block for Film Adaptations - the child page - hovering over the block for Adaptations - the parent block.](../sites/sitesfiles/sitenav_drop.png)
fr: ![Exemple de blocs parents/enfants](../sites/sitesfiles/sitenav_drop.fr.png)

source: In this image, "Film Adaptations" is the child link; "Adaptations" will be the parent link, as indicated by the small black triangle on the left.
fr: Dans cette capture, "Collections" est le lien enfant ; "Qu'est-ce que la gymnastique artistique ?" est le lien parent, comme l'indique le petit triangle noir sur la gauche.

source: Omeka S allows for multiple levels of nested navigation.
fr: Omeka S permet plusieurs niveaux d'indentation dans la navigation.

source: Deleting links
fr: Supprimer des liens

source: To delete a link from the navigation, click the delete (trash can) icon and then click "Save". If you accidentally click the delete icon, you can click the undo (back looped arrow) icon before click "Save" to cancel the deletion.
fr: Pour supprimer un lien de la navigation, cliquez sur l'icône supprimer (poubelle) et cliquez sur *Enregistrer*. Si vous cliquez de manière accidentelle sur l'icône supprimer, vous pouvez cliquer sur l'icône défaire (flèche en boucle arrière) avant de cliquer sur enregistrer pour annuler la suppression.

source: ![Two link blocks, one of which is highlighted in red and marked for deletion](../sites/sitesfiles/sitenav_del.png)
fr: ![Deux blocs de lien, dont un qui est surligné en rouge et marqué pour la suppression](../sites/sitesfiles/sitenav_del.fr.png)

source: In this image, the delete icon for the "Sense and Sensibility" page has been clicked; the block now displays the undo button in its place.
fr: Dans cette image, l'icône supprimer pour parcourir a été cliquée ; le bloc affiche maintenant un bouton défaire à la place.

source: Deleting a parent block from the navigation will also delete any child blocks, which in the interface is shown by all the child blocks also becoming highlighted in red.
fr: Supprimer un bloc parent de la navigation supprimera également tous les blocs enfant.

source: ![Parent and child block marked for deletion](../sites/sitesfiles/sitenav_del2.png)
fr: ![Les blocs parent et enfants sont marqués pour la suppression](../sites/sitesfiles/sitenav_del2.fr.png)

source: In this image, the delete icon for "Adaptations" has been clicked; "Adaptations" and its child page "Sense and Sensibility" are both shown in red, and "Adaptations" now shows the undo button where the trash can used to be.
fr: Dans cette capture, l'icône de suppression a été cliquée pour "Qu'est-ce que la gymnastique artistique ?" ; "Qu'est-ce que la gymnastique artistique ?" et sa page enfant "Collections" sont toutes deux en rouge, et "Qu'est-ce que la gymnastique artistique ?" affiche maintenant le bouton défaire à la place de l'icône poubelle.
