Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/sites/site_users.po
Languages: fr

source: Site Users
fr: Utilisateurs des sites

source: Sites have specific user settings that are separate from the [user roles set at an installation-wide level](../admin/users.md). Users must be added at the installation level, then added to each site individually that you would like them to have access to.
fr: Les sites permettent des paramétrages des utilisateurs distincts des [rôles des utilisateurs au niveau de l'instance](../admin/users.md). Les utilisateurs doivent être ajoutés au niveau de l'instance, puis individuellement à chaque site auquel ils auront accès.

source: Global Admins and Supervisors have all permissions on all sites. Other user roles in Omeka S (Editor, Reviewer, Author, Researcher) are unrelated to site-specific user roles (Manager, Creator, Viewer). For example, a user set to Researcher in the installation can nevertheless be set as a Manager of a site, which means they can delete that site.
fr: Les administrateurs généraux et administrateurs de site ont toutes les permissions sur tous les sites. Les autres rôles d'utilisateurs d'Omeka S (Éditeur, Relecteur, Auteur, Chercheur) sont décorrélés des rôles d'utilisateurs spécifiques aux sites (Responsable, Créateur, Observateur). Par exemple, un utilisateur classé comme Chercheur peut être Responsable d'un site, et peut donc le supprimer.

source: Setting a user (at the installation level) to have a default site for their items will not give them a site role.
fr: Attribuer un site par défaut à un utilisateur (au niveau de l'instance) ne lui donne pas de rôle pour ce site.

source: To add a user to a single site, navigate to the **User Permissions** tab after selecting your intended site.
fr: Pour ajouter un utilisateur à un site, naviguez vers l'onglet *Droits des utilisateurs*.

source: ![User permissions tab with no added users and an alphabetical directory on the right](../sites/sitesfiles/sites_users.png)
fr: ![L'onglet permissions utilisateur avec aucun utilisateur ajouté et un répertoire alphabétique sur la droite](../sites/sitesfiles/sites_users.fr.png)

source: A drawer on the right hand side of the screen shows all of the users for your install, sorted by the first letter of their display name.
fr: Un tiroir sur la droite de l'écran montre tous les utilisateurs de votre installation, triés par la première lettre de leur nom d'utilisateur.

source: To add a user, click on their name. Then select their role from the dropdown:
fr: Pour ajouter un utilisateur, cliquez sur son nom. Puis sélectionnez son rôle depuis la liste déroulante :

source: **Viewer**: Can see a site's entry in the list of sites, even if the site's visibility is set to private, but cannot make any modifications.
fr: **Observateur** : Peut voir le site dans la liste des sites, même si celui-ci est privé, mais ne peut pas faire de modifications.

source: **Creator**: Can access and edit all of the site's properties, that is, everything available from the site-specific submenu. (This role was called "Editor" in Omeka S versions 1.x-2.x.)
fr: **Créateur :** l'utilisateur peut accéder au côté administration du site et le modifier (ce rôle est nommé « Éditeur » dans les version 1.x-2.x d'Omeka S).

source: **Manager**: Has full administrative privileges for the site, including adding/removing users and deleting the site. (This role was called "Admin" in Omeka S versions 1.x-2.x.)
fr: **Responsable :** l'utilisateur a les pleins pouvoirs administratifs pour ce site, ce qui inclut l'ajout d'utilisateurs et la suppression du site (ce rôle est nommé « Administrateur » dans les version 1.x-2.x d'Omeka S).

source: You can add or revoke privileges for users by going back to the User permissions tab and selecting or deselecting the boxes and clicking "Save". Users can be deleted from the site by clicking the trash can icon on their row, and confirming the deletion in the drawer that appears.
fr: Vous pouvez ajouter ou révoquer des permissions pour les utilisateurs en revenant dans l'onglet Droits des utilisateurs et en sélectionnant ou désélectionnant les boîtes puis en cliquant sur "Enregistrer". Les utilisateurs peuvent être supprimés du site en cliquant sur l'icône de poubelle sur leur ligne. Un volet de confirmation de la suppression s'ouvre sur la droite.

source: Once you've added one or more users, click the "Save" button located in the upper right hand corner. To cancel your changes, click the "Cancel" button in the upper right hand corner.
fr: Une fois que vous avez ajouté un ou plusieurs utilisateurs, cliquez sur le bouton "Enregistrer" situé dans le coin supérieur droit. Pour annuler vos changements, cliquez sur le bouton "Annuler" dans le coin supérieur droit.
