Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/items.po
Languages: fr

source: Items
fr: Contenus

source: Items are the building blocks of the Omeka system.
fr: Les contenus sont les éléments constitutifs du système d'Omeka.

source: In Omeka S, items can be made available to you from the system administrator, and you may add items to your own site.
fr: Avec Omeka S, les contenus peuvent être mis à disposition par l'administrateur système et vous pouvez en ajouter à votre propre site.

source: Items are listed in the **Items** tab (the box icon) in the left-hand navigation of the administrative dashboard.
fr: Les contenus sont répertoriés dans l'onglet **Contenus** (icône en forme de boîte) de l'espace de navigation situé à gauche du tableau de bord administrateur.

source: ![Basic view of admin items page, showing a handful of item resources](contentfiles/items_browse.png)
fr: ![Vue de base de la page admin des contenus affichant quelques ressources](contentfiles/items_browse.fr.png)

source: Each item appears as a row, with columns for:
fr: Chaque contenu occupe une ligne organisée en colonnes contenant :

source: the **Title**
fr: le *Titre*

source: icons to **edit** (pencil), **delete** (trash can), or **details** (ellipsis)
fr: des icônes pour **éditer** (crayon), **supprimer** (poubelle) ou accéder aux **détails** (points de suspension)

source: the **Class**
fr: la **Classe**

source: the item’s **Owner**
fr: le **Propriétaire** du contenu

source: the date the item was **Created**.
fr: la date à laquelle le contenu a été **Créé**.

source: In the top right corner of the Items screen is the "Add new item" button.
fr: En haut à droite de la fenêtre Contenus se trouve le bouton "Ajouter un nouveau contenu".

source: Options for navigating and creating items sit in the header of the table of items.
fr: Les options de navigation et de création des contenus se trouvent au niveau de l'en-tête de la table des contenus.

source: On the left side are controls for the pages of items, with forward and back arrows, and an editable box for the current page number — enter a valid page number and hit Enter to go to that page.
fr: À gauche, on trouve les commandes de navigation, dont des flèches avant et arrière et un encart contenant le numéro de page actuel — pour changer de page, y entrer un numéro de page valide et cliquer sur Entrée.

source: In the center is a link for [Advanced Search](../search.md#item-advanced-search).
fr: Le lien vers la [Recherche avancée](../search.md#item-advanced-search) se trouve au milieu de l'en-tête.

source: On the right are options for sorting the table of items, with two dropdown menus. By default, items in the table are sorted by most recently-added items at the top (Created & Descending). The first lets you select between **Title**, **Identifier**, **Class**, **Owner**, and **(Date) Created**; the second allows you to sort by ascending (A-Z or earliest to latest) or descending (Z-A or latest to earliest). To apply, click the "Sort" button.
fr: La partie droite de l'en-tête réunit dans deux menus déroulants les options de la table des contenus. Les contenus sont triés par date de création, en partant du plus récent (Créé et Décroissant). Le premier menu propose des options de classement par **Titre**, **Identifiant***, **Classe**, **Propriétaire** et **Créé (date)** ; le second menu permet d'organiser les contenus par ordre croissant (de A à Z ou du plus récent au plus ancien) ou décroissant (de Z à A ou du plus ancien au plus récent). Pour appliquer les options de tri à la table des contenus, cliquez sur le bouton "Trier".

source: Between these and the table, on the left, is a dropdown for batch actions, including edit selected, edit all, delete selected, and delete all.
fr: Un menu déroulant pour le traitement par lots (modifier sélectionnés, modifier tout, supprimer sélectionnés et supprimer tout) se trouve sur la gauche, entre l'en-tête et la table des contenus.

source: View items
fr: Accéder aux contenus

source: To quickly view the basic information about an item, click the **Details** (ellipsis) button in the row for the item, located next to the edit and delete buttons. This will open a drawer to the right of the list which displays the item’s title, description, visibility, any sites it is used in, and its associated media..
fr: Pour accéder rapidement aux informations principales liées à un contenu, cliquer sur le bouton **Détails** (points de suspension) situé sur la même ligne que le contenu, à la suite des boutons modifier et supprimer. Cette action fait apparaître un volet (sur la droite de la fenêtre) contenant le titre du contenu, sa description, sa visibilité, les sites qui l'utilisent et les médias associés.

source: For a more detailed look at an individual item, click on its title in the items browse table or when viewing its details.
fr: Pour accéder à la vue complète d'un contenu, cliquer sur son titre, soit dans la table des contenus, soit dans le volet des détails.

source: ![Item browse view with details open for "Behold, Here's Poison". Links to item view page squared in blue](contentfiles/items_detailview.png)
fr: ![Fenêtre des contenus avec les détails ouverts pour "Chien 1". Liens vers la page du contenu encadrés en bleu](contentfiles/items_detailview.fr.png)

source: The blue squares indicate where to click to open the full item view.
fr: Les encadrés bleus indiquent où cliquer pour accéder au contenu complet.

source: When you view an individual item , there are tabs for the item’s **Metadata** and its **Linked Resources**. The right side of the page displays the item’s media, any **item sets** to which it belongs, its creation date, owner, and visibility.
fr: La page d'un contenu spécifique comprend un onglet pour ses **Métadonnées** et un pour ses **Ressources liées**. Les médias associés au contenu sont affichés à droite de la page, où sont aussi indiqués la visibilité du contenu, les collections auxquelles il appartient, sa date de création et son propriétaire.

source: An item’s **linked resources** (shown below) are resources, which are linked to this item through properties. Note that this section only shows resources which have been linked *to* this item (which have it for a property); resources which are linked *from* this item will display in the property which they fill.
fr: Les **Ressources liées** à un contenu (voir ci-dessous) le sont par des propriétés spécifiques. Cette section n'affiche que les ressources qui ont été liées à ce contenu par une propriété ; si ce contenu est lui-même lié à des ressources, cela apparaîtra dans les pages dédiées à celles-ci.

source: Linked items are grouped by the property for which they use the current item. In the example below, the item William Shakespeare is used for the properties "Creator", "References", and "list of authors" for the linked resources.
fr: Les ressources liées sont réunies par la propriété qui les associe au contenu considéré. Dans l'exemple ci-dessous, les propriétés "Créateur", "Références" et "liste d'auteurs" du contenu William Shakespeare sont utilisées pour les ressources liées. [exemple à modifier]

source: You can filter linked resources to only display those referencing a specific property using the dropdown "Filter by property". It will only display properties actively in use.
fr: Le menu déroulant "Filtrer par propriété" permet de sélectionner les ressources liées renvoyant à une propriété spécifique. Ce menu n'affiche que les propriétés effectivement utilisées.

source: ![Item linked resources view for William Shakespeare, with six plays using Shakespeare as Creator, the item Folger Shakespeare Library listed as 'references' Shakespeare, and the Globe Theatre using Shakespeare for 'list of authors'. Each property cluster is in a separate rectangle, headed by the property being referenced.](contentfiles/items_linked.png)
fr: ![Onglet des ressources liées pour William Shakespeare, avec une pièce utilisant Shakespeare comme Créateur, le contenu Folger Shakespeare Library listant Shakespeare dans les références et le Théâtre du Globe dans la liste des auteurs. Chaque propriété est dans un rectangle distinct chapeauté par le nom de la propriété concernée.](contentfiles/items_linked.fr.png)

source: Add an item
fr: Ajouter un contenu

source: To add a new item, begin by selecting the the "Add new item" button.
fr: Cliquer sur le bouton "Ajouter un nouveau contenu".

source: Before creating items, supervisors may want to create [Resource Templates](resource-template.md), which will load specific fields for various item types.
fr: Avant de créer des contenus, les administrateurs peuvent créer des [Modèles de ressources](resource-template.md) qui n'afficheront que certains champs spécifiques à tel ou tel type de contenu.

source: Values
fr: Valeurs

source: The Values tab is where you enter metadata, such as title, description, etc.
fr: L'onglet Valeurs sert à la saisie des métadonnées, telles que le titre, la description, etc.

source: ![Basic view of add items page, with no content entered](contentfiles/items_add.png)
fr: ![Exemple d'une vue de base de la page de création de contenus dont les champs sont vides](contentfiles/items_add.fr.png)

source: You can select a resource template from the drop-down menu. Resource templates are defined by the supervisors and editors.
fr: Un menu déroulant permet de sélectionner un modèle de ressource, prédéfini par les superviseurs et éditeurs.

source: If using a resource template, the class should automatically load.
fr: Lorsqu'un modèle de ressource est utilisé, la classe est automatiquement remplie.

source: If not using a resource template, you may select a class from the dropdown menu (these are populated from the [Vocabularies](vocabularies.md) in your installation).
fr: Sans modèle de ressource, une classe peut être sélectionnée dans le menu déroulant (celui-ci est alimenté par les [Vocabulaires](vocabularies.md) installés sur votre instance).

source: Add information to the properties that load. If you do not select a resource template or class, the Dublin Core properties Title and Description will load automatically.
fr: Remplissez les champs qui apparaissent. Si ni modèle de ressource ni classe n'ont été sélectionnés, les propriétés Dublin Core Titre et Description apparaissent par défaut.

source: You may add text, a resource from the installation, or an external link in each field.
fr: Chaque champ peut être rempli avec du texte, une ressource de votre instance Omeka ou un lien externe.

source: Whether or not you use a resource template, you can add more properties to the item using the drawer on the right side of the screen. You can simply click open one of the vocabularies and click on the property you want to add, or you can use the “Filter properties” box to search for a specific property (this is helpful when you have multiple large vocabularies).
fr: Le volet à la droite de la page permet d'ajouter des propriétés au contenu, que vous ayez ou non utilisé un modèle de ressource. Il suffit de cliquer sur un des vocabulaires puis sur la propriété à ajouter, ou d'utiliser le champ "Filtrer les propriétés" pour rechercher une propriété spécifique (particulièrement pratique avec plusieurs vocabulaires extensifs).

source: ![Close up of the right hand drawer with the text "date" entered into the filter properties box and a series of properties containing the word "date" loaded from Dublin Core and Bibliographic Ontology](contentfiles/items_filterprop.png)
fr: ![Vue rapprochée du volet de droite avec le texte "date" tapé dans la barre de filtre des propriétés, avec une série de propriérés Dublin Core et Bibliographic Ontology contenant le mot "date"](contenfiles/items_filterprop.fr.png)

source: Clicking on the property label in the drawer will automatically add it to the Item. If you add a property by accident, leave it blank and it will be removed from the item when you save changes.
fr: En cliquant sur l'étiquette de la propriété, celle-ci est automatiquement ajoutée au contenu. Si vous ajoutez une propriété par erreur, ne la remplissez pas et elle sera retirée du contenu à votre prochain sauvegarde.

source: You can set individual properties as Private or Publicly visible using the eye icon for each property. Note that properties set to private are still visible to Global Admins, Supervisors, and Editors will be able to see properties even when set to private. Authors will be able to see all properties on items they own, but will not see private properties created by other users.
fr: Chaque propriété peut être mise en privé ou en public par le biais de l'icône oeil. Les propriétés en statut privé demeurent visibles pour les Administrateurs généraux, les Superviseurs et les Éditeurs. Les Auteurs ont accès à toutes les propriétés des contenus qu'ils créent mais ne peuvent pas voir les propriétés en statut privé créées par d'autres utilisateurs.

source: In the image below, the first property (Title) is public as indicated by the open eye icon. The second property (Description) is private as indicated by the slashed-through eye icon. Clicking or hitting enter on the eye icon toggles between public and private.
fr: Dans l'exemple ci-dessous, la première propriété (Titre) est publique, comme l'indique l'icône oeil ouvert. La deuxième propriété (Description) est privée, comme l'indique l'icône oeil barré. Cliquer sur l'icône oeil fait alterner entre les statuts public et privé.

source: ![As described](contentfiles/item_propviz.png)
fr: ![Exemple correspondant](contentfiles/item_propviz.fr.png)

source: Text
fr: Texte

source: Text fields allow for unformatted text entry.
fr: Les champs de texte permettent d'entrer du texte libre.

source: ![image of text input field with keyboard icon indicating text input, the globe icon for setting language, and a trashcan delete icon](contentfiles/items_textedit.png)
fr: ![image d'un champ de texte avec l'icône clavier indiquant qu'il s'agit de texte, l'icône globe terrestre pour l'indication de langue et l'icône poubelle pour supprimer la valeur](contentfiles/item_textedit.fr.png)

source: You can indicate the language for the content of an input using the globe symbol above the input (see the red arrow in the image below). Click on the globe to activate a text field, then enter the [IETF Language tag](https://en.wikipedia.org/wiki/IETF_language_tag) code for the language in which the text is written.
fr: La langue d'une valeur peut être indiquée en utilisant le symbole globe terrestre (voir la flèche rouge dans l'image ci-dessous). Cliquez sur le globe pour activer un champ de texte, puis tapez le [Étiquette d'identification de langues](https://fr.wikipedia.org/wiki/%C3%89tiquette_d%27identification_de_langues_IETF) code correspondant à la langue du texte.

source: ![Red arrow points to the globe icon and a text entry field highlighted in blue](contentfiles/item_lang.png)
fr: ![Flèche rouge pour le globe et champ de texte encadré en bleu](contentfiles/item_lang.fr.png)

source: Omeka resource
fr: Ressource Omeka

source: Omeka resource fields create an internal link between the resource you are creating and the resource which fills that field.
fr: Les champs de ressource Omeka permettent de lier le contenu créé à d'autres ressources.

source: When creating an item, you have the option to use either another item or an item set.
fr: La ressource liée peut être un autre contenu ou une collection.

source: Choosing a resource type will open a side drawer where you can browse all of those resources in the installation. You can use the search function at the top of the drawer to narrow down the list or to quickly find a specific item.
fr: Une fois le type de ressource choisi, vous pouvez parcourir toutes les ressources de votre instance dans un volet ouvert sur la droite de la page. Une fonction recherche en haut du volet permet de restreindre la liste des résultats ou de trouver rapidement un contenu spécifique.

source: Once you select an item or item set, detailed information will load, and you must click "Select resource" to finish linking the resources. You can also click the "X" button in the upper right-hand corner to go back to the list of items or item sets.
fr: Les informations principales concernant la collection ou le contenu sélectionné apparaissent et il reste à cliquer sur "Choisir une ressource" pour créer le lien. Le bouton "X" en haut à droite du volet permet de revenir à la liste des contenus et collections.

source: ![Select Item menu with list of items to link in edit item view](contentfiles/items_addresource.png)
fr: ![Menu des contenus à sélectionner dans la page de modification d'un contenu](contentfiles/items_addresource.fr.png)

source: If you are using an Item resource for the property, you will have additional options for finding the item you want in the drawer. Open these options by clicking the triangle button next to the phrase "Filter search".
fr: Dans le cas où vous sélectionnez un contenu comme propriété, des options supplémentaires pour trouver ce contenu s'affichent dans le volet de droite. Appuyer sur le bouton triangulaire à côté de la mention "Filtre de recherche" pour accéder à ces options.

source: ![Select Item drawer top options, with a red arrow around a gray triangle button to the right of the phrase "Filter search"](contentfiles/items_filtersearch.png)
fr: ![Volet Choisir un contenu ouvert, flèche rouge entourant le triangle gris à la droite de l'expression "Filtre de recherche"](contentfiles/items_filtersearch.fr.png)

source: This will open a menu below the button with the following options to filter the items in the drawer:
fr: Cette action ouvre un menu qui contient les options suivantes pour filtrer les contenus :

source: Filter by class: A dropdown where you can select any class provided by the vocabularies on the installation.
fr: Filtrer par classe : un menu déroulant qui permet de sélectionner une propriété fournie par les vocabulaires de l'instance.

source: Filter by item set: A dropdown where you can limit the items displayed in the drawer to only those associated with a particular item set.
fr: Filtrer par collection : un menu déroulant qui permet de limiter les contenus à ceux associés à une collection spécifique.

source: Filter by item ID: A search field where you can input the ID of the item you want to use. You can find an item's ID in the URL of its edit page; if you are editing the item and the URL is `admin/item/11547/edit` then the item's ID is 11547. An item ID will also appear in the right-hand drawer on its view page.
fr: Filtrer par ID de contenu : un champ de recherche où indiquer l'ID du contenu visé. L'ID d'un contenu se trouve dans l'URL de sa page d'édition ; si l'URL est "admin/item/11547/edit", alors l'ID est 11547. L'ID du contenu est aussi affiché dans le volet de droite de sa page.

source: ![options as above described](contentfiles/item_addresItem.png)
fr: ![Options décrites ci-dessus](contentfiles/item_addresItem.fr.png)

source: Item resources also have an option for "Quick add". When this switch is flipped, all of the items in the drawer have a checkbox. You can use these checkboxes to add multiple items as a property at once. Note that you can only edit one property at a time, so all of the items must populate the same property (e.g. Creator, Has Part).
fr: Les contenus à lier font aussi apparaître une option "Ajout rapide". Lorsque cette option est activée, une case à cocher apparaît à côté de chaque contenu du volet. Cette case permet d'ajouter plusieurs contenus à la fois. Toutefois, on ne peut modifier qu'une propriété à la fois, il faut donc que tous les contenus cochés relèvent bien de la même propriété (e.g. Créateur, Contributeur).

source: ![a red arrow points to the slider button for "Quick add". The two items visible have an empty checkbox to the left of their representative thumbnail](contentfiles/items_quickadd.png)
fr: ![Une flèche rouge indique le bouton "Ajout rapide". Une case à cocher apparaît à la gauche de chaque contenu visible.](contentfiles/items_quickadd.fr.png)

source: URI fields link to an external website or online resource.
fr: Les champs URI permettent de lier un contenu à un site internet externe ou à une ressource en ligne.

source: You may add other fields by selecting a property from the list on the right. Browse fields by vocabulary (Dublin Core, Bibliographic Ontology, etc.), or search in the **filter properties** bar above the list of properties and vocabularies.
fr: Vous pouvez ajouter d'autres champs en sélectionnant une propriété dans la liste située à droite, en parcourant les champs par vocabulaire (Dublin Core, Bibliographic Ontology, etc.) ou en faisant une recherche dans la barre **filtrer les propriétés** qui se trouve au-dessus de la liste des vocabulaires.

source: Value annotation
fr: Annotation des valeurs

source: When you input a value for a property associated for a resource, you are making a statement about that resource. If you choose, Omeka allows you to make statements about that statement. We call this value annotation. The advantage of value annotation is that you can choose to make ambiguous facts more concrete by annotating things like:
fr: Quand vous ajoutez une valeur à une propriété de la ressource, vous dites quelque chose de celle-ci. Si vous le souhaitez, Omeka permet de commenter ces valeurs : c'est l'annotation des valeurs. Celle-ci sert par exemple à désambiguïser des informations :

source: Provenance: Where is this fact from?
fr: Provenance : quelle est la source de ce fait ?

source: Time: When did this fact occur?
fr: Date : quand ce fait s'est-il produit ?

source: Location: What is the location associated with this fact?
fr: Lieu : où ce fait a-t-il eu lieu ?

source: Certainty: What is the confidence of this fact?
fr: Certitude : quel est le degré de certitude de ce fait ?

source: Type: What type of concept/thing is this fact?
fr: Type : quel type de chose/concept constitue ce fait ?

source: In the world of linked data, this process is know as [reification](https://www.w3.org/wiki/RdfReification). Each value can have any number of annotations.
fr: Dans le monde des données liées, ce processus s'appelle la [réification](https://www.w3.org/wiki/RdfReification). Chaque valeur peut avoir plusieurs annotations.

source: To create an annotation, click on the ellipsis on the right side of the value input interface, and then click on the annotation icon (a dialogue bubble).
fr: Pour annoter, cliquer sur les points de suspension à la droite du champ de valeur, puis sur l'icône d'annotation (une bulle de parole).

source: ![a detail of the property with the annotation bubble highlighted](contentfiles/annotation_add.png)
fr: ![exemple](contentfiles/annotation_add.fr.png)

source: The annotation sidebar will open to the right. Select any property that is available within the Omeka S installation to describe the relationship between the annotation and the value it describes. For instance, the value for associated with the property DCterms:Contributor might be annotated with the property Schema:jobTitle.
fr: Le champ d'annotation s'affiche sur la droite. Sélectionner une propriété disponible dans votre instance Omeka S pour décrire la relation entre l'annotation et la valeur annotée. Par exemple, on peut annoter la valeur associée à la propriété DCterms:Contributor avec la propriété Schema;jobTitle.

source: Then select a date type for the annotation: Text, URI, or an Omeka S Resource. Installed modules may make additional data types available. Click the Add Annotation button.
fr: Sélectionner ensuite le type d'annotation : texte, URI ou ressource Omeka S. Les modules installés peuvent rendre d'autres types de données accessibles. Cliquer sur le bouton Ajouter annotation.
