Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/items.po
Languages: fr

source: Input the annotation, and click Set Annotations to finalize the process.
fr: Entrer l'annotation puis cliquer sur "Appliquer les annotations".

source: ![a picture of the value annotation sidebar with a property selected and an annotation included](contentfiles/annotation_sidebar.png)
fr: ![exemple](contentfiles/annotation_sidebar.fr.png)

source: Sites include a setting to indicate whether or not value annotations are visible to the public.
fr: Vous pouvez ensuite paramétrer votre site pour rendre les annotations visibles ou non du public.

source: Language
fr: Langue

source: You can indicate the language for the content of an input using the globe symbol above the input (see the red arrow in the image below). Click on the globe to activate a text field, then enter the [IETF Language tag](https://en.wikipedia.org/wiki/IETF_language_tag) for the language in which the text is written.
fr: La langue d'un contenu entrant peut être indiquée en utilisant le symbole globe terrestre (voir la flèche rouge dans l'image ci-dessous). Cliquez sur le globe pour activer un champ de texte, puis tapez le [Étiquette d'identification de langues](https://fr.wikipedia.org/wiki/%C3%89tiquette_d%27identification_de_langues_IETF) code correspondant à la langue du texte.

source: Value order
fr: Ordre des valeurs

source: If you have multiple values for a property, you can reorder them by dragging and dropping. Click on the bar on the left of the value to grab that value, and drag it into the order that you want it.
fr: Si vous entrez plusieurs valeurs pour une propriété, vous pouvez les ordonner par un système de drag and drop. Cliquez sur la barre à gauche de la valeur pour la sélectionner, puis positionnez-la selon l'ordre souhaité.

source: ![Close up of the Subject property with two values. A red circle shows the location of the grab bar for the value.](contentfiles/item_valuereorder.png)
fr: ![Vue rapprochée de la propriété Sujet avec deux valeurs. Un cercle rouge montre où attraper la valeur pour la déplacer.](contentfiles/item_valueorder.fr.png)

source: Media
fr: Médias

source: Use the **Media** tab to add images, video, or other files. Using the buttons on the **Add New Media** menu on the right side of the screen, select a media type (Upload, URL, oEmbed, YouTube, or HTML)
fr: L'onglet **Médias** permet d'ajouter des images, des vidéos ou d'autres types de fichiers. Utiliser les boutons dans le menu **Ajouter un média** à la droite de la page pour sélectionner le type de média (Charger, URL, oEmbed, Youtube ou HTML).

source: ![“Add new media” drawer showing the options](contentfiles/items_mediaadd2.png)
fr: ![Volet "Ajouter un média" avec options](contentfiles/items_mediaadd2.fr.png)

source: **Upload**: select a file to upload from your computer.
fr: **Charger** ; sélectionner un fichier depuis votre ordinateur.

source: **URL**: import media via a URI.
fr: **URL** : importer un média via une URL.

source: **HTML**: add html content as a media resource for your item.
fr: **HTML** : ajouter du contenu html.

source: **IIIF**: Add an IIIF image via URL.
fr: **IIIF** : ajouter une image IIIF via une URL.

source: **oEmbed**: insert an embedded representation of an external URL. Note that this will only work with content from [existing oEmbed implementations](http://oembed.com/#section7) - use the URL in your browser’s location bar.
fr: **oEmbed** : insérer une représentation embarquée d'une URL extérieure. Cette action ne fonctionne qu'avec un contenu tiré d'[une implémentation oEmbed préexistante](http://oembed.com/#section7) - utiliser l'URL de votre barre de recherche.

source: **YouTube**: add a link to embed a YouTube video. Use the URL from your browser’s location bar (with `/watch/` in it) rather than the `youtu.be` link.
fr: **YouTube** : ajouter un lien vers une vidéo YouTube embarquée depuis votre barre de recherche (incluant '/watch/') plutôt que le lien 'youtu.be'.

source: You can edit media later by going by editing an item, navigating to the **Media** tab, and clicking the edit button (pencil) for a media when editing the item.
fr: Un média peut toujours être modifié : se rendre dans la page d'édition du contenu, puis dans l'onglet **Médias** et cliquer sur le bouton d'édition (crayon).

source: You can delete any media instance from the item's edit page using the delete button (trashcan) on the upper right corner of the media block.
fr: L'instance d'un média associée à un contenu peut être supprimée grâce au bouton supprimer (poubelle) dans le coin supérieur droit du bloc média.

source: ![Image shows a close up of a media item being removed - it is red and has an undo curling arrow at the right end of the block](contentfiles/item_mediablockdelete.JPG)
fr: ![Vue rapprochée du volet de suppression d'un média](contentfiles/item_mediablockdelete.fr.png)

source: If you have more than one media instance for an item, you can reorder them by dragging and drop each media instance block, using the icon of three lines in the upper left corner of the block as the anchor when dragging.
fr: Si vous avez plus d'un média pour un contenu, vous pouvez les réorganiser en déplaçant les différents blocs média (se positionner sur l'icône représentant trois traits dans le coin supérieur gauche du bloc).

source: Omeka S uses the topmost media for an item to create thumbnail images for that item on browse and show pages.
fr: Omeka S utilise le premier média pour créer la vignette de présentation d'un contenu sur les pages de navigation et de vue des contenus.

source: Item sets
fr: Collections

source: You can only add items to existing item sets.
fr: Vous ne pouvez ajouter des contenus qu'à une collection déjà existante.

source: From the right-hand menu, click on the owner of an item set, then click the name of the item set to add the item to that set.
fr: Dans le menu situé à droite, cliquez sur le créateur de la collection, puis sur le nom de la collection pour y ajouter un contenu.

source: You can also filter item sets using the text entry bar above the list of users.
fr: Vous pouvez également filtrer les collections en utilisant la barre de recherche située au-dessus de la liste des utilisateurs.

source: To remove a connection between an item and item set, click the delete (trash can) button to the right of the item set title.
fr: Pour supprimer le lien entre un contenu et une collection, cliquer sur le bouton supprimer (poubelle) à la droite du titre de la collection.

source: ![item set tab with no item sets assigned](contentfiles/items_itemset.JPG)
fr: ![onglet collections sans collection assignée](contentfiles/items_itemset.fr.png)

source: Select sites to which to add your items.
fr: Sélectionner les sites auxquels ajouter les contenus.

source: ![item 'sites' tab with the item added to two sites. Each site is in its own row, with a delete icon on the far right of the row](contentfiles/items_addItemSite.png)
fr: ![onglet "sites" avec le contenu attribué à un site et la possibilité de l'attacher à un autre](contentfiles/items_addItemSite.fr.png)

source: To add an item to a site, select a site from the menu in the right-hand drawer. You can filter sites by searching in the field at the top of the drawer.
fr: Pour ajouter un contenu à un site, sélectionner un site dans le menu du volet de droite. Vous pouvez filtrer les sites en utilisant la barre de recherche en haut du volet.

source: If there are sites which have "auto-assign new items" turned on in their settings, you can use this tab to remove this item from those sites. Click the trash can icon on the right side of the site's row to remove it.
fr: Si le paramètre "rattacher automatiquement les nouveaux contenus" est activé pour certains sites, utiliser cet onglet pour retirer des contenus de ces sites. Cliquer sur l'icône poubelle à la droite de la ligne du site pour retirer le contenu.

source: Advanced
fr: Avancé

source: The advanced tab has two options. One lets you set a custom thumbnail for the item. The other allows you to change which user has ownership of the item.
fr: L'onglet Avancé contient deux options : l'une permet de choisir une vignette pour le contenu ; l'autre permet de modifier le propriétaire du contenu.

source: **Thumbnail**
fr: **Vignette**

source: By default, Omeka S will use the topmost media to generate a thumbnail for the item. If you want to use a non-media image for the thumbnail for an item you can set it here.
fr: Omeka S utilise par défaut le premier média attaché à un contenu pour créer sa vignette. L'onglet Avancé permet d'utiliser comme vignette une image ne faisant pas partie des médias associés.

source: ![Advanced tab with no asset selected. The tab displays a message about thumbnail creation and a button to "select" an asset](contentfiles/item_advtab.png)
fr: ![Onglet Avancé sans fichier sélectionné. On trouve sur l'onglet un encart pour la création de vignettes](contentfiles/item_advtab.fr.png)

source: When you use an asset thumbnail instead of uploading media, the asset thumbnail does not display on the item's public show page. This makes such thumbnails useful for items which have no media but which would benefit from a thumbnail for the browse view, or for items whose media does not render an elegant thumbnail, such as audio or video files.
fr: Les vignettes ainsi ajoutées ne s'affichent pas sur la page publique du contenu. Elles peuvent alors être utilisées pour les contenus qui n'ont pas de média associé mais pour lesquels une vignette est utile dans les pages de recherche et de navigation, ou pour des contenus dont les médias (des fichiers vidéo ou audio par exemple) ne permettent pas de créer une vignette élégante.

source: The assets you select from and upload as thumbnails in this tab are the same as those created for [site logos](../sites/site_theme.md#settings-options).
fr: Les éléments chargés comme vignettes par ce procédé sont les mêmes que ceux créés pour les [logos de site](../sites/site_theme.md#settings-options).

source: To assign an asset as a thumbnail, click on the Select button in the main work area of the tab. This will open a drawer on the right side.
fr: Pour sélectionner une vignette, cliquer sur le bouton Choisir : un volet s'ouvrira sur la droite.

source: ![Select drawer with upload option and two assets, both of which are images.](contentfiles/item_thumbdrawer.png)
fr: ![Onglet "Choisir" sélectionné et deux fichiers image entre lesquels choisir.](contentfiles/item_thumbdrawer.fr.png)

source: The drawer offers two options: upload a file using your browser, or select from existing assets. To select an existing asset, simply click on it and it will automatically be assigned to the item.
fr: Le volet propose deux options : charger un fichier ou sélectionner parmi les vignettes existantes. Dans le second cas, cliquer sur la vignette, qui sera automatiquement associée au contenu.

source: To remove an asset which you have assigned as a thumbnail, click the "Clear" button below the image of the asset. To replace it, click "Select" and either choose or upload a new thumbnail asset.
fr: Pour supprimer une vignette, appuyer sur le bouton Retirer sous celle-ci. Pour la remplacer, cliquer de nouveau sur Choisir.

source: **Owner**
fr: **Propriétaire**

source: The ownership of an item is usually assigned to the user account which creates the item. You can use this dropdown to reassign ownership. The dropdown will load the user names (not email addresses) of users in the installation. Select a new user and save changes.
fr: Le statut de propriétaire est généralement attribué à l'utilisateur qui crée le contenu. Le menu déroulant permet de changer cette attribution : sélectionner un autre utilisateur proposé dans le menu déroulant et sauvegarder.

source: Visibility
fr: Visibilité

source: Use the **make public/private** button (eye icon) to set whether the item is visible to the public or only to users of the Omeka S system.
fr: Utiliser les bouton **public/privé** (icône oeil) pour rendre le contenu public ou visible seulement par les utilisateurs du système Omeka S.

source: Item is public: ![make public button showing an eye icon](../content/contentfiles/item_public.png){style="display:inline;"}
fr: Le contenu est public : ![bouton public avec icône oeil](../content/contentfiles/item_public.fr.png){style="display:inline;"}

source: Item is private: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png){style="display:inline;"}
fr: Le contenu est privé : ![bouton privé avec oeil barré](../content/contentfiles/item_private.fr.png){style="display:inline;"}

source: Note that if an item is private, all the media attached is private, but an item which is public can have attached media which are set to be either public or private.
fr: Si un contenu est privé, les médias attachés le sont aussi, mais les médias d'un contenu public peuvent eux aussi être mis en statut public ou privé.

source: Edit an item
fr: Éditer un contenu

source: Once you have created an item, you can edit it at any time, either by clicking the edit icon (pencil button) or clicking on the item's title and then clicking the "Edit" button in the upper right-hand corner of the screen.
fr: Une fois le contenu créé, il peut être modifié en cliquant soit sur l'icône d'édition (crayon), soit sur le titre du contenu puis sur le bouton "Modifier ce contenu" situé dans le coin supérieur droit de la page.

source: To cancel out of editing, click the "Cancel" button in the upper right corner, between the "Delete" and "Save" buttons.
fr: Pour ne pas valider une modification, cliquer sur le bouton "Annuler" (coin supérieur droit), entre les boutons "Supprimer" et "Enregistrer".

source: ![Detail view of the top row if information and buttons on an item edit view. A red arrow points to the "Cancel" button, on the far right](contentfiles/items_cancel.JPG)
fr: ![Vue détaillée d'un contenu en modification. Une flèche rouge pointe vers le bouton "Annuler" dans le coin droit](contentfiles/items_cancel.fr.png)

source: Editing options are the same as when creating a new item, with the addition of the ability to add any media which has been saved to an item as a property:
fr: Les options d'édition sont les mêmes que les options de création d'un contenu, avec en plus la possibilité d'ajouter comme propriété un média associé au contenu :

source: Media as property
fr: Les médias comme propriété

source: Once you have created an item and added media to it, you will also have the option to use media **attached to that item** for a property.
fr: Une fois le contenu créé et ses médias ajoutés, vous pourrez utiliser un média **attaché à ce contenu** comme propriété.

source: ![A blue outline of a rectangle highlights resource options for Items, Item sets, and Media to be used as the input for the element "Description"](contentfiles/items_addmediaresource.png)
fr: ![Un rectangle bleu met en évidence les options de ressources pouvant être utilisées pour l'élément "Titre" : Contenus, Collections, Médias](contentfiles/items_addmediaresource.fr.png)

source: To use a media resource for a property, select the media option for the element (1). The drawer which opens will display all media attached to the item. Select the media which you want to use (2); this will switch the drawer to just that media (second image). Click the "Select Resource" button at the bottom of the drawer to complete the process (3).
fr: Pour utiliser un média comme propriété, sélectionner l'option média (1). Un volet affiche alors tous les médias attachés au contenu. Sélectionner le média à utiliser (2) ; le volet ne contiendra alors plus que ce média (deuxième image). Cliquer sur le bouton "Choisir une ressource" en bas du volet pour terminer l'opération (3).

source: ![Focus on the editing portion of a window for the item "Sense and Sensibility", with the elements Title and Description visible. On the right side of the window, a vertical rectangle (the drawer) is open on the right displaying five media which are attached to the item, including video, images, and text. This image contains steps 1 and 2.](contentfiles/items_mediaresource1.png)
fr: ![Vue sur la page de modification du contenu "Simone Biles -- podium". Un volet apparaît sur la droite de la page, affichant deux médias attachés au contenu. Cette capture comprend les étapes 1 et 2](contentfiles/items_mediaresource1.fr.png)

source: ![The same window as before, but now the drawer on the right displays a thumbnail of the media "Sense and Sensibility DVD Trailer" with a dark gray button labeled "select resource" at the bottom of the drawer area. This image contains step 3](contentfiles/items_mediaresource2.png)
fr: ![La même fenêtre que précédemment, mais le volet de droite affiche maintenant une vignette du média "Simone Biles -- podium 1" avec un bouton gris foncé indiquant "Choisir une ressource" en bas du volet. Cette capture représente l'étape 3](contentfiles/items_mediaresource2.fr.png)

source: Batch actions
fr: Traitements par lots

source: From the browse page of items (admin/item) you can batch edit items, using the dropdown menu on the left near the pagination buttons. You can select multiple items using the checkboxes on the left of each item's row.
fr: Depuis la page des contenus (admin/item), vous pouvez traiter des contenus par lots en utilisant le menu déroulant à côté des boutons de pagination. Vous pouvez sélectionner plusieurs contenus en utilisant les cases à cocher à côté de la ligne dédiée à chaque contenu.

source: ![A red arrow points to the dropdown for batch editing and deleting options](contentfiles/items_batch.png)
fr: ![Une flèche rouge pointe vers le menu déroulant pour le traitement par lots](contentfiles/items_batch.fr.png)

source: Batch actions are as follows:
fr: Les actions de traitement par lots sont les suivantes :

source: Edit selected: edit only the items that are selected on the page
fr: Modifier sélectionnés : ne modifie que les contenus sélectionnés sur la page

source: Edit all: edit all the items returned by a search (default is all items)
fr: Modifier tout : modifie tous les contenus d'un résultat de recherche (par défaut, l'ensemble des contenus)

source: Delete selected: delete only the items that are selected on the page
fr: Supprimer sélectionnés : ne supprime que les contenus sélectionnés sur la page

source: Delete all: delete all the items returned by a search (default is all items).
fr: Supprimer tout : supprime tous les contenus d'un résultat de recherche (par défaut, l'ensemble des contenus).

source: Choose one of these options and then click "Go".
fr: Choisir une de ces options puis cliquer sur "Traiter".

source: Batch editing
fr: La modification par lots

source: **Batch editing** items takes you to a new page. The items being edited will display on the right side in a drawer, while the batch edit form gives you the following options:
fr: L'action **Modifier par lots** envoie sur une nouvelle page. Les contenus sélectionnés sont affichés dans un volet sur la droite et le formulaire de modification des contenus propose les options suivantes :

source: Set visibility: a dropdown, select from public or not public.
fr: Modifier la visibilité : sélectionner public, non public ou pas de changement.

source: Set template: a dropdown, select from the installation's resource templates.
fr: Définir le modèle : menu déroulant permettant de sélectionner un des modèles de ressource de l'instance.

source: Set class: a dropdown, select from classes of the installed vocabularies.
fr: Définir une classe : menu déroulant permettant de sélectionner une classe parmi celles des vocabulaires de l'instance.

source: Add to item set: a dropdown, select from item sets on the installation. Add to an additional item set click in the input box again to see the remaining options.
fr: Ajouter aux collections : menu déroulant permettant de sélectionner une collection de l'instance. L'action peut être répétée en cliquant à nouveau sur la barre de recherche.

source: Remove from item set: a dropdown, select from item sets on the installation. Remove from an additional item set click in the input box again to see the remaining options.
fr: Enlever des collections : menu déroulant permettant de sélectionner une collection de l'instance. L'action peut être répétée en cliquant à nouveau sur la barre de recherche.

source: Add to sites: a dropdown, select from sites on the installation. Add to an additional site click in the input box again to see the remaining options.
fr: Ajouter aux sites : menu déroulant permettant de sélectionner un site de l'instance. L'action peut être répétée en cliquant à nouveau sur la barre de recherche.

source: Remove from sites: a dropdown, select from sites on the installation. Remove from an additional site click in the input box again to see the remaining options.
fr: Retirer des sites : menu déroulant permettant de sélectionner un site de l'instance. L'action peut être répétée en cliquant à nouveau sur la barre de recherche.

source: Clear property values: a dropdown menu with all the properties in all vocabularies, selecting from this will remove any values in that property in the affected items. Clear additional properties using the "Clear another property" button.
fr: Effacer les valeurs d'une propriété : menu déroulant contenant toutes les propriétés des vocabulaires de l'instance, permettant de retirer les valeurs d'une propriété pour les contenus concernés. L'action peut être répétée en cliquant à nouveau sur la barre de recherche.

source: Set value visibility: set the visibility of a specific property to either public or not public. Unlike the radio buttons at the top of the form, this will only affect a single property instead of the entire item. Select a property from the text field (type to begin searching), and the choose either the *public* or *not public* radio button for this option.
fr: Set value visbility : établir le statut privé ou public d'une seule propriété. Contrairement aux boutons en début de formulaire, cette action ne concerne que la propriété sélectionnée et non le contenu complet. Sélectionner une propriété dans la barre de recherche (entrer du texte pour commencer la recherche) puis choisir l'option *public* ou *non public*.

source: ![Batch edit items form, with options as described above. Everything is grayscale](contentfiles/items_batchedit.png)
fr: ![Formulaire de modification par lot, avec les options décrites ci-dessus. Tout en gris](contentfiles/items_batchedit.fr.png)

source: In addition, you can use the buttons at the bottom of the batch edit form to add properties to every item:
fr: Les boutons en bas du formulaire de modification par lots permettent d'ajouter des propriétés à tous les contenus concernés :

source: Add text value
fr: Ajouter une valeur textuelle

source: Add resource value
fr: Ajouter un lien vers une ressource

source: Add URI value.
fr: Ajouter un lien URI.

source: Selecting any of these will add a block to the form where you can select a property from the installed vocabularies and enter the value for that property.
fr: Ces actions ajoutent un bloc au formulaire qui permet de sélectionner une propriété parmi celles des vocabulaires de l'instance et d'ajouter une valeur à cette propriété.

source: ![Image depicts only the Add text value block of the batch edit form, with a dropdown labeled "select property" above an empty text field](contentfiles/items_beproperty.png)
fr: ![La capture montre seulement le bloc "Ajouter une valeur textuelle" du formulaire de modification par lot, avec le menu déroulant "Choisir la propriété" et un encart de texte vide](contentfiles/items_beproperty.fr.png)

source: Batch deleting
fr: Suppression par lots
