Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/items.po
Languages: fr

source: For the **delete actions**, a drawer will open on the right side of the screen telling you the number of items which will be deleted. Nothing will be deleted unless you click the red "Confirm Delete" button. This action cannot be undone. To opt out of deleting the items, click the "X" in the upper right corner of the deletion drawer. To confirm this action, check the "Are you sure" checkbox (for "Delete all" but not "Delete selected") and then click "Confirm Delete".
fr: L'action **supprimer** fait apparaître un volet à la droite de la page rappelant le nombre de contenus concernés. La suppression n'aura lieu que si vous cliquez sur le bouton rouge "Confirmer la suppression". Cette action ne peut pas être annulée une fois le bouton cliqué. Pour quitter l'option avant suppression, cliquer sur le "X" en haut à droite du volet de suppression. En cas d'action "Supprimer tout", cliquer sur la case à cocher "Êtes-vous sûr ?" puis sur "Confirmer la suppression".

source: ![Close up of the warning, with the text describing the number of items to be deleted in red.](contentfiles/items_batchdelwarn.png)
fr: ![Vue rapprochée du message d'alerte en rouge](contentfiles/items_batchdelwarn.fr.png)

source: Individual modules may also add batch-edit actions. Those options are noted within the documentation for each module.
fr: Certains modules individuels peuvent aussi permettre des actions d'édition par lots. Ces options sont indiquées dans la documentation associée à chaque module.
