Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/media.po
Languages: fr

source: ![Individual properties have a red eye icon to the right to allow you to toggle visibility - a red arrow points to the icon](contentfiles/item_propviz.png)
fr: ![Les propriétés individuelles ont une icône oeil (rouge) sur leur droite, pour faire varier leur visibilité - une flèche rouge pointe vers l'icône](contentfiles/item_propviz.png)

source: Advanced
fr: Avancé

source: **Thumbnail**
fr: **Vignette**

source: Not all media generate elegant thumbnails, for example PDF or text file documents, or some video files. You can use this option to set a representative thumbnail for the media which will be used on browse pages but not on the page for the item or its media.
fr: Tous les médias ne génèrent pas des vignettes satisfaisantes, comme les PDF ou les fichiers documents, ou encore certains fichiers vidéo. Cette option permet de choisir une vignette pour le média, qui sera utilisée dans les pages de navigation, mais pas sur la page du contenu ou du média lui-même.

source: The assets you select from or upload as thumbnails in this tab are the same as those created for [site logos](../admin/assets.md). A thumbnail uploaded as an asset will become available to all users of all sites. If you wish to upload a video still as a thumbnail for a specific video, you may wish to upload it as a media file attached to the item instead of as an asset.
fr: Les éléments chargés comme vignettes par ce procédé sont les mêmes que ceux créés pour les [logos de site](../admin/assets.md). Une vignette chargée comme fichier est utilisable par tous les utilisateurs de tous les sites. Si vous souhaitez charger une image de vidéo pour la vignette d'un fichier vidéo, il est peut-être plus intéressant de la charger comme média attaché au contenu que comme fichier.

source: To assign an asset as a thumbnail, click on the "Select" button in the main work area of the tab. This will open a drawer on the right side.
fr: Pour sélectionner une vignette, cliquer sur le bouton Choisir : un volet s'ouvrira sur la droite.

source: ![Select drawer with upload option and two assets, both of which are images.](contentfiles/media_thumbnail1.png)
fr: ![Onglet "Choisir" sélectionné et deux fichiers image entre lesquels choisir.](contentfiles/media_thumbnail1.png)

source: The drawer offers two options: upload a file using your browser, or select from existing assets. To select an existing asset, simply click on it and it will automatically be assigned to the media.
fr: Le volet propose deux options : charger un fichier ou sélectionner parmi les vignettes existantes. Dans le second cas, cliquer sur la vignette, qui sera automatiquement associée au média.

source: ![Edit media open to Advanced tab, where an asset which is an image of a map of the National Mall is in the main work area. Below it are buttons for Select and Clear](contentfiles/media_thumbnail2.png)
fr: ![Onglet Avancé où un fichier qui est une image d'Aly Raisman se trouve dans la zone principale. En-dessous, des boutons Choisir et Retirer](contentfiles/media_thumbnail2.png)

source: To remove an asset which you have assigned as a thumbnail, click the "Clear" button below the image of the asset. To replace it, click select and either choose or upload a new thumbnail asset.
fr: Pour supprimer une vignette, appuyer sur le bouton Retirer sous celle-ci. Pour la remplacer, cliquer de nouveau sur Choisir.

source: **Owner**
fr: **Propriétaire**

source: You can assign an owner for the media by selecting from the dropdown menu.
fr: Vous pouvez sélectionner un propriétaire pour le média dans le menu déroulant.

source: **Alt Text**
fr: **Texte alternatif (alt)**

source: You can provide alternate text for all media by typing descriptive text into the input area.
fr: Vous pouvez saisir dans ce champ un texte alternatif pour chaque média.

source: ![Edit media open to Advanced tab, showing the Alt Text input box](contentfiles/media_alttext.png)
fr: ![Onglet Avancé, on voit le champ de texte alternatif](contentfiles/media_alttext.png)

source: Batch editing
fr: Traitement par lots

source: From the media browse page, you can batch edit media, using the dropdown menu on left just above the table of media. You can select multiple items using the checkboxes on the left of each item's row.
fr: Depuis la page des médias, vous pouvez traiter des médias par lots en utilisant le menu déroulant en haut à gauche du tableau des médias Vous pouvez sélectionner plusieurs médias en utilisant les cases à cocher à côté de la ligne dédiée à chaque média.

source: ![A red arrow points to the dropdown for batch editing and deleting options](contentfiles/media_batch1.png)
fr: ![Une flèche rouge pointe vers le menu déroulant pour le traitement par lots](contentfiles/media_batch1.png)

source: Batch actions are as follows:
fr: Les actions de traitement par lots sont les suivantes :

source: Edit selected: edit only the items that are selected on the page
fr: Modifier sélectionnés : ne modifie que les contenus sélectionnés sur la page

source: Edit all: edit all the items returned by a search (default is all items)
fr: Modifier tout : modifie tous les contenus d'un résultat de recherche (par défaut, l'ensemble des contenus)

source: Delete selected: delete only the items that are selected on the page
fr: Supprimer sélectionnés : ne supprime que les contenus sélectionnés sur la page

source: Delete all: delete all the items returned by a search (default is all items).
fr: Supprimer tout : supprime tous les contenus d'un résultat de recherche (par défaut, l'ensemble des contenus).

source: Choose one of these options and then click "Go".
fr: Choisir une de ces options puis cliquer sur "Traiter".

source: **Batch editing** media takes you to a new page. The media being edited will display on the right side in a drawer, while the batch edit form gives you the following options:
fr: L'action **Modifier par lots** envoie sur une nouvelle page. Les médias sélectionnés sont affichés dans un volet sur la droite et le formulaire de modification propose les options suivantes :

source: Set visibility: radio buttons, select from Public, Not public, or No change.
fr: Modifier la visibilité : sélectionner public, non public ou pas de changement.

source: Set template: a dropdown, select from the installation's resource templates.
fr: Définir le modèle : menu déroulant permettant de sélectionner un des modèles de ressource de l'instance.

source: Set class: a dropdown, select from classes of the installed vocabularies.
fr: Définir une classe : menu déroulant permettant de sélectionner une classe parmi celles des vocabulaires de l'instance.

source: Clear language: a checkbox.
fr: Effacer la langue : une case à cocher.

source: Set language: a text entry box.
fr: Définir la langue : un champ de texte.

source: Clear property values: a dropdown menu with all the properties in all vocabularies, selecting from this will remove any values in that property in the affected items. Clear additional properties using the "Clear another property" button.
fr: Effacer les valeurs d'une propriété : menu déroulant contenant toutes les propriétés des vocabulaires de l'instance, permettant de retirer les valeurs d'une propriété pour les contenus concernés. L'action peut être répétée en cliquant à nouveau sur la barre de recherche.

source: ![Batch edit medias form, with options as described above. Everything is grayscale](contentfiles/media_batchedit.png)
fr: ![Formulaire de modification par lot, avec les options décrites ci-dessus. Tout en gris](contentfiles/media_batchedit.png)

source: In addition, you can use the bottoms at the bottom of the batch edit form to add properties to every media:
fr: Les boutons en bas du formulaire de modification par lots permettent d'ajouter des propriétés à tous les médias concernés :

source: add text value
fr: ajouter une valeur textuelle

source: add resource value
fr: ajouter un lien vers une ressource

source: add URI value.
fr: ajouter un lien URI.

source: Selecting any of these will add a block to the form where you can select a property from the installed vocabularies and enter the value for that property.
fr: Ces actions ajoutent un bloc au formulaire qui permet de sélectionner une propriété parmi celles des vocabulaires de l'instance et d'ajouter une valeur à cette propriété.

source: For the **delete actions**, a drawer will open on the right side of the screen telling you the number of media which will be deleted. Nothing will be deleted unless you click the red "Confirm Delete" button. This action cannot be undone. To opt out of deleting the media, click the "X" in the upper right corner of the deletion drawer. To confirm delete, check the "Are you sure" checkbox and then click "Confirm Delete".
fr: L'action **supprimer** fait apparaître un volet à la droite de la page rappelant le nombre de contenus concernés. La suppression n'aura lieu que si vous cliquez sur le bouton rouge "Confirmer la suppression". Cette action ne peut pas être annulée une fois le bouton cliqué. Pour quitter l'option avant suppression, cliquer sur le "X" en haut à droite du volet de suppression. En cas d'action "Supprimer tout", cliquer sur la case à cocher "Êtes-vous sûr ?" puis sur "Confirmer la suppression".

source: ![Close up of the warning that 2 medias will be deleted.](contentfiles/media_batchdelwarn.png)
fr: ![Vue rapprochée du message d'alerte en rouge concernant 3 médias](contentfiles/media_batchdelwarn.png)

source: Media file types
fr: Types de fichiers média

source: Omeka S uses HTML 5 audio and video tags when embedding audio and video. This means generally better support on newer browsers, but worse support on older ones and for older video formats especially.
fr: Omeka S utilise des balises audio et vidéo HTML 5 pour embarquer des fichiers audio et vidéo. Ces contenus sont mieux gérés par les navigateurs récents, mais moins bien sur les plus anciens et plus particulièrement pour des formats vidéo datés.

source: By choosing from a few well-supported formats for audio and video files, you can provide a much better experience for your users across different platforms and devices.
fr: En sélectionnant quelques formats bien gérés pour les fichiers audio et vidéo, vous rendrez l'expérience de vos utilisateurs meilleure sur tous les appareils et plateformes.

source: Video
fr: Vidéo

source: The MP4 container (.mp4 or .m4v) is the best-supported video format across browsers and platforms. By far the best choice for video that will work well across different browsers are .mp4 files with H.264 video and AAC audio.
fr: Le conteneur MP4 (.mp4 ou .m4v) est le format vidéo le mieux géré par les différents navigateurs et plateformes. Les fichiers .mp4 avec vidéo H.264 et audio AAC constituent de loin le meilleur choix, et fonctionneront avec les différents navigateurs.

source: .mp4 files can contain other types of video (or audio), including newer ones like H.265, and older ones like MPEG-4 Visual. Any video codec other than H.264 has *much* worse browser support.
fr: Les fichiers .mp4 peuvent contenir d'autres types de vidéo (ou d'audio), dont de plus récents comme H.265 et de plus anciens comme MPEG-4 Visual. Tout codec autre que H.264 est *nettement* moins bien géré par les navigateurs.

source: Other formats
fr: Autres formats

source: The WebM (.webm) container with VP8 or VP9 video is supported by several browsers, but Internet Explorer and Safari are notable and significant exceptions.
fr: Le conteneur WebM (.webm) avec video VP8 ou VP9 est géré par plusieurs navigateurs, mais pas Internet Explorer ni Safari.

source: The Ogg (.ogg, .ogv) container and Theora video are supported by some browsers, but there is little support among mobile browsers and no support at all on IE or Safari.
fr: Le conteneur Ogg (.ogg, .ogv) avec vidéo Theora sont gérés par certains navigateurs, mais peu par les navigateurs mobiles et pas du tout par IE ou Safari.

source: MP3 (.mp3) is one of the most common formats for compressed audio, and it enjoys wide support across browsers and from desktop to mobile.
fr: Le format MP3 (.mp3) est un des plus courants et est géré par la plupart des navigateurs, y compris mobiles.

source: AAC is a somewhat newer format than MP3, but it also is well supported in most browsers. The widest support is for AAC in an MP4 container (this usually carries the file extension .m4a), with somewhat lesser support for other containers and formats (often found with a .aac extension).
fr: Le format AAC est plus récent que le format MP3, mais est également bien géré par la plupart des navigateurs. Le mieux géré est le format AAC dans un conteneur MP4 (dont l'extension est généralement .m4a), avec une moins bonne tolérance pour d'autres conteneurs et formats (souvent avec une extension .aac).

source: WAV or WAVE (.wav) audio is supported by most browsers (with the notable exception of Internet Explorer). The major downside for use on the Web is that WAV audio is uncompressed, so it takes up vastly more storage space and bandwidth than the compressed formats listed above. If feasible, it’s best to use one of those instead of WAV.
fr: Les audio WAV ou WAVE (.wav) sont gérés par la plupart des navigateurs (à l'exception notable d'Internet Explorer). Leur défaut majeur est que ces formats audio ne sont pas compressés et utilisent beaucoup plus d'espace de stockage et de bande passante que les formats compressés susmentionnés. Si possible, les utiliser plutôt que WAV.

source: Ogg Vorbis audio (.ogg, .oga) is a compressed format like MP3 and AAC, but it has much less widespread support. Expect Vorbis audio to only work on Firefox, Chrome, and Android.
fr: Ogg Vorbis audio (.ogg, .oga) est un format compressé comme MP3 ou AAC, mais il est nettement moins largement géré. Vorbis ne fonctionnera probablement que sur Firefox, Chrome et Android.

source: Opus (.opus) is one of the newer available audio formats. For the time being, it has a similar problem as Vorbis: a lack of support among browsers, but there are signs that Opus could gain more support in the future.
fr: Opus (.opus) est un des formats audio les plus récents. À ce stade, il présente les mêmes difficultés que Vorbis : il est peu géré par les navigateurs, mais pourrait l'être plus largement à l'avenir.

source: Legacy formats
fr: Formats hérités

source: There are a lot of media files out there that aren’t in any of the formats listed here. With certain add-ons or on certain platforms (like Safari on the Mac in many cases), it can be possible to embed some of those files with HTML 5, but expect many or most users to be unable to play them. Browser plugins can also play many file types, but browsers are steadily reducing and removing their support for these kinds of plugins.
fr: Il existe de nombreux fichiers média qui ne sont dans aucun des formats listés ci-dessus. Avec certains modules complémentaires ou sur certains plateformes (comme Safari sur Mac dans de nombreux cas), il est possible d'embarquer certains de ces fichiers avec HTML 5. Toutefois, il faut s'attendre à ce que la plupart des utilisateurs ne puissent pas les lire. Certains plugins de navigateurs peuvent aussi lire de nombreux types de fichiers, mais les navigateurs gèrent de moins en moins ce type de modules.

source: For old media, often the best choice is to just present a download link so the viewer can play or convert the file locally. This is what Omeka does when it doesn’t recognize a file type or when a browser reports that it can’t play a file.
fr: Pour des médias anciens, il est préférable de simplement proposer un lien de téléchargement afin que l'utilisateur puisse lire ou convertir le fichier en local. C'est ce que fait Omeka lorsqu'il ne reconnaît pas un type de fichier ou quand un navigateur ne peut pas le lire.

source: File formats which result in a download link, rather than an embedded playback, include:
fr: Les formats qui produisent un lien de téléchargement plutôt qu'une lecture embarquée comprennent :

source: Video: .avi, .wmv
fr: Vidéo : .avi, .wmv

source: Audio: .aiff (except Safari), .midi, .wha
fr: Audio : .aiff (sauf sur Safari), .midi, .wha
