Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/media.po
Languages: fr

source: Media
fr: Médias

source: Omeka S accepts most files and file types, and can be customized to accept or reject file types of your choice. You may wish to format your multimedia files according to what can best be embedded and streamed in modern browsers; see the [Media file types section at the end of this page](#media-file-types). If you are having difficulty or are seeing file-validation errors, you can adjust the accepted file types and extensions in the [Allowed media and files options of the Security Settings](../admin/settings.md#security).
fr: Omeka S supporte la plupart des fichiers et types de fichiers et peut être paramétré pour accepter ou rejeter certains types de fichiers. Vous pouvez par exemple vouloir formater vos fichiers multimédia afin qu'ils soient aisément embarqués et lus dans des navigateurs modernes ; voir la section sur les [types de fichiers media](#media-file-types) au bas de cette page. Si vous rencontrez des difficultés ou constatez des erreurs de validation de fichiers, vous pouvez adapter les types de fichiers et extensions acceptés dans les paramètres de sécurité [médias et fichiers autorisés](../admin/settings.md#security).

source: Media are only created by adding them to an item; media cannot exist independently. If you wish to upload files unattached to items, see the [Assets page](../admin/assets.md).
fr: Les médias sont seulement créés par association à un contenu. Un média ne peut exister seul. Si vous souhaitez charger des fichiers détachés des contenus, voir l'onglet [Fichiers](../admin/assets.md).

source: To view the media associated with an item, click on the media’s name in the right-hand sidebar on the item view page.
fr: Pour voir le média associé à un contenu, cliquer sur le nom du média dans la barre latérale de droite de la page du contenu.

source: To view all media in the installation, navigate to the **Items** section first. The **Media** subsection will appear below Items in the left-hand navigation.
fr: Pour voir tous les médias de l'instance, se rendre dans la section **Contenus** de la navigation, la sous-section **Médias** s'affiche en-dessous.

source: View media
fr: Voir les médias

source: To browse media, first click on Items in the left-hand navigation. In that sidebar, an option for Media will appear under the Item button (you may have to click on the triangle to expand the menu below Items).
fr: Pour parcourir les médias, cliquer sur Contenus dans la barre de navigation latérale. Une option Médias apparaît sous le bouton des contenus (vous devrez peut-être cliquer sur le triangle pour étendre le menu au-delà des Contenus).

source: ![The Resources section of the navigation, with light blue text on a dark blue background. Below the option for items, indented, is a navigation option for Media. It has no representative icon, unlike the other options.](contentfiles/media-browsenav.png)
fr: ![La section Contenus de la navigation, avec du texte bleu clair sur un fond bleu foncé. En-dessous des contenus, indenté, se trouve l'onglet Médias. Il n'a pas d'icône.](contentfiles/media-browsenav.png)

source: Media are displayed in a table. Each media is a row, with columns for:
fr: Les médias sont affichés dans un tableau. Chaque média constitue une ligne, avec des colonnes pour :

source: a checkbox to select the media
fr: une case à cocher pour sélectionner le média

source: the **Title**
fr: le **Titre**

source: icons to **edit** (pencil), **delete** (trash can), or see **details** (ellipsis)
fr: les icônes pour **modifier** (crayon), **supprimer** (poubelle) ou voir les **détails ** (points de suspension)

source: the media's **Class**
fr: la **Classe** du média

source: the media's **Owner**
fr: le **Propriétaire** du média

source: and the date the media was **Created**.
fr: et la date à laquelle le média a été **Créé**.

source: ![The browse media table displaying 5 items. All of the media have titles that are mediawiki URLs, and all are owned by the user Megan.](contentfiles/media_browse.png)
fr: ![Le tableau des médias avec 10 contenus. Tous les médias ont des titres qui sont des URLs mediawiki, et ont tous comme propriétaire l'utilisateur Mégan](contentfiles/media_browse.png)

source: Options for navigating and creating items display above the table of items:
fr: Options de navigation et de création d'éléments au-dessus de la table des médias :

source: On the left side is a display for the number of pages of media, with forward and back arrows. The current page number is an editable field - enter any valid page number and hit return/enter on your keyboard to go to that page.
fr: Sur la gauche, on trouve le nombre de pages de médias, avec flèches avant et arrière. Le numéro de la page en cours de lecture est un champ modifiable - saisir un numéro de page valide et appuyer sur entrée pour se rendre à cette page.

source: In the center top is a button for [Advanced Search](../search.md#media-advanced-search).
fr: En haut au milieu, vous trouvez un bouton pour la [Recherche avancée](../search.md#media-advanced-search).

source: Just above the table on the right are options for sorting media, with two dropdown menus. The first lets you select between **Title**, **Class**, **Owner**, **(date) Created**, and **Size**; the second allows you to sort ascending or descending. To apply, click the "Sort" button.
fr: Juste au-dessus du tableau vers la droite sont les options de tri des médias, avec deux menus déroulants. Le premier permet de choisir entre le **Titre**, la **Classe**, le **Propriétaire**, la date à laquelle le média a été **Créé** et la **Taille** ; le second menu permet de trier par ordre croissant ou décroissant. Pour appliquer, cliquer sur le bouton "Trier".

source: Clicking on the title of any media will take you to its metadata page. This page displays any metadata in the main work area, with a sidebar on the right listing the visibility, associated item (an active link), date created, MIME type, Size, Ingester, Source, and links to the file derivatives.
fr: Cliquer sur le titre d'un média ouvre sa page de métadonnées. Cette page affiche les métadonnées dans sa partie principale, avec un volet latéral droit listant la visibilité, le contenu associé (un lien actif), la date de création, le type MIME, la taille, l'ingéreur, la source et des liens vers les fichiers alternatifs.

source: ![Media view page for a mediawiki file. The image is of a grup of people in late 19th century clothing, from left to right a a women standing and facing a standing man holding a small child while reaching out to the woman, with another man standing and smiling behind the man with the child. On the right hand side of the image is the database information for the media](../content/contentfiles/media_view.png)
fr: ![Exemple d'une image de gymnastique. À droite, on trouve les informations sur le média](../content/contentfiles/media_view.png)

source: Add media
fr: Ajouter des médias

source: Media can only be added via an [item](../content/items.md). Options for adding media to your items include uploading a file, or directly attaching content with a URL, oEmbed, YouTube URL, IIIF URL, or by writing HTML using the HTML editor.
fr: Les médias peuvent uniquement être ajoutés en passant par un [contenu](../content/items.md). Les options d'ajout de médias sont le chargement d'un fichier, le fait d'attacher un contenu via une URL, oEmbed, Youtube URL, IIIF URL, ou l'utilisation de l'éditeur HTML.

source: At the media adding stage, the only metadata that can be entered is a Title. If you wish to further describe each file, you can edit it after it has been uploaded.
fr: Au moment de l'ajout du média, la seule métadonnée qui peut être fournie est le Titre. Le fichier peut être décrit plus avant une fois qu'il a été chargé.

source: Media thumbnails
fr: Les vignettes de médias

source: Thumbnails are automatically created for many file types. Thumbnail creation relies on the ability of your [chosen thumbnail utility](../configuration.md#thumbnails) (the default being ImageMagick) and which file types it can process. Look up the utility you are using (such as ImageMagick, Imagick, or GD) to find out which file types it supports.
fr: Les vignettes sont créées automatiquement dans le cas de nombreux types de fichiers. La création de vignettes repose sur le [créateur de vignette retenu](../configuration.md#thumbnails) (par défaut ImageMagick) et sur le type de fichiers qu'il peut traiter. Rechercher le créateur utilisé (comme ImageMagick, Imagick ou GD) pour voir quels types de fichiers sont tolérés.

source: If you wish your item to have a generic thumbnail (such as an icon of a book, or a musical note for an audio file), you can upload those default images as assets, then attach them manually to files using the [Advanced tab in the Item editing screen](../content/items.md#advanced).
fr: Si vous souhaitez que votre contenu est une vignette générique (comme une icône de livre, ou une note de musique pour un fichier audio), vous pouvez télécharger ces images par défaut comme fichiers, puis les attacher manuellement à des contenus en passant par l'onglet [Avancé de la page de modification des contenus](../content/items.md#advanced).

source: File size limitations
fr: Limitations de la taille des fichiers

source: Omeka S imposes no file size limitations. Your server, however, may have restrictions on file upload sizes or speeds that may be causing problems. These limitations vary from server to server and we cannot change this for you. If you have a problem uploading media, please first check with your hosting service or your local server administrator.
fr: Il n'y a pas de limite de taille des fichiers dans Omeka S. Votre serveur peut toutefois avoir des restrictions de taille de fichiers ou de vitesse de chargement qui causent des problèmes. Ces limites varient de serveur à serveur et nous ne pouvons rien y faire. Si vous rencontrez des difficultés dans le chargement des médias, vérifiez d'abord auprès de votre service d'hébergement ou de votre administrateur de serveur local.

source: Edit media
fr: Modifier des médias

source: To edit existing media, you can:
fr: Pour modifier des médias existants, vous pouvez :

source: Go to the Browse page and click the pencil/edit icon for the media's row
fr: Aller à la page de navigation des médias et cliquer sur le crayon/bouton modifier dans la ligne correspondante

source: Go to the Media browse page, click on the title to view the media's metadata and then click the "Edit media" button in the upper right hand corner
fr: Aller à la page de navigation des médias, cliquer sur le titre pour voir les métadonnées du média puis cliquer sur le bouton "Modifier ce média" dans le coin supérieur droit

source: Click on the media's name in the right-hand sidebar of an item's page to go to the media's metadata, and then click on "Edit media" from there.
fr: Cliquer sur le nom du média dans le volet latéral droit d'une page de contenu pour se rendre sur la page des métadonnées d'un média, puis cliquer sur "Modifier ce média".

source: Editing media is very similar to editing [items](../content/items) or [item sets](../content/item-sets).
fr: Modifier un média est très similaire à modifier un [contenu](../content/items) ou une [collection](../content/item-sets).

source: ![Edit media page, with no properties loaded](../content/contentfiles/media_edit.png)
fr: ![Page d'édition d'un média, sans propriétés chargées](../content/contentfiles/media_edit.png)

source: Values
fr: Valeurs

source: If desired, you can select a resource template from the drop-down menu. Resource templates are defined by site administrators and editors.
fr: Si vous le souhaitez, vous pouvez sélectionner un modèle de ressource dans le menu déroulant. Les modèles de ressource sont définis par les administrateurs de sites et les éditeurs.

source: If using a resource template, the class should automatically load.
fr: Si vous utilisez un modèle de ressource, la classe se charge automatiquement.

source: If not using a resource template, you may select a class from the dropdown menu (these are populated from the [Vocabularies](vocabularies.md) in your installation).
fr: Si vous n'utilisez pas de modèle de ressource, vous pouvez sélectionner une classe depuis le menu déroulant (les classes sont générées par les [Vocabulaires](vocabularies.md) de votre instance).

source: Add information to the properties which load. If you do not select a resource template or class, the Dublin Core properties Title and Description will load automatically.
fr: Ajouter des valeurs aux propriétés chargées. Si vous n'avez pas sélectionné de modèle de ressource ou de classe, les propriétés par défaut sont les propriétés Dublin Core Titre et Description.

source: You may add text, a resource from the installation, or an external link in each field.
fr: Dans chaque champ, vous pouvez ajouter du texte, un lien vers une ressource de l'instance ou un lien externe.

source: Note that if you add the property `dcterms:title`, its contents will replace the autogenerated title of the media. This is useful if dealing with url or media uploads with auto-generated names.
fr: À noter que si vous ajoutez une propriété 'dcterms:title', son contenu remplace le titre autogénéré du média. Cette fonctionnalité est utile pour les url ou médias avec des noms par défaut.

source: **Text** fields allow for unformatted text entry.
fr: Les champs de **Texte** permettent de saisir du texte libre.

source: ![image of text input field with keyboard icon indicating text input, the globe icon for setting language, and a trashcan delete icon](contentfiles/items_textedit.png)
fr: ![image du champ de texte avec l'icône clavier indiquant qu'il s'agit de texte, le globe terrestre pour le choix de la langue et l'icône poubelle de suppression](contentfiles/items_textedit.png)

source: You can indicate the language for the content of an input using the globe symbol above the input (see the red arrow in the image below). Click on the globe icon to activate a text field, then enter the [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) code for the language in which the text is written.
fr: Pour indiquer la langue du contenu d'un champ, utiliser l'icône globe terrestre au-dessus du champ (voir la flèche rouge ci-dessous). Cliquer sur le globe pour activer un champ de texte, puis saisir le code langue [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) correspondant.

source: ![Red arrow points to the globe icon and a text entry field highlighted in blue](contentfiles/item_lang.png)
fr: ![Flèche rouge pointant vers l'icône globe terrestre et un champ de texte surligné en bleu](contentfiles/item_lang.png)

source: **Omeka Resource** fields create an internal link between the resource you are creating and the resource that fills that field.
fr: Les champs **Ressource Omeka** permettent de créer un lien interne entre la ressource créée et celle qui remplit le champ.

source: You have the option to use either an item, another media, or an item set. Once you select an item or item set, detailed information will load, and you must click "Select resource" to finish linking the resources. You can also click the "X" button in the upper right-hand corner to go back to the list of items or item sets.
fr: Vous pouvez lier un contenu, un autre média ou une collection. Une fois la ressource sélectionnée, des informations détaillées s'affichent, et il faut cliquer sur "Choisir une ressource" pour finir de créer le lien. Vous pouvez aussi cliquer sur le bouton "X" dans le coin supérieur droit pour retourner à la liste des contenus et collections.

source: ![Select Item menu with list of items to link in edit media view](contentfiles/media_addresource.png)
fr: ![Menu de sélection de contenus avec la liste des contenus à lier au média](contentfiles/media_addresource.png)

source: If you are using an Item resource for the property, you will have additional options for finding the item you want in the drawer. Open these options by clicking the triangle button next to the phrase "Filter search".
fr: Si vous utilisez un contenu comme propriété, d'autres façons de trouver la ressource s'affichent dans le volet droit. Accéder à ces options en cliquant sur le triangle à côté de la phrase "Filtre de recherche".

source: ![Select Item drawer top options, with a red arrow around a gray triangle button to the right of the phrase "Filter search"](contentfiles/items_filtersearch.png)
fr: ![Flèche rouge pointant vers le triangle gris à droite de la phrase "Filtre de recherche"](contentfiles/items_filtersearch.png)

source: This will open a menu below the button with the following options to filter the items in the drawer:
fr: Cette action ouvre un menu en-dessous du bouton avec les options suivantes pour filtrer les contenus :

source: Filter by class: a dropdown where you can select any class provided by the vocabularies on the installation;
fr: Filtrer par classe : menu déroulant dans lequel on peut sélectionner une classe fournie par les vocabulaires de l'instance ;

source: Filter by item set: a dropdown where you can limit the items displayed in the drawer to only those associated with a particular item set
fr: Filtrer par collection : un menu déroulant permettant de limiter les contenus affichés à ceux d'une collection spécifique

source: Filter by item ID: a search field where you can input the ID of the item you want to use. You can find an item's ID in the url of it's edit page; if you are editing the item and the url is `admin/item/11547/edit` then the item's ID is 11547.
fr: Filtrer par ID de contenu : un champ de recherche où saisir l'ID du contenu à lier. L'ID de l'item se trouve dans l'url de sa page de modification ; si l'url de la page de modification est 'admin/item/1157/edit', alors l'ID de l'item est 11547.

source: ![options as above described](contentfiles/item_addresItem.png)
fr: ![les options décrites ci-dessus](contentfiles/item_addresItem.png)

source: Item resources also have an option for "Quick add". When this switch is flipped, all of the items in the drawer have a checkbox. You can use these checkboxes to add multiple items as a property at once. Note that you can only edit one property at a time, so all of the items must populate the same property (ex, Creator, Has Part).
fr: Les contenus à lier font aussi apparaître une option "Ajout rapide". Lorsque cette option est activée, une case à cocher apparaît à côté de chaque contenu du volet. Cette case permet d'ajouter plusieurs contenus à la fois. Toutefois, on ne peut modifier qu'une propriété à la fois, il faut donc que tous les contenus cochés relèvent bien de la même propriété (e.g. Créateur, Contributeur).

source: ![a red arrow points to the slider button for "Quick add". The two items visible have an empty checkbox to the left of their representative thumbnail](contentfiles/items_quickadd.png)
fr: ![Une flèche rouge indique le bouton "Ajout rapide". Une case à cocher apparaît à la gauche de chaque contenu visible.](contentfiles/items_quickadd.png)

source: **URI** fields link to an external website or online resource.
fr: Les champs **URI** permettent de lier un contenu à un site internet externe ou à une ressource en ligne.

source: You may add other fields by selecting a property from the list on the right. Browse fields by vocabulary (Dublin Core, Bibliographic Ontology, etc), or search in the **Filter properties** bar above the list of properties and vocabularies.
fr: Vous pouvez ajouter d'autres champs en sélectionnant une propriété dans la liste située à droite, en parcourant les champs par vocabulaire (Dublin Core, Bibliographic Ontology, etc.) ou en faisant une recherche dans la barre **filtrer les propriétés** qui se trouve au-dessus de la liste des vocabulaires.

source: **Language**: You can indicate the language for the content of an input using the globe symbol above the input (see the red arrow in the image below). Click on the globe to activate a text field, then enter the [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) code for the language in which the text is written.
fr: **Langue** : Pour indiquer la langue du contenu d'un champ, utiliser l'icône globe terrestre au-dessus du champ (voir la flèche rouge ci-dessous). Cliquer sur le globe pour activer un champ de texte, puis saisir le code langue [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) correspondant.

source: You can add properties by selecting from the list on the right side of the screen. You can either browse fields by vocabulary (Dublin Core, Bibliographic Ontology, etc), or search in the **Filter properties** bar above the list of properties and vocabularies.
fr: Vous pouvez ajouter d'autres champs en sélectionnant une propriété dans la liste située à droite, en parcourant les champs par vocabulaire (Dublin Core, Bibliographic Ontology, etc.) ou en faisant une recherche dans la barre **filtrer les propriétés** qui se trouve au-dessus de la liste des vocabulaires.

source: Automatically generated metadata, such as source, visibility, and part of item, cannot be edited.
fr: Les métadonnées générées automatiquement, comme la source, la visibilité et le fait d'être rattaché à un contenu ne peuvent pas être modifiées.

source: Use the **make public/private** button (eye icon) to set whether the media is visible to the public or only to users of the Omeka S install.
fr: Utiliser les bouton **public/privé** (icône oeil) pour rendre le contenu public ou visible seulement par les utilisateurs du système Omeka S.

source: Media is public: ![make public button showing an eye icon](../content/contentfiles/item_public.png){style="display:inline;"}
fr: Le contenu est public : ![bouton public avec icône oeil](../content/contentfiles/item_public.png){style="display:inline;"}

source: Media is private: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png){style="display:inline;"}
fr: Le contenu est privé : ![bouton privé avec oeil barré](../content/contentfiles/item_private.png){style="display:inline;"}

source: Note that if an item is private, all the media attached is private, but an item that is public can have attached media which are set to be either public or private.
fr: Si un contenu est privé, les médias attachés le sont aussi, mais les médias d'un contenu public peuvent eux aussi être mis en statut public ou privé.

source: You can set individual properties as visible using the eye icon for each property. Note that properties set to private are still visible to Global Admins, Site Admins, and Editors will be able to see properties even when set to private. Authors will be able to see all properties on items they own, but will not see private properties created by other users.
fr: Vous pouvez gérer la visibilité de propriétés individuelles en utilisant l'icône oeil. Les propriétés dont le statut est privé demeurent visibles pour les administrateurs généraux, les administrateurs de sites et les éditeurs. Les auteurs peuvent voir toutes les propriétés des contenus dont ils sont propriétaires mais ne peuvent pas voir les propriétés privées créées par d'autres.

source: In the image below, the first property (Title) is public as indicated by the open eye icon. The second property (Description) is private as indicated by the slashed-through eye icon. Clicking or hitting enter on the eye icon toggles between public and private.
fr: Dans l'exemple ci-dessous, la première propriété (Titre) est publique, comme l'indique l'icône oeil ouvert. La deuxième propriété (Description) est privée, comme l'indique l'icône oeil barré. Cliquer sur l'icône oeil fait alterner entre les statuts public et privé.
