Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/resource-template.po
Languages: fr_fr

source: Resource Templates
fr_fr: Modèles de ressource

source: A **Resource template** is a set of pre-defined properties, optionally with a Class, to guide item creation and the interpretation of properties.
fr_fr: Un **Modèle de ressource** est un ensemble prédéfini de propriétés, associé ou non à une classe, et guidant la création de contenus ainsi que l'interprétation des propriétés.

source: Resource templates are managed from the administrative dashboard, accessed through the left-hand navigation under the section labeled **Resources**.
fr_fr: Les modèles de ressource sont gérés via le tableau de bord administratif : on y accède par la barre latérale gauche, sous la section intitulée **Contenus**.

source: ![Basic view of resource templates tab, showing the column titles and one template](contentfiles/templates_browse.png)
fr_fr: ![Vue de base de l'onglet des modèles de ressource avec la colonne des titres et deux modèles](contentfiles/templates_browse.png)

source: On the left side above the table is a display for the number of pages of items, with forward and back arrows. The current page number is an editable field - enter any valid page number and hit return/enter on your keyboard to go to that page.
fr_fr: En haut à gauche du tableau, on trouve le nombre de pages de contenus, avec des flèches avant et arrière. Le numéro de la page en lecture est un champ modifiable - saisir un numéro de page valide et appuyer sur la touche entrée pour se rendre sur cette page.

source: On the right side above the table are two drop-down menus which let you sort resource templates. You can sort by: **label**, **class**, **owner**, or number of **items** assigned to a template, and have these display in either ascending or descending order.
fr_fr: En haut à droite du tableau, on trouve deux menus déroulants qui permettent de trier les modèles de ressource. Ils peuvent être triés par **libellé**, **classe**, **propriétaire** ou nombre de **contenus**, et ces options peuvent être organisées par ordre croissant ou décroissant.

source: You can use the icons in each template’s row to: **edit** (pencil), **delete** (trash can), or **view details** (ellipsis). If you click on the number of items listed for a template, it will take you to a list of all those items.
fr_fr: Pour chaque modèle, vous pouvez utiliser les icônes de la ligne afin de **modifier** (crayon), **supprimer** (poubelle) ou afficher les **détails** (points de suspension). Pour accéder à la liste des contenus associés à un modèle, cliquer sur le nombre de contenus dans la barre latérale ouverte via les points de suspension.

source: [This screencast](https://vimeo.com/290924872) gives an overview of creating and applying resource templates:
fr_fr: [Cette vidéo](https://vimeo.com/290924872) donne un aperçu du processus de création et d'application des modèles de ressource :

source: All Omeka S installations include a "Base Resource" template which maps to the metadata fields required by the [Digital Public Library of America (DPLA)](https://dp.la/). It will display in the table of resource templates as "Base Resource" with no owner.
fr_fr: Toutes les instances d'Omeka S comprennent un modèle "Base Resource" qui intègre les champs de métadonnées requis par la [Digital Public Library of America (DPLA)](https://dp.la/). Ce modèle apparaît dans le tableau des modèles de ressource, sans propriétaire.

source: ![Base resource template displayed in the table of templates](contentfiles/templates_base1.png)
fr_fr: ![Modèle de Base Resource dans la table des modèles](contentfiles/templates_base1.png)

source: The Base Resource template contains the following Dublin Core fields: Title; Rights; Type; Creator; Date; Description; Format; Language; Spatial Coverage (Place); Publisher; Alternative Title: Contributor; Extent; Identifier; Relation; Is Replaced By; Replaces; RightsHolder; Subject; Temporal Coverage.
fr_fr: Le modèle Base Resource contient les champs Dublin Core suivants : Titre ; Droits ; Type ; Créateur ; Date ; Description ; Format ; Langue ; Couverture spatiale (Place) ; Éditeur ; Titre alternatif ; Contributeur ; Importance matérielle ; Identifiant ; Relation ; Est remplacé par ; Remplace ; Détenteur des droits ; Sujet ; Couverture temporelle.

source: Create a resource template
fr_fr: Créer un modèle de ressource

source: From the **Resource templates** tab in the Admin Dashboard, click the "Add new resource template" button.
fr_fr: Dans l'onglet **Modèles de ressource** du tableau de bord Admin, cliquer sur le bouton "Ajouter un nouveau modèle de ressource".

source: The New resource template page will load with options for Label, suggested class, and the properties **Title** (`dcterms:title`) and **Description** (`dcterms:description`).
fr_fr: La page du nouveau modèle de ressource s'affiche avec les options Libellé, Classe suggérée et les propriétés **Titre** (`dcterms:title`) et **Description** (`dcterms:description`).

source: ![The Add resource template page, with fields for title, class, and properties Title and Description pre-loaded](contentfiles/templates_add.png)
fr_fr: ![La page d'ajout d'un modèle de ressource avec les champs de libellé, de classe et les propriétés Titre et Description](contentfiles/templates_add.png)

source: In the Label property, type the label for your new template. This will be the text displayed in the dropdown for resource templates when creating an item, so be sure that the label is clear.
fr_fr: Dans le champ Libellé, saisir l'intitulé de votre nouveau modèle de ressource. Ce libellé apparaîtra dans le menu déroulant des modèles de ressource pour la création d'un nouveau contenu : il faut donc s'assurer de la clarté de ce libellé.

source: If desired, select a class to associate with the template.
fr_fr: Si nécessaire ou souhaité, sélectionner une classe associée au modèle.

source: Add properties from the list of vocabularies in the menu on the right side of the screen. You can filter properties in the text box or select from a specific vocabulary using the arrows to the right of the vocabulary names.
fr_fr: Ajouter les propriétés à partir des listes de vocabulaires dans le menu à droite de la page. Les propriétés peuvent être filtrées via le champ de texte ou sélectionnées dans un vocabulaire spécifique en utilisant les flèches à la droite des noms des vocabulaires.

source: If desired, modify the property (see Property options, below).
fr_fr: Si besoin, la propriété peut être modifiée (voir ci-dessous Options des propriétés).

source: Be sure to "Save" your resource template before leaving this page.
fr_fr: S'assurer de bien sauvegarder ("Ajouter") le modèle de ressources avant de quitter la page.

source: Property options
fr_fr: Options des propriétés

source: You can modify the display label, comment on the label, set a property as required, and set the default data type for each property in your template.
fr_fr: Vous pouvez modifier le libellé d'une propriété, commenter ce libellé, ajuster une propriété et établir des types de données par défaut pour chaque propriété d'un modèle de ressource.

source: To do this, click the edit (pencil) icon in the row for the property you wish to modify. This will open a drawer on the right side of the screen with the ability to edit the properties.
fr_fr: Pour ce faire, cliquer sur l'icône modifier (crayon) sur la ligne de la propriété concernée. Un volet latéral s'ouvre à droite de la page, qui permet de modifier les propriétés.

source: ![The property options drawer for Title with no changes made, options as described below](contentfiles/template_configdrawer.png)
fr_fr: ![Le volet des options pour la propriété Titre sans modification apportée, avec les options décrites ci-dessous](contentfiles/template_configdrawer.png)

source: **Label** Change the displayed label of the property that appears when the template is applied to an item by entering the text you want to appear in the "Alternate" label field for each property.
fr_fr: **Libellé** Changer le libellé d'affichage de la propriété qui apparaît lorsque le modèle est appliqué à un contenu en tapant le texte souhaité dans le champ "Alternative".

source: **Comment** Add alternate comments for the property in the "Alternate" field in this section. This will change the text under the property name when users are creating items using your resource template.
fr_fr: **Commentaire** Ajouter un commentaire dans le champ "Alternative" de cette section afin de modifier le texte qui apparaît sous le libellé de la propriété lorsque les utilisateurs se servent de ce modèle de ressource pour créer un contenu.

source: **Other options** In this section are a series of additional options for modifying the property when it is used with this template.
fr_fr: **Autres options** Dans cette section, on trouve des options supplémentaires de modification de la propriété en cas d'utilisation de ce modèle de ressource.

source: The "Use for resource title" checkbox allows you to select a property to serve as the title for the resource, instead of the default (`dcterms:title`). This property will display in the "title" field on browse pages.
fr_fr: La case à cocher "Afficher en tant que titre de ressource" permet de sélectionner une propriété comme titre de la ressource, au lieu de la propriété par défaut ('dcterms:title'). La propriété concernée apparaîtra comme champ "titre" dans les pages de recherche.

source: The "Use for resource description" checkbox allows you to select a property to serve as the description for the resource on browse pages, instead of the default (`dcterms:description`).
fr_fr: La case à cocher "Afficher en tant que description de ressource" permet de sélectionner une propriété comme description du contenu dans les pages de recherche, à la place de la propriété par défaut (`dcterms:description`).

source: The "Required" checkbox sets whether a property is required when the template is in use. If checked, users will not be able to save an item or item set using this template without adding data for this property.
fr_fr: La case à cocher "Requis" permet d'établir le statut obligatoire ou non d'une propriété lorsque le modèle est utilisé. Si la case est cochée, le contenu utilisant ce modèle ne pourra être sauvegardé que si le champ correspondant à cette propriété est rempli.

source: The "Private" checkbox sets the visibility of the data for this property. If checked, any data added by a user for this property will only be visible to the owner of the item or item set, global administrators, site administrators, and editors. It will not be visible to the public.
fr_fr: La case à cocher "Privé" établit le type de visibilité des données pour cette propriété. Si la case est cochée, les données ajoutées pour cette propriété ne sont visibles que pour le propriétaire du contenu ou de la collection, les administrateurs généraux, les administrateurs de sites et les éditeurs. Elles ne sont pas visibles pour le public.

source: **Note**: users working with the template will be able to toggle the visibility of this property on a case-by-case basis.
fr_fr: **Note** : les utilisateurs travaillant avec ce modèle de ressource pourront faire varier la visibilité de cette propriété au cas par cas.

source: Using the "Data type" dropdown, you can designate the data types for the property. Whichever you choose will be automatically loaded once someone selects that resource type and they will only be able to use these data type for the element when using this resource template.
fr_fr: Le menu déroulant "Types de données" permet d'identifier des types de données pour cette propriété. Quels que soient les types sélectionnés, ils seront automatiquement chargés et seront les seuls à pouvoir être utilisés pour cette propriété dans le cadre de ce modèle de ressource.

source: Text: textual and/or HTML input.
fr_fr: Texte : saisie texte et/ou HTML.

source: URI: a link with label.
fr_fr: URI : lien avec libellé.

source: Resource: either an existing Item or Item Set in the Omeka S install.
fr_fr: Resource : contenu ou collection existant dans cette instance Omeka S.

source: Additional options may be added by modules, such as [Numeric Data Types](../modules/numericdatatypes.md) and [Value Suggest](../modules/valuesuggest.md).
fr_fr: Des options supplémentaires peuvent être ajoutées via des modules comme [Numeric Data Types](../modules/numericdatatypes.md) et [Value Suggest](../modules/valuesuggest.md).

source: You can select multiple data types, for example giving users the option of Text or Resource for input, but not URI. All choices will appear in the data types field with an "X" to the right of their label - click the "X" to remove that data type.
fr_fr: Vous pouvez sélectionner plusieurs types de données, laissant par exemple aux utilisateurs le choix entre Texte et Ressource, mais pas URI. Tous les choix sélectionnés apparaissent dans le champ des types de données avec un X à leur droite - cliquer sur "X" pour supprimer un type de données.

source: ![The data types field with two types shown: numeric timestamp and text.](contentfiles/templates_multiType.png)
fr_fr: ![Le champ des types de données avec deux types sélectionnés.](contentfiles/templates_multiType.png)

source: Note: you must click the "Set changes" button at the bottom of the drawer for each property that you edit before exiting the drawer or moving on to another property! If you do not click "Set changes", your edits will not be saved.
fr_fr: Note : il faut cliquer sur le bouton "Appliquer" en bas du volet latéral avant de le quitter ! Dans le cas contraire, les modifications ne seront pas sauvegardées.

source: ![A close up of the drawer for editing property options with a large red arrow pointing down at an angle to the Set Changes button, which is on the very bottom of the image.](contentfiles/templates_setchanges.png)
fr_fr: ![Vue rapprochée du volet de modification de propriétés avec une flèche rouge pointant vers le bouton Appliquer tout en bas de la capture](contentfiles/templates_setchanges.png)

source: Users who select this resource template when creating an item will still be able to add other properties to the item, and they will only be required to fill out those fields you check as required.
fr_fr: Les utilisateurs qui créeront un contenu avec ce modèle de ressource pourront ajouter d'autres propriétés au contenu et seuls les champs déterminés comme "requis" seront obligatoires.

source: Edit a resource template
fr_fr: Modifier un modèle de ressource

source: Once you have created a resource template, you can edit it at any time by clicking the edit icon in the table of resource templates, or by clicking Edit in the upper right hand corner when viewing a resource template.
fr_fr: Une fois le modèle de ressource créé, vous pouvez le modifier à tout moment en cliquant sur l'icône de modification dans le tableau des modèles, ou en cliquant sur le bouton "Modifier ce modèle de ressource" une fois sur la page du modèle (dans le coin supérieur droit).

source: If you decide you do not want to edit the template or do not wish to save your changes, simply click the "Cancel" button located between the "Delete" and "Save" buttons in the upper right hand corner of the window.
fr_fr: Si vous ne souhaitez finalement pas modifier le modèle ou sauvegarder vos modifications, cliquez sur le bouton "Annuler", entre les boutons "Supprimer" et "Enregistrer" en haut à droite de la fenêtre.

source: ![Edit view of the template Person. There are eight properties in use.](contentfiles/resourcetemplate_edit.png)
fr_fr: ![Page de modification du modèle Image sous CC. Il y a six propriétés utilisées.](contentfiles/resourcetemplate_edit.png)

source: Review resource templates
fr_fr: Passer les modèles de ressource en revue

source: Clicking on the title of a resource template takes you to a table view of all the properties and property options for that template.
fr_fr: Cliquer sur le titre d'un modèle de ressource fait apparaître un tableau réunissant toutes les propriétés et options de propriétés pour ce modèle.

source: Each property displays as a row in the table, with columns for:
fr_fr: Chaque propriété occupe une ligne de ce tableau, avec des colonnes pour :

source: Original label, with an ellipsis button to see which the property's vocabulary, term, and original comment
fr_fr: Libellé d'origine, avec des points de suspension permettant de voir le vocabulaire de la propriété, le vocable correspondant ainsi que le commentaire d'origine

source: Data type
fr_fr: Types de données

source: Alternate label
fr_fr: Libellé alternatif

source: Alternate comment
fr_fr: Commentaire alternatif

source: Whether the property is required
fr_fr: Si la propriété est requise ou non

source: Whether the property's data is set to private.
fr_fr: Si la propriété est privée ou non.

source: Click the ellipsis next to the original label to open a draw displaying the property's vocabulary, term, and original comment.
fr_fr: Cliquer sur les points de suspension à côté du libellé d'origine ouvre un volet montrant le vocabulaire de la propriété, le vocable correspondant et le commentaire d'origine.

source: Use the buttons in the upper right of this page to export or edit the template.
fr_fr: Utiliser les boutons dans le coin supérieur droit de la page pour exporter ou modifier le modèle.

source: Share resource templates
fr_fr: Partager des modèles de ressource

source: It is possible to share a resource template between Omeka S installations by exporting and importing them.
fr_fr: On peut partager un modèle de ressource entre des instances d'Omeka S en les exportant ou en les important.

source: Export a resource template
fr_fr: Exporter un modèle de ressource

source: To export a resource template from your Omeka S installation:
fr_fr: Pour exporter un modèle de ressource depuis votre instance Omeka S :

source: Go to the "Resource templates" menu on the main navigation.
fr_fr: Se rendre dans le menu "Modèles de ressource" de la navigation principale.

source: Click the Label of the template you want to export.
fr_fr: Cliquer sur le nom du modèle à exporter.

source: On the resource template view page, click the "Export" button in the upper right corner of the screen.
fr_fr: Une fois sur la page du modèle, cliquer sur le bouton "Export" en haut à droite de l'écran.

source: ![A red arrow points to the export button on a screen showing a resource template labelled "Textual Work"](contentfiles/templates_export.png)
fr_fr: ![Une flèche rouge pointe vers le bouton d'export d'un modèle de ressource](contentfiles/templates_export.png)

source: Exporting a resource template will download it to your computer's default download location as a json file with the same name as the resource template's Label.
fr_fr: L'action d'export du modèle de ressource le télécharge comme fichier json dans le dossier de téléchargement par défaut de votre ordinateur, avec le même nom que le libellé du modèle de ressource.

source: Import a resource template
fr_fr: Importer un modèle de ressource

source: !!! note If you want to import a resource template using a [Custom Vocab](../modules/customvocab.md), you will need to manually reproduce the Custom Vocab on the second Omeka S installation *before* importing the resource template.
fr_fr: !!! note Si vous souhaitez importer un modèle de ressource utilisant un [Vocabulaire personnalisé](../modules/customvocab.md), vous devez reporter le vocabulaire personnalisé sur la seconde instance d'Omeka S *avant* d'importer le modèle de ressource.

source: To import a resource template (a JSON file exported from a different S installation) into your Omeka S installation:
fr_fr: Pour importer un modèle de ressource (un fichier json exporté d'une autre instance S) sur votre instance Omeka S :

source: Go to the **Resource Templates** tab on the main navigation
fr_fr: Se rendre dans le menu "Modèles de ressource" de la navigation principale

source: Click the "Import" button in the upper right corner of the screen.
fr_fr: Cliquer sur le bouton "Importer" en haut à droite de l'écran.

source: ![Red arrow points to the Import button on the browse resource templates page of the admin site of an Omeka S installation](contentfiles/templates_import1.png)
fr_fr: ![Flèche rouge pointant vers le bouton Importer sur la page des modèles de ressource du site admin d'une instance Omeka S](contentfiles/templates_import1.png)

source: On the Resource templates: Import page, click the "Choose File" button.
fr_fr: Sur la page d'import des modèles de ressource, cliquer sur le bouton "Parcourir".

source: This will open your browser's file selection window. Choose the JSON file for the resource template you want to import.
fr_fr: Cette action ouvre votre fenêtre de sélection de fichier. Sélectionner le fichier json du modèle de ressource à importer.

source: Click the "Review import" button.
fr_fr: Cliquer sur le bouton "Revoir l'importation".

source: On the Review page, you will be able to check that properties and property options are correct.
fr_fr: La page de revue permet de vérifier que toutes les propriétés et options de propriétés sont correctes.

source: Imported templates which used [Value Suggest](../modules/valuesuggest.md) or [Custom Vocab](../modules/customvocab.md) will indicate in the Data type column what the original source was, and a dropdown to allow you to select a new Data type (if you do not have the necessary modules, the dropdown will only show the default options).
fr_fr: Les modèles importés utilisant [Value Suggest](../modules/valuesuggest.md) ou [Custom Vocab](../modules/customvocab.md) indiquent la source dans la colonne Type de données. Un menu déroulant permet également de sélectionner de nouveaux types de données (sans ces modules, le menu indiquera seulement les options par défaut).
