Repository: biblibre/omeka-s-enduser-fr
Catalog: locales/*/LC_MESSAGES/docs/content/vocabularies.po
Languages: fr_fr

source: Vocabularies
fr_fr: Vocabulaires

source: Vocabularies are a collection of published RDF metadata Classes and Properties for describing a Resource of a particular type. Linked open vocabularies are created externally to Omeka, and, because they are openly available, can be imported (with some limitations) into Omeka S for use throughout the installation. If you have special and uncommon item types or classes, you may wish to find and import a linked open vocabulary to standardize the description of those particular items. These vocabularies are sometimes referred to as ontologies.
fr_fr: Les vocabulaires constituent des ensembles de classes de métadonnées et de propriétés RDF servant à décrire un type de ressource spécifique. Les linked open vocabularies (vocabulaires ouverts liés) sont créés hors Omeka, et parce qu'ils sont ouverts, peuvent être importés (malgré certaines limites) dans Omeka S. Si vous travaillez avec des types ou classes de contenus inhabituels, vous pouvez trouver et importer un vocabulaire lié pour en formaliser la description. Ces vocabulaires sont parfois appelés ontologies.

source: For example, you can find ontologies for describing [audio signals](https://lov.linkeddata.es/dataset/lov/vocabs/af), [air traffic data](https://lov.linkeddata.es/dataset/lov/vocabs/atd), and [algorithms](https://lov.linkeddata.es/dataset/lov/vocabs/algo), by providing metadata fields particular to those object types.
fr_fr: On trouve par exemple des ontologies pour décrire les [signaux sonores](https://lov.linkeddata.es/dataset/lov/vocabs/af), les [données de trafic aérien](https://lov.linkeddata.es/dataset/lov/vocabs/atd) et les [algorithmes](https://lov.linkeddata.es/dataset/lov/vocabs/algo), qui fournissent des champs de métadonnées spécifiques à ces types d'objets.

source: *"A vocabulary in LOV gathers definitions of a set of classes and properties (together simply called terms of the vocabulary), useful to describe specific types of things, or things in a given domain or industry, or things at large but for a specific usage." (Source: <https://lov.linkeddata.es/dataset/lov/about>)*
fr_fr: *"Un vocabulaire LOV réunit des définitions d'un ensemble de classes et de propriétés (qui constituent les termes ou vocables du vocabulaire), servant à décrire un type précis d'objets, des objets relevant d'un domaine particulier, ou encore des objets généraux qui ont des usages spécifiques." (Source: <https://lov.linkeddata.es/dataset/lov/about>)*

source: The most-used [Linked Open Vocabulary](https://lov.linkeddata.es/dataset/lov/about) is Dublin Core Terms (`dcterms:`).
fr_fr: Le [vocabulaire lié](https://lov.linkeddata.es/dataset/lov/about) le plus utilisé est Dublin Core Terms ('dcterms:').

source: !!! note Vocabularies in Omeka S are not the same thing as controlled vocabularies or authority files, which consist of terms and concepts, rather than Classes and Properties. In Omeka S, controlled vocabularies can be managed using the [Value Suggest](../modules/valuesuggest.md) and [Custom Vocab](../modules/customvocab.md) modules.
fr_fr: !!! note Les vocabulaires dans Omeka S ne correspondent pas à des vocabulaires contrôlés ou fichiers d'autorités, qui constituent un ensemble de termes et de concepts, plutôt qu'un ensemble de Classes et de Propriétés. Les vocabulaires contrôlés peuvent être gérés dans Omeka S en utilisant les modules [Value Suggest](../modules/valuesuggest.md) et [Custom Vocab](../modules/customvocab.md).

source: Global Administrators can manage their installation’s vocabularies from the **Vocabularies** tab on the left hand navigation of the Admin Dashboard. Supervisors can add, edit, and delete their own vocabularies.
fr_fr: Les administrateurs généraux peuvent gérer les vocabulaires de leur instance via l'onglet **Vocabulaires**, dans la navigation à gauche du tableau de bord Admin. Les superviseurs peuvent ajouter, modifier et supprimer leurs propres vocabulaires.

source: Omeka S comes pre-loaded with the following vocabularies: [Dublin Core](http://purl.org/dc/terms/); [Dublin Core Type](http://purl.org/dc/dcmitype/); [Bibliographic Ontology](https://bibliontology.com/); and [Friend of a Friend](https://en.wikipedia.org/wiki/FOAF_(ontology)).
fr_fr: Omeka S contient par défaut les vocabulaires suivants : [Dublin Core](http://purl.org/dc/terms/); [Dublin Core Type](http://purl.org/dc/dcmitype/); [Bibliographic Ontology](https://bibliontology.com/); [Friend of a Friend](https://en.wikipedia.org/wiki/FOAF_(ontology)).

source: This [screencast](https://vimeo.com/449764902) walks through managing and adding vocabularies:
fr_fr: Cette [vidéo](https://vimeo.com/449764902) montre comment gérer et ajouter des vocabulaires :

source: View vocabularies
fr_fr: Voir les vocabulaires

source: The main view of the **Vocabularies** tab in the Admin Dashboard displays the existing vocabularies for the Omeka S installation.
fr_fr: La vue principale de l'onglet **Vocabulaires** du tableau de bord Admin affiche les vocabulaires existants pour l'instance d'Omeka S.

source: ![Main view of vocabularies, with columns for label, prefix, classes, and properties counts and information](contentfiles/vocabularies.png)
fr_fr: ![Vue principale des vocabulaires, avec les colonnes pour le libellé, le préfixe, le nombre de classes et de propriétés](contentfiles/vocabularies.png)

source: Vocabularies are displayed in a table with headings for **Label** (name of vocabulary), **Prefix** (used by the database), **Classes** (number of classes in the vocabulary), and **Properties** (number of properties in the vocabulary). You can sort vocabularies by these columns using the up and down arrows at the right end of each column.
fr_fr: Les vocabulaires sont affichés dans un tableau avec des colonnes **Libellé** (nom du vocabulaire), **Préfixe** (tel qu'utilisé dans la base de données), **Classes** (nombre de classes du vocabulaire) et **Propriétés** (nombre de propriétés du vocabulaire). La liste peut être organisée selon chacun de ces critères avec les flèches haut et bas à droite des colonnes.

source: You can use the icons at the right of the Label field to manage individual vocabularies. The edit icon (pencil) takes you to the edit page for that vocabulary, the delete icon (trash can) opens a sidebar to delete the vocabulary, and the details icon (ellipsis) opens a sidebar with information about the vocabulary.
fr_fr: Vous pouvez utiliser les icônes à droite du libellé pour gérer les vocabulaires. L'icône de modification (crayon) conduit à une page de modification pour ce vocabulaire spécifique, l'icône de suppression (poubelle) ouvre un volet latéral de suppression du vocabulaire et l'icône des détails (points de suspension) ouvre un volet latéral contenant les informations sur le vocabulaire.

source: When editing a vocabulary, you can make changes to the **label** and add **comments**.
fr_fr: Vous pouvez modifier le libellé du vocabulaire et ajouter des commentaires.

source: Add a vocabulary
fr_fr: Ajouter un vocabulaire

source: New vocabularies must be imported from an existing metadata standard source. In order to import a new vocabulary, you must have a vocabulary file or a stable link to a vocabulary.
fr_fr: Les nouveaux vocabulaires doivent être importés depuis une source de métadonnées existante. Pour importer un nouveau vocabulaire, il faut un fichier de vocabulaire ou un lien stable vers le vocabulaire.

source: The New vocabulary page has three sections: Basic Info, File, and Advanced.
fr_fr: La page Nouveau vocabulaire contient trois sections : Info de base, Fichier et Avancé.

source: Note that you may have to research in order to find the prefix, namespace URI, and label for the vocabulary, as these are not standardized. In addition to the vocabulary's website, you might consult <https://lov.linkeddata.es/dataset/lov/vocabs>.
fr_fr: À noter qu'il faut dans certains cas rechercher le préfixe, l'URI et le libellé du vocabulaire, qui ne sont pas standardisés. En plus du site du vocabulaire, vous pouvez consulter <https://lov.linkeddata.es/dataset/lov/vocabs>.

source: After you have imported a vocabulary, you can use the Edit function to modify the vocabulary's Label and Comment, and to upload an updated vocabulary RDF file.
fr_fr: Une fois le vocabulaire importé, vous pouvez modifier le libellé et le commentaire du vocabulaire, ainsi que charger une version à jour du fichier RDF du vocabulaire.

source: Basic info
fr_fr: Info de base

source: This section contains the basic information for the vocabulary
fr_fr: Cette section contient les informations principales concernant le vocabulaire

source: Label (required): the display name for the vocabulary in lists (e.g., "Dublin Core," "Friend of a Friend").
fr_fr: Label (obligatoire) : le nom d'affichage du vocabulaire dans les listes (e.g., "Dublin Core," "Friend of a Friend").

source: Comment: any comments you have.
fr_fr: Commentaire : tout commentaire utile.

source: Namespace URI (required): this should be provided by the vocabulary.
fr_fr: URI de l'espace de noms (obligatoire) : devrait être fourni par le vocabulaire.

source: Namespace prefix (required): This will display before the property, indicating which vocabulary (e.g., the prefix for Dublin Core is dcterms).
fr_fr: Préfixe de l'espace de noms (obligatoire) : s'affichera devant la propriété, indiquant ainsi le vocabulaire utilisé (e.g., le préfixe pour Dublin Core est dcterms).

source: ![New vocabulary basic settings, nothing entered](contentfiles/vocab_addBasicInfo.png)
fr_fr: ![Options de base de la page Nouveau vocabulaire, champs vides](contentfiles/vocab_addBasicInfo.png)

source: File
fr_fr: Fichier

source: This section deals with the file for the vocabulary.
fr_fr: Cette section concerne le fichier vocabulaire.

source: Vocabulary file: Upload a file from your computer *or*
fr_fr: Fichier vocabulaire : verser un fichier depuis votre ordinateur *ou*

source: Vocabulary URL: Enter the vocabulary's URL here.
fr_fr: URL du vocabulaire : saisir l'URL du vocabulaire.

source: File format: a dropdown, select from:
fr_fr: Format de fichier : menu déroulant, choisir parmi :

source: Autodetect
fr_fr: Auto

source: ![New vocabulary file settings, with no data entered and no file chosen](contentfiles/vocab_addFile.png)
fr_fr: [Options de fichier de la page Nouveau vocabulaire, champs vides et sans fichier](contentfiles/vocab_addFile.png)

source: Advanced
fr_fr: Avancé

source: This section has advanced vocabulary settings.
fr_fr: Cette section contient des options avancées du vocabulaire.

source: Language: Enter the preferred language of the labels and comments using an IETF language tag.
fr_fr: Langue préférée : saisir la langue préférée pour les étiquettes et commentaires à partir du code langue IETF.

source: Label property: if this vocabulary uses an unconventional property for labels, enter the full property URI in angle brackets (`<`, `>`)in this field.
fr_fr: Propriété pour le libellé : si ce vocabulaire utilise une propriété inhabituelle pour les étiquettes, saisir l'URI complète de la propriété entre crochets (`<`, `>`).

source: ![New vocabulary advanced settings, with no data entered](contentfiles/vocab_addAdvanced.png)
fr_fr: ![Options avancées de la page Nouveau vocabulaire, champs vides](contentfiles/vocab_addAdvanced.png)

source: Edit a vocabulary
fr_fr: Modifier un vocabulaire

source: You can edit existing vocabularies by clicking the edit button (pencil icon) on the table of vocabularies.
fr_fr: Vous pouvez modifier les vocabulaires existants en cliquant sur le bouton modifier (icône de crayon) dans le tableau des vocabulaires.

source: You can also update the vocabulary by either uploading a new vocabulary file or entering the vocabulary URL and saving changes. You will be able to review any changes when updating a vocabulary. If you decide you do not wish to save your changes, or clicked on the edit button by mistake, you can click the "Cancel" button next to the "Save" button.
fr_fr: Vous pouvez aussi mettre à jour le vocabulaire en chargeant un nouveau fichier ou en saisissant l'URL du vocabulaire puis en sauvegardant les modifications. Toute modification faite pourra être passée en revue. Si vous ne souhaitez pas enregistrer les modifications ou que vous avez cliqué sur le bouton modifier par erreur, vous pouvez cliquer sur le bouton "Annuler" à côté du bouton "Enregistrer".

source: Vocabulary import
fr_fr: Import de vocabulaire

source: Omeka S will import properly formatted vocabularies/ontologies. `rdfs:Class` and `rdfs:Property` data will be available.
fr_fr: Omeka S peut importer tout vocabulaire/ontologie correctement formaté. Les données `rdfs:Class` et `rdfs:Property` sont alors disponibles.

source: For Web Ontology Language (OWL) data, Omeka S will store only the RDF/S super-Properties and -Classes. Omeka S does not enforce any declaration or inferencing rules from OWL. Thus, for example, an `owl:Class` is treated in Omeka S like an `rdfs:Class`.
fr_fr: Pour les données OWL, Omeka S ne conserve que les super-propriétés et classes RDF/S, et n'utilise aucune des règles de déclaration ou d'inférence provenant d'OWL. Par exemple, une 'owl:Class' est traitée par Omeka S comme une 'rdfs:Class'.

source: Similarly, the following are all treated only as `rdfs:Property`. OWL domains and ranges are also not enforced or stored:
fr_fr: Les propriétés suivantes sont également traitées comme des 'rdfs:Property'. Les domaines et gammes ne sont pas non plus implémentés ni stockés :

source: For example, an imported ontology with an `owl:ObjectProperty` is not restricted to having objects that are URIs; Omeka S will accept a Literal value without complaint. You can use [resource template](../content/resource-template.md) settings to require a data type on properties, so that someone filling out, for example, the `owl:ObjectProperty` field in a template is required to enter a URI value.
fr_fr: Par exemple, pour une ontologie importée contenant un 'owl:ObjectProperty', les objets ne sont pas limités aux URI ; Omeka S permet sans difficulté de saisir une valeur textuelle. Vous pouvez utiliser les paramètres d'un [modèle de ressource](../content/resource-template.md) pour limiter le type de données utilisé et contraindre une personne remplissant le champ 'owl:ObjectProperty' à le faire avec une URI.

source: It is up to the person entering metadata to adhere to the standards as best they can.
fr_fr: C'est à la personne saisissant les métadonnées de respecter au mieux les standards du vocabulaire.

source: Delete a vocabulary
fr_fr: Supprimer un vocabulaire

source: With the exception of Dublin Core and Dublin Core Type, Global Administrators can delete any vocabulary from the Omeka S installation, either from the Vocabulary browse or the Vocabulary edit page. Supervisors can delete vocabularies they have imported, but not others' vocabularies or the default ones included with Omeka S.
fr_fr: À l'exception de Dublin Core et Dublin Core Type, les administrateurs généraux peuvent supprimer tout vocabulaire de l'instance Omeka S, soit en passant par le tableau des vocabulaires, soit directement sur la page de modification d'un vocabulaire. Les superviseurs peuvent supprimer les vocabulaires qu'ils ont importés, mais pas ceux des autres ou les vocabulaires par défaut d'Omeka S.

source: From the Vocabulary browse page, click the trash can/delete icon in the row for the vocabulary you want to delete (labelled as 1 in the image below). A drawer will open on the right side of the browser asking you to confirm that you want to delete the vocabulary (labelled as 2 in the image below). To delete, click the "Confirm delete" button, and to cancel, simply close the drawer.
fr_fr: Depuis le tableau des vocabulaires, cliquer sur la poubelle/l'icône supprimer sur la ligne du vocabulaire concerné (1 dans la capture ci-dessous). Un volet latéral s'ouvre à droite de la page et vous demande de confirmer la suppression du vocabulaire (2 dans la capture ci-dessous). Pour supprimer, cliquer sur "Confirmer la suppression" ; pour annuler, fermer le volet.

source: ![A view of the vocabularies browse page, with a drawer open on the left asking the user to confirm delete. There is a blue number 1 next to the trash can icon and a blue number 2 just to the left of the red "Confirm delete" button.](contentfiles/vocab-delete1.png)
fr_fr: ![Une vue de la page de navigation des vocabulaires, avec un volet ouvert à droite demandant la confirmation de la suppression. Numéro 1 en bleu à côté de l'icône poubelle et numéro 2 en bleu à côté du bouton "Confirmer la suppression".](contentfiles/vocab-delete1.png)

source: From the Edit Vocabulary page, you can click the large red "Delete" button in the upper right-hand corner of the page. This will open a drawer which will ask you to confirm the deletion. To delete, click the "Confirm delete" button, or to cancel, simply close the drawer.
fr_fr: À partir de la page de modification d'un vocabulaire, vous pouvez cliquer sur le bouton rouge indiquant "Supprimer", en haut à droite de la page. Un volet de confirmation de la suppression s'ouvre alors. Pour supprimer, cliquer sur "Confirmer la suppression" ; pour annuler, fermer le volet.

source: ![Edit vocabulary page for "Linked Gen. Data". There is no data in the comments field. A red arrow points to a pale red button labelled "Delete"](contentfiles/vocab-delete2.png)
fr_fr: ![Page de modification pour "Bibliographic Ontology". Une flèche rouge pointe vers le bouton "Supprimer"](contentfiles/vocab-delete2.png)
